{
  "id": "rec1SDeetpDnnmVPp",
  "title": "Coping with grief",
  "storyCopy": "",
  "storyTranscript": "\\# Robyn Watts\n\n[00:00:00] \n\nRobin Watts. You want to know my life story? Okay. Got two girls. I started out life as a teacher, working life as a teacher.\n\nDidn't like that and got a job in local government, so I ended up the last job I had there for 20 years. And then after I retired, I discovered orange sky and my husband got sick. And he subsequently died. And Orange Sky, as I've told Nic, saved me. It made me get out of bed every day, try and push through the grief, and it's just been the best thing I've ever done, apart from having a lovely family.\n\nOh, I love it. I just absolutely love it. I honestly believe. [00:01:00] That we give a lot to friends, but they give just as much back. I go home on top of the world some days. Yeah. And I look forward to the days that I'm on shift. I love it. Really love it.\n\nIt was compounded, my husband had myeloma and the life expectancy of myeloma now is seven years, and he died after about. Three and a half. So he didn't last very long. But grief for my husband dying was a second wave of grief because six weeks before he died, our 42-year-old son-in-law just died suddenly in Sydney, leaving a 4-year-old and a 6-year-old.\n\nAnd my daughter. And totally unexpected, just completely out of left field. And he was the most wonderful human being. He was [00:02:00] American. And then later on, Ron died. And that was, I think I no, I was in denial of how sick he was. Every time we went to the hematologist, I would. Feel, oh, it wasn't that bad.\n\nIt could have been worse, but something happened to his spleen and he just said one night, I feel like I've got a pain in my chest. So I thought it might have been a heart. His heart went into hospital, didn't come out. And ended up in ICU for a week, which was horrible. Horrible. And then went into palliative care and died the next day.\n\nSo it was, but he had also been an orange sky volunteer, so I felt like I was carrying on the family tradition too by continuing to do that. But it truly did help me get out of bed. I had to, I had no choice. People depending on you, and without that, I [00:03:00] probably could have stayed. But everybody I know has said to me how well I've coped.\n\nAnd I think I've coped reasonably well. But I, I miss him. Of course .\n\nI do on my shift on Thursday, we've got, that's the longest shift we've had.\n\nIt's the oldest shift and we, the team, I've got the two boys I volunteer with, we've been together for years, probably five years. Or Russ has probably been there nearly seven years. And yes, they were supportive. I was very touched that the team leaders all went to Ron's funeral. Very unexpected. And they've helped me a lot.\n\nBut the interesting thing was that the friends. Where my shift on Thursday is the friends knew him too. That was nice, there was a consistency there. But I just I just love it. Absolutely love it. Are there particular things about it that you think are [00:04:00] more profound than others or because I think there's some parts of the, so just simple, but some parts thought out. I think it's, yes, the laundry's important obviously for. People's dignity and they have a right to that. But I think making them feel seen and heard, for me personally, that's really important and genuinely, calling them by name and remembering to ask them something.\n\nOne of my favorite quotes is from Maya Angelou says, people will forget what you said, forget what you did. But they will never forget the way you made them feel. And I really believe that. I think that is true for me, but I try to make that true for them too. So I'll, we'll talk about something that's meaningful to them.\n\nI think one of the trickier things is learning to respect and know the [00:05:00] boundaries because some people don't wanna share that much. And we've got a friend who we would, we are very frustrated. We really wanna be able to help him, but he feels that he has enough and he doesn't want to take anymore.\n\nAnd he struggles, but I've since found out he has got an advocate, which is really good. But that's a failing in the system. I think this particular friend is quite deaf and he's waited probably 18 months to get hearing aids, and I don't know how much they've shown him, but we had a volunteer on the shift one day who'd had some experience as an audiologist.\n\nSo she showed him how to put them in and he said, oh, I can hear now, but I don't, he's not doing it himself and we can't offer he's quite private. And he's quite proud, which we respect.\n\nI'm up to my nine years this year, and I wanna get my 10 years, then I'll get my unpaid long service leave.\n\nNo, I just, that is [00:06:00] a very concrete goal. I want to get to my 10 years. I've got no intention of leaving at this stage. Sometimes some of the processes that come from HQ can be a bit frustrating. I have to say though, I'd like this on record that my regional coordinator, Carolyn, is superb.\n\nShe is the best I've ever worked with. She is just amazing. Her level of support to me as service leader is immeasurable. So she's a buffer between me and the powers that be.\n\nWhat do you think or hope might happen in the next 10 years or in 10 years time? Oh, that's a good question. On a grassroots level, I hope they keep doing what they're doing. And I hope. They don't diverge too much [00:07:00] from that so that they're trying to do so many things and nothing gets done really well. I remember at the last summit I went to, they were talking about going to San Francisco, and I remember saying Then you need to get it working effectively here before you go anywhere else.\n\nI would like to see, a little bit more acknowledgement of a lot of the services. Like anybody who knew me 9, 8, 9 years ago knew that. I always said, we get forgotten down here. And it, I get that we are a long way away. I understand that. But there are times when we. We can't do the things they can do on the mainland.\n\nSo we left feeling a little bit out of things. But in terms of. The the volunteers, I think always uppermost in the minds of the staff should be [00:08:00] what the volunteers are doing because without the volunteers you have no orange sky, you have no ladder to climb, you have nothing. And I think I do what I can for, to acknowledge my team.\n\nWe've got a fabulous team of team leaders, wonderful volunteers, absolutely awesome. But sometimes it's nice to. Know that they're appreciated by others. And it's simple things like, it's our birthday in July last year. They put in the newsletter in the Spin Cycles services, birthdays.\n\nThey didn't put ours in last year. They forgot it. And that's, I know I get that we are one of however many services in Australia, but to us we are the service in Tassie. So that sort of thing upsets me a little bit.\n\nAnd I'm proud of Orange Sky. I'm very proud of Orange Sky. I'm proud to volunteer for it. I'm proud of what it [00:09:00] does. And it's, there's nothing better than when I drive to my shift on Wednesday.\n\nAnthony's there waving when I drive the van in, and, it's just such a positive experience all round. But I do think, I do think that they're going to have to be very careful that they don't lose sight of that up there. \n\n",
  "excerpt": "\\# Robyn Watts [00:00:00]  Robin Watts. You want to know my life story? Okay. Got two girls. I started out life as a teacher, working life as a teacher. Didn't like that and got a job in local governm...",
  "videoStoryLink": "https://share.descript.com/view/R9Qh8YbZHqJ",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/R9Qh8YbZHqJ\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recWHJURnsk2rq6Yg"
  ],
  "storytellerNames": [
    "Robyn Watts"
  ],
  "mediaIds": [
    "rec78I7m3amQvBwO5"
  ],
  "themeIds": [
    "recciysdsurZq0zCt",
    "rec6irKtwjmRexebW",
    "recDWH8SGTQBz6R89",
    "recwfykgfb3VE18rr"
  ],
  "themeNames": [],
  "location": "Hobart",
  "shifts": [
    "recsVCxQUtq7S86eP"
  ],
  "featured": true
}