{
  "id": "rec6h9d2uWEsp5Rpp",
  "title": "More Than Just Washing: The Heart of Orange Skies",
  "storyCopy": "\"I think certainly there's certainly more to Orange Sky than doing people's washing. And we've become quite close to the point where if they're not here, I worry about them.\"\n\nThis volunteer captured what makes Orange Sky special – the genuine connections that form between volunteers and friends. What starts as washing clothes often grows into meaningful relationships built on trust and mutual care.\nOur volunteers don't just provide a service; they become part of a community, one load of laundry and one conversation at a time.\n#BeyondService #CommunityConnection #OrangeSkyStories\n",
  "storyTranscript": "More Than Just Washing: The Heart of Orange Skies\n===\n\nSpeaker 16: ~They tell us the good stuff as well. Yeah, yeah, ~[00:00:00] I think certainly there's certainly more to Orange Sky than doing people's washing. And we've become quite close to the point where if they're not here, I worry about them, which Steve in there always says, don't worry.\n\nThey come back. But I'll go home and worry about where, somebody that I think is a bit vulnerable is if I don't see them the following week. I've probably got better at that over the four years. Yeah. Don't lay awake at night as much as I used to. .\n\nPeople volunteer for all sorts of different reasons and some of the volunteers that I've met some of them do it to get hours on a uni degree or on a course or something. Some do it. I grew up in a family. We volunteered.\n\nI was brought up to always give back. My mother was a doer, she was involved in, she was one of those ladies that did that, did the flowers, and polished the brass, and she was a girl guide leader [00:01:00] and. It's just, I don't know. It's just a thing I've always done. ~And once I retired, I was able to do more of it.~\n\n~And as I said, covid, I probably wouldn't have done it without Covid 'cause I would've just continued doing my barley gig.~\n\n",
  "excerpt": "\"I think certainly there's certainly more to Orange Sky than doing people's washing. And we've become quite close to the point where if they're not here, I worry about them.\" This volunteer captured w...",
  "videoStoryLink": "https://share.descript.com/view/qZJeUbl0L5h",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/qZJeUbl0L5h\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "reczKGffzeCWabbbe"
  ],
  "storytellerNames": [
    "Pam Ramsay"
  ],
  "mediaIds": [
    "recc9is3EHK6L20Qb"
  ],
  "themeIds": [
    "recGhIsfFcMrizrUT",
    "recr2hTSvcgLCIWgR",
    "recChQdJ5kWyGqAe5",
    "recks5IMot5a2l3L4"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "recMnBRiSmrELgnVe"
  ],
  "featured": true
}