{
  "id": "rec6UV5NUzptrXwP3",
  "title": "Freddy on Orange Sky",
  "storyCopy": "\"It's a very lonely world for me... But it's rewarding too at the same time because I learned a lot of things. I lost a lot too.\"\n\nSeven months into experiencing homelessness, Freddy shared these powerful words with us. His story reminds us that behind every experience of hardship is a person with hopes, dreams, and a desire for connection.\nWhat really touched our team? Freddy's wish to volunteer with Orange Sky! This full-circle moment shows how the simple act of conversation and clean laundry can spark belonging and purpose.\n#ConversationsMatter #MoreThanLaundry #OrangeSkyStories\n",
  "storyTranscript": "Freddy Short OS Clip\n===\n\nSpeaker 12: [00:00:00] I became homeless just seven weeks ago seven months ago.\n\nIt's very lonely world for me. For me, I think I'm lonely. I'm lonely. I have to start a new life, but it's very difficult for me. I can't get over it . Starting a new life here. I still have my family back at home.\n\nIt's been challenging and I think it's rewarding too at the same time because I learned a lot of things I lost a lot too.\n\nBut there's a challenging part is losing a lot of friends.\n\nOrange Sky, I've seen it on TV and I really appreciate the work they do and I highly recommend the people who fund and support these services . God bless you all , you got a heart, heart of gold and I really appreciate your support for the sky orange people, I'd like to be a volunteer [00:01:00] too, to help wash the clothes for like this, but I'm not sure how it's gonna work.\n\nI never been in Australia, homeless in winter, but summer is all right. That's why I take a lot of clothes there in there .\n\n\n\n",
  "excerpt": "\"It's a very lonely world for me... But it's rewarding too at the same time because I learned a lot of things. I lost a lot too.\" Seven months into experiencing homelessness, Freddy shared these power...",
  "videoStoryLink": "https://share.descript.com/view/WOHo3Db941r",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/WOHo3Db941r\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recSxR9ED03I7PuGg"
  ],
  "storytellerNames": [
    "Freddy Wai"
  ],
  "mediaIds": [
    "recH8gjZL3yfxIlf5"
  ],
  "themeIds": [
    "recGQB2rwpmldhZed",
    "recloBlgnFZ75Zfl7",
    "rec3gpxICZFBLDtLH",
    "rec8vJI8b206U1wXL"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "recZ0LlHTsyQtlmA8"
  ],
  "featured": true
}