{
  "id": "rec9ZKKH2ZXrHFIgr",
  "title": "The True Meaning of Wealth: Health, Family, and Love",
  "storyCopy": "\"There's nothing like having reasonable good health, your partner and your family. Nothing else matters. The house and the car doesn't even matter at all.\"\n\nDavid shared these wise words with us, reminding us all what truly matters in life. When everything else is stripped away, it's our connections to each other that sustain us.\nThat's why at Orange Sky, we focus on creating spaces where people can connect genuinely, without judgment. Clean clothes are important, but conversation is essential.\n#WhatReallyMatters #HumanConnection #OrangeSkyConversations\n",
  "storyTranscript": "The True Meaning of Wealth: Health, Family, and Love\n===\n\nDavid: ~The book encourages them to show what you can get through as long as you've got your partner and stay together. ~[00:00:00] There's nothing like having reasonable good health, your partner and your family. Nothing else matters. The house and the car doesn't even matter at all. What difference does it make? You lose the house but as long as you've got your family and your partner then you've got everything.\n\n\n~Think the story is so important in the book because it encourages people to stay together and to be able to get through tough times.~\n\n",
  "excerpt": "\"There's nothing like having reasonable good health, your partner and your family. Nothing else matters. The house and the car doesn't even matter at all.\" David shared these wise words with us, remin...",
  "videoStoryLink": "https://share.descript.com/view/SXnp9h3DyDQ",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/SXnp9h3DyDQ\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recpef5KEbRJglgGG"
  ],
  "storytellerNames": [
    "David Allen"
  ],
  "mediaIds": [
    "reca0o6mvLBetAwRN"
  ],
  "themeIds": [
    "recKrstJ18w9wVOgm",
    "recNpLT6EDMYS3Sci",
    "reciX9GnrevKAtAzW",
    "recD4ujK5lFS42k4M"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "rechTpnJ3jSEKsyh3"
  ],
  "featured": true
}