{
  "id": "recAawuHnEzLSbMHm",
  "title": "The Importance of Education and Hope",
  "content": "🌟 At 65, I've dedicated my life to this community and passed on the values of education and wellbeing to my children. Now, as we prepare to enjoy a new chapter at our island camp, I look forward to teaching them to live off the land and cherish our rich heritage. Education and hope are timeless gifts. 🙌✨ #Education #Hope #FamilyTraditions\n\n",
  "transcript": "\\# The Importance of Education and Hope\n\n[00:00:00] My age now is 65 this year.\n\nI think I done my share in this community. I find my children are all respectful. I've always reminded them, don't rob your children of schooling. Make sure you send 'em to school every day. Education is important and their health and wellbeing is too.\n\nMy mom, we're waiting to move into our new home now at bottom end, and all she wants to do is go out camping just to laying on the beach and fishing. So I'm looking forward to that. We've leased some land at the other end of the island and ask someone to build these camps up and it'll be my camp, my children camp.\n\nAnd they're gonna learn the skills of living out there in the bush, living off the land. \\~~Back then we only had that one boat. We walked, so walked right down there. It was fun. We was in our team on matter back then. Now.\\~~\n\n",
  "excerpt": "🌟 At 65, I've dedicated my life to this community and passed on the values of education and wellbeing to my children. Now, as we prepare to enjoy a new chapter at our island camp, I look forward to t...",
  "videoUrl": "https://share.descript.com/view/oaRpFZmFnIZ",
  "hasVideo": true,
  "image": null,
  "hasImage": false,
  "storytellerIds": [
    "recXb8iKd3oUoiOao"
  ],
  "storytellerNames": [],
  "mediaIds": [
    "rec1PrDLvZIWVkVF2"
  ],
  "themeIds": [
    "rec1SvbxgeeTigdB1",
    "recqPay4IyUBUHCoD",
    "recmxUGGmbggPA1qh",
    "recJNwPtY4l5pA6iA"
  ],
  "location": "Unknown",
  "createdAt": "2025-05-23T00:03:54.000Z",
  "featured": false
}