{
  "id": "recbVHDwy8oLlvIzv",
  "title": "The Antidote to Modern Isolation",
  "storyCopy": "",
  "storyTranscript": "\\# The Antidote to Modern Isolation\n\n\\~~It's just, it's one more thing that we don't have to worry about. So it's appreciated and volunteers and connection and communication and stuff.\\~~\n\n[00:00:00] isolation is like the struggle of modern society, then connection to communities, the antidote.\n\nI think it's practical. It's practical, more so than anything. It's awesome. Also it speaks to what people that are living on the streets need in a wider sense is access to facilities . There's two types of facilities that would benefit from having community access to the first is necessary.\n\nUtilities like kitchen, shower, laundry. 'cause there aren't spaces where you can just go to do those necessary living function things for free. And the second, third space that would be amazing to see more so in the community is free spaces just to be and to build community from, for example a clothing exchange, like free clothing exchange, [00:01:00] a place with couches, with a kitchen, with a lounge, just to hang out during the daytime.\n\nA place where there's a free bookshelf, a place that encourages free trade. 'cause if you can facilitate an environment where people can help people, that's the best way to solve things. Most people are generous especially people that are in difficult situations.\n\n",
  "excerpt": "\\# The Antidote to Modern Isolation \\~~It's just, it's one more thing that we don't have to worry about. So it's appreciated and volunteers and connection and communication and stuff.\\~~ [00:00:00] is...",
  "videoStoryLink": "https://share.descript.com/view/KVOLdx1NzLY",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/KVOLdx1NzLY\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recNR1RB5OL8xuWKi"
  ],
  "storytellerNames": [
    "ZERO"
  ],
  "mediaIds": [
    "recTdCH7LiVEZXldB"
  ],
  "themeIds": [
    "recShwwtjyRH0R60t",
    "recqjmxKa02nCvQnf",
    "recOv0emowPzYwOMw",
    "reco9HvqJ8ON72KrW"
  ],
  "themeNames": [],
  "location": "Hobart",
  "shifts": [
    "recndj288JQOS3Zv3"
  ],
  "featured": true
}