{
  "id": "reccSr3Dx6GMHmIG7",
  "title": "Life on Palm Island: A Timeless Adventure",
  "content": "🌴✨ Immerse yourself in the timeless adventure of life on Palm Island! From cherished memories of camping, fishing, and hunting to the wisdom of our beloved Elders, this is a story of community, respect, and inspiration for future generations. ❤️ #PalmIsland #TimelessAdventure #CommunityStories\n\n",
  "transcript": "\\# Life on Palm Island: A Timeless Adventure\n\n\\~~Workers training. So some of us at 30 s we did our mental health training here. Now we're doing counselor training now. But yeah,\\~~\n\n\\~~life on \\~~[00:00:00] Palm Island is always, never get bored. There's people go camping and fishing, hunting. Like we did in our time growing up, going back 30, 40 years ago, 50 years ago. So not much. Older people now and our Elders, but our love and respect go to our Elders, our people, no past, present, future.\n\nAnd get young people to encourage 'em more, to get up there and they can do whatever they can put their mind to it.\n\nIs a beautiful home. This is a island home. Got so many memories of Palm and [00:01:00] now that. The older one, young one's passing on. So got Sister Iris down here that, yeah, she helps a lot with us. She's one of the Elder the senior workers here, and she give us a lot of support and lot encouragement and give us wise words.\n\n",
  "excerpt": "🌴✨ Immerse yourself in the timeless adventure of life on Palm Island! From cherished memories of camping, fishing, and hunting to the wisdom of our beloved Elders, this is a story of community, respe...",
  "videoUrl": "https://share.descript.com/view/yP3pzzo4JLU",
  "hasVideo": true,
  "image": null,
  "hasImage": false,
  "storytellerIds": [
    "rechgcd9qhgB1DIdW"
  ],
  "storytellerNames": [],
  "mediaIds": [
    "recp5ZWJXhXUk1zKG"
  ],
  "themeIds": [
    "recEyNIpdUe1rRdoK",
    "recgh0gHJsNG6I76E",
    "recZ2CEUo8FRvUQwn",
    "recRiQkjv4YXjk2Be"
  ],
  "location": "Unknown",
  "createdAt": "2025-05-23T00:03:50.000Z",
  "featured": false
}