{
  "id": "recDInWOmILrUQnEV",
  "title": "The Power of Community: Finding Equality at the Table",
  "storyCopy": "\"Once you sit around the table, you find community and everyone's the same.\"\n\nOur partner shared this powerful reflection on dignity – something that's central to Orange Sky's mission. When someone doesn't have access to clean clothes, it impacts everything from their mental health to job opportunities.\nThat's why our service goes beyond just washing machines. It's about creating that \"great equalizer\" where everyone has a place at the table, feeling fresh, clean and valued.\n#DignityMatters #CleanClothesMatter #EveryoneDeservesRespect\n",
  "storyTranscript": "The Power of Community: Finding Equality at the Table\n===\n\nSpeaker 9: ~And so particularly the community meal night, there's nothing better than someone finding their place at the table with cutlery on one side and salt and pepper and flowers. It's a really beautiful thing. It's that great equalizer. ~[00:00:00] Once you sit around the table, you find community and everyone's the same.\n\nSpeaker 8: That's amazing. What's this soaring sky community thing? What, like how does that match together and does it match together? Yeah, \n\nSpeaker 9: so part of that table, it's all that dignity. And so a big thing of what we want to do is dignity. And so something like orange sky is a great service for some of our folks who, that is not a lived experience for them. They're not able to access clean clothes, and when you don't have clean clothes, you don't feel very good. You get really stinky. We've got some people who need to be applying for jobs as well. So when you don't have good clothes, you feel stinky, you feel pretty rubbish about yourself.\n\nSo Orange Sky's a great service and it means that people can access fresh, clean clothes and it just, it has amazing boost to their mental health and general wellbeing. \n\nSpeaker 8: ~Something about this place, philosophy, values, safety. What it's what do you think that provides A safe place where people feel like that's, they want to all do that.~\n\n~Yep.~\n\n",
  "excerpt": "\"Once you sit around the table, you find community and everyone's the same.\" Our partner shared this powerful reflection on dignity – something that's central to Orange Sky's mission. When someone doe...",
  "videoStoryLink": "https://share.descript.com/view/YJk4EKp82ip",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/YJk4EKp82ip\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recIp8lQPrmjqauII"
  ],
  "storytellerNames": [
    "Drew Nicholls "
  ],
  "mediaIds": [
    "recMBKQezYIf0sBVw"
  ],
  "themeIds": [
    "recB0Cj60j2dBZD7f",
    "recKDoa07XZA9aV8r",
    "recnWHj4uWuKKgXbQ",
    "recNUGvk4YFSj3wIJ"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "recMnBRiSmrELgnVe"
  ],
  "featured": true
}