{
  "id": "recepr1rxw702zdsz",
  "title": "The Essential Need for Acceptance",
  "storyCopy": "",
  "storyTranscript": "\\# The Essential Need for Acceptance\n\n\\~~And so like we just get each other and we've both got autism and a DH. Both dealt with try and we just gel. We just, we just get each other. \\~~[00:00:00] So anyway, I put this post up because where, wherever we're living, like whether it's a landlord or whether we're in a share house, whoever we're living with or living in their house, they must be able to accept like the situation.\n\nBecause if that isn't the case, it becomes unsafe for us. And I don't worry so much about me because I'm. Very tough. Okay, let's go with that. And I can protect myself, but he is very naive. And if he was to grow up like where I did, I don't know if he would've survived, to be honest. And I just wanna protect him.\n\nEven though typically it's, the masculine role to be the protector, I still see myself that way. All these people on this post, they just responded. Didn't give a shit about, helping people that were like escaping DV from ex-partners. They didn't care about that.\n\nAnd all they cared about was the fact that we were trans. They just gave us the hardest of times and said all these horrible [00:01:00] things just because we're trans dude and we're not harming anyone. Like we're two trans people that are together. \\~~Like we're not a trans person. That's with someone who's born cisgendered, meaning, they were born, the gender they identify with, and it actually relates back to a Greek term that means the same side as meaning. Okay, so you identify the way that you were born. You know what I mean?\\~~\n\n",
  "excerpt": "\\# The Essential Need for Acceptance \\~~And so like we just get each other and we've both got autism and a DH. Both dealt with try and we just gel. We just, we just get each other. \\~~[00:00:00] So an...",
  "videoStoryLink": "https://share.descript.com/view/oXTleTXYCxY",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/oXTleTXYCxY\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recwG73tL99YNujEV"
  ],
  "storytellerNames": [
    "Felicity Davis-Smith"
  ],
  "mediaIds": [
    "recKjCdnJLAblC41l"
  ],
  "themeIds": [
    "recuhho7gHTDCX4j6",
    "recut99FNBQhi0q7z",
    "recNl0Ii61ic8bnuP",
    "recxRMouzJDEvQ9WY"
  ],
  "themeNames": [],
  "location": "Hobart",
  "shifts": [
    "recndj288JQOS3Zv3"
  ],
  "featured": true
}