{
  "id": "recflDdZnZu4D6CWg",
  "title": "Beyond Laundry: The Power of Listening and Community Support",
  "storyCopy": "What began as a “mobile washing machine” turned into a roaming listening lounge. Friends queue for clean shirts—but stay for conversation that mends much deeper threads. “There’s more to life than just doing what you do.” Sometimes the spin cycle is just an excuse to talk.\n\n\n\n\n\n\n",
  "storyTranscript": "Beyond Laundry: The Power of Listening and Community Support\n===\n\nBriget Perry: ~I've done the Sudsy challenge a few times. I like having those conversations and telling people this, there's more to life than just doing what you do. ~[00:00:00] It's about giving back to your community.\n\nIn the beginning it was really cool to be like, oh, a mobile laundry service.\n\nBut then to have seen things evolve over time and then to say it's not just about laundry. It's about letting people. Be heard, and people who are homeless often go all day without talking to anyone. So to have a place for people to come and talk to people, that's huge. That's a huge connection point that people are missing.\n\n~And to make that realization in the process of, oh, we're doing something great by washing people's clothes. Oh, but also there's an added benefit to it that might even be more important.~\n\n",
  "excerpt": "What began as a “mobile washing machine” turned into a roaming listening lounge. Friends queue for clean shirts—but stay for conversation that mends much deeper threads. “There’s more to life than jus...",
  "videoStoryLink": "https://share.descript.com/view/IB4aXUaQygc",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/IB4aXUaQygc\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "reczc8EPrsTTXYhNq"
  ],
  "storytellerNames": [
    "Brigit Perry"
  ],
  "mediaIds": [
    "reco40dNEVd0B0GyE"
  ],
  "themeIds": [
    "recHieZerfPg8iqWD",
    "reccpniUkftUThinE",
    "recGbLuqeuLHuPFyN",
    "recgokWjjlc2lVsvU"
  ],
  "themeNames": [],
  "location": "Canberra",
  "shifts": [
    "rec7aoqOpJ7eomAfm"
  ],
  "featured": true
}