{
  "id": "recHDNVOx53dumsgK",
  "title": "Living Rough to Travel: A Surprising Tale",
  "storyCopy": "",
  "storyTranscript": "\\# Living Rough to Travel: A Surprising Tale\n\n\\~~I'm thinking, oh, what sort of people gonna be here? But there's a lovely experience. You've got the regulars, so then you've got some obviously homeless people or people traveling around Australia, whatever.\\~~[00:00:00] \n\nI have been surprised that there are people that are literally a holidaying and just i'm living rough for a few weeks so I can get to wherever use the service and that's brilliant. I didn't even know this service existed myself beforehand.\n\nI actually. See it's, I do appreciate the washing and especially the drying, but it's the actual, the way the ladies and I've mainly had ladies, we've got she got to, but they just treat you with so well, like you are like bonus friends.\n\nAnd it's just that comradery with some of the workers or volunteers and the the regular people. It's just, I'm really surprised by that. So That's wonderful. \\~~That's good. What, how would you 'cause people struggle, I think to understand what homelessness is, what struggling is, what disadvantage is.\\~~\n\n\\~~Yeah. How do you represent yourself?\\~~\n\n",
  "excerpt": "\\# Living Rough to Travel: A Surprising Tale \\~~I'm thinking, oh, what sort of people gonna be here? But there's a lovely experience. You've got the regulars, so then you've got some obviously homeles...",
  "videoStoryLink": "https://share.descript.com/view/faPxJynRA1g",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/faPxJynRA1g\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "rece36Yk191YwcIuL"
  ],
  "storytellerNames": [
    "Julie Jauncey"
  ],
  "mediaIds": [
    "recqlUj4jmiBwyeyq"
  ],
  "themeIds": [
    "recvp4CQ7rL8b9zBr",
    "recUuTlmoh55FXsJq",
    "recXGZRuZ58tYjDv6",
    "recBSDaQsPcLnaSoz"
  ],
  "themeNames": [],
  "location": "Adelaide",
  "shifts": [
    "recD94IKMO1jm0cfS"
  ],
  "featured": true
}