{
  "id": "rechNQTqo6mMYvxcn",
  "title": "The Heart of Volunteering: It's More Than Just a Job",
  "storyCopy": "",
  "storyTranscript": "\\# The Heart of Volunteering: It's More Than Just a Job\n\n\\~~And what about the volunteers? Like that idea of having someone to talk to that is not paid and a volunteer and is doing this with their own time?\\~~[00:00:00] \n\nYou can always tell when someone's a volunteer because they're there, not because they're being paid, they're there 'cause they wanna be there, right? So they're not just, oh, hate me, job buddy, wash me clothes. They're up for a chat, they're down to earth. They've seen people in our positions, they know what it's like.\n\nYeah, it's good just to have someone to talk to, mate, because, like even though I live in a house full of blokes, it's different here. Like just different conversations sometimes, yeah, just a friendly space, a smile, and I got the the the tart as well was a bonus today, the little cream cake.\n\nThat was nice as well. Yeah. Nah. Excellent mate\\~~ . yeah. Is is there anything else we didn't talk about that you'd be keen to say or anything else that you've always wanted to say about just anyone that can support this fo this this venture or however it's supported, funded wherever I'd encourage people to help out wherever they can towards the service.\\~~\n\n",
  "excerpt": "\\# The Heart of Volunteering: It's More Than Just a Job \\~~And what about the volunteers? Like that idea of having someone to talk to that is not paid and a volunteer and is doing this with their own ...",
  "videoStoryLink": "https://share.descript.com/view/1KmWfQoQJj0",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/1KmWfQoQJj0\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recTPZNYgDMg1UhAB"
  ],
  "storytellerNames": [
    "Aaron Stapleton"
  ],
  "mediaIds": [
    "recIiJgKjETkTZZgn"
  ],
  "themeIds": [
    "recavI8ku48dJrTQC",
    "rec0WS7FfgbeSXYTk",
    "recoW6CNXfl9lZVsF",
    "recm1qAwzZBewi39Z"
  ],
  "themeNames": [],
  "location": "Adelaide",
  "shifts": [
    "recu3DWqzUEO1Xty4"
  ],
  "featured": true
}