{
  "id": "recjy3UzIQrIcy3an",
  "title": "Humanising Help: Every Person Has a Story",
  "storyCopy": "Monday nights, Briget swaps mum‑mode for an orange tee and a van full of fresh suds. She isn’t just washing clothes—she’s teaching her kids that dignity can start with a hello. “This person has a name, and this person has a story.” One load, one chat, and a neighbour feels seen.\n\n",
  "storyTranscript": "Humanising Help: Every Person Has a Story\n===\n\nBriget Perry: ~And I also for a while, worked with kids in out-of-home care and one of my housemates she worked for.~\n\n~A women's shelter and it's just like a, an awareness that there are people in your community that need help.~[00:00:00] \n\nOrange sky has done such a good job of taking that stigma out of it and saying, this is a person and this person has a name, and this person has a story. And it's not just about out doing something, doing a service. It's also like talking to that person, making them feel like human and like they're someone worth talking to.\n\nI have a lot of conversations with my kids about it. I have two kids. One is 10 and one is seven. And they know that I come on shift on Monday nights. I have to get out of the house on time. I wear my. Uniform. And when I get home they wanna know how did it go? Did you meet anyone new? Did you do a lot of laundry? Those kinds of things. And it's really nice to be able to share with them why I do it and why it's important to take care of people, [00:01:00] even if they're people that you don't know.\n\n~It's no secret. I tell everyone that I volunteer and, i've made it known to a lot of people. I've done the Sudsy challenge a few times.~\n\n",
  "excerpt": "Monday nights, Briget swaps mum‑mode for an orange tee and a van full of fresh suds. She isn’t just washing clothes—she’s teaching her kids that dignity can start with a hello. “This person has a name...",
  "videoStoryLink": "https://share.descript.com/view/7Eh6dEnIvKS",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/7Eh6dEnIvKS\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "reczc8EPrsTTXYhNq"
  ],
  "storytellerNames": [
    "Brigit Perry"
  ],
  "mediaIds": [
    "reco40dNEVd0B0GyE"
  ],
  "themeIds": [
    "recHieZerfPg8iqWD",
    "reccpniUkftUThinE",
    "recGbLuqeuLHuPFyN",
    "recgokWjjlc2lVsvU"
  ],
  "themeNames": [],
  "location": "Canberra",
  "shifts": [
    "rec7aoqOpJ7eomAfm"
  ],
  "featured": true
}