{
  "id": "recKkLMb6xh5D0GBM",
  "title": "The Power of Knowing Your Neighbor 🏡",
  "storyCopy": "\"When you know your neighbor, when you know their friend, you take care of them... When you combine stories, people together and food, there's this beautiful fermentation of community care.\"\n\nCommunity care starts with simply knowing each other's stories. That's why conversation is at the heart of everything we do at Orange Sky.\nEvery laundry shift creates opportunities for connections that ripple outward, strengthening the fabric of our communities. When we truly see each other, amazing things happen!\n#CommunityStrength #StoriesMatter #OrangeSkyConnection\n",
  "storyTranscript": "The Power of Knowing Your Neighbor 🏡\n===\n\nSpeaker 9: ~Not many people go through it. It comes from a real sense for me around the local community and care for community. ~[00:00:00] When you know your neighbor, when you know their friend, you take care of them. And so I think a similar thing is translated here. We're in a smaller community, but people really care for one another.\n\nAnd when you get to see the lived experiences, you hear the stories for some of our folks, they hear similar stories from one another. And I think when you combine stories, people together and food, there's this beautiful fermentation of community care and it can be people at their best, \n\n~So stories are really powerful.~\n\n~Stories are a reminder of past, they're a reminder of emotion and feeling and experience.~\n\n",
  "excerpt": "\"When you know your neighbor, when you know their friend, you take care of them... When you combine stories, people together and food, there's this beautiful fermentation of community care.\" Community...",
  "videoStoryLink": "https://share.descript.com/view/FJZqnFWOM8U",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/FJZqnFWOM8U\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recIp8lQPrmjqauII"
  ],
  "storytellerNames": [
    "Drew Nicholls "
  ],
  "mediaIds": [
    "recMBKQezYIf0sBVw"
  ],
  "themeIds": [
    "recB0Cj60j2dBZD7f",
    "recKDoa07XZA9aV8r",
    "recnWHj4uWuKKgXbQ",
    "recNUGvk4YFSj3wIJ"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "recMnBRiSmrELgnVe"
  ],
  "featured": true
}