{
  "id": "recK2ZAASgc77hcoa",
  "title": "Our Story",
  "content": "\"Tell me your story, and I'll tell you my story, and then we'll try and figure out how my story and your story can become our story.\"\nThis powerful insight comes from Richard as he reflects on the daily experience of navigating between two worlds - traditional culture and dominant society.\nRichard explains that understanding begins with knowing your own story first, then creating space to share and connect with others. Rather than focusing on differences, story becomes the universal language that brings people together.\nThis approach offers a thoughtful pathway for meaningful engagement across cultures - not as \"first people\" or \"second people,\" but simply as human beings with stories to share.\nWatch the full video to explore how storytelling can bridge cultural divides. #StoriesConnect #CulturalUnderstanding #SharedNarratives\n",
  "transcript": "\\# Richard-our-story\n\n[00:00:00] You can't do something or give advice to someone unless you walk the walk . So I had to join those two stories together and then work out what my story was going to be. I navigate those two worlds intuitively inside almost all day, every day.\n\n\\*\\*Speaker 4:\\*\\* I've got this dominent culture and this cultural side and one informs each other. What the amazing thing is, though, is that I can take that model and translate and use it as a vehicle to engage not only first people, because I say to my cousin brothers or who I talk to or my colleagues or the workers under me, we've got to navigate these two worlds.\n\nBut for you to understand these two worlds, you've got to know your own world. So it is about knowing your story [00:01:00] first . The second thing, then, is that when we engage in that space, with the two worlds and the other world with the other understanding, there are people who are wanting to come into this space, and would love to be able to engage with me or my people. And I say to folks tell me your story, and I'll tell you my story, and then we'll try and figure out how my story and your story can become our story. The principle doesn't change, it's the practice, and so that's the interesting space.\n\nIt's an easier vehicle to be able to engage with conversation as human beings rather than as first people, second people, or whatever construct you want to use. Story is a good vehicle to be able to work on because everyone understands that story. That concept of story. \n\n​[00:02:00] \n\n",
  "excerpt": "\"Tell me your story, and I'll tell you my story, and then we'll try and figure out how my story and your story can become our story.\"\nThis powerful insight comes from Richard as he reflects on the dai...",
  "videoUrl": "https://share.descript.com/view/uBUrFk7NOOE",
  "hasVideo": true,
  "image": null,
  "hasImage": false,
  "storytellerIds": [
    "recWNgEdfNkzHmOCQ"
  ],
  "storytellerNames": [],
  "mediaIds": [
    "recVbQPyHOJb095Pw"
  ],
  "themeIds": [
    "recrN6GTbLm37wyqN",
    "recftYAlOGURqJRpd",
    "recaGkKFAOhRbOYnU",
    "recoljs4nv6spS4kw"
  ],
  "location": "Unknown",
  "createdAt": "2025-05-21T22:19:54.000Z",
  "featured": false
}