{
  "id": "recMKAGHH22H4iC9O",
  "title": "Making Friends While Doing Laundry",
  "storyCopy": "\"The attitude is we're sitting together. There's no one putting their hand down. We're sitting together. And that's very powerful.\"\n\nThis reflection from one of our volunteers captures the heart of Orange Sky. We're not here to \"help\" in a way that creates division – we're here to sit together as equals and share in each other's humanity.\nOur six orange chairs are more than just a place to wait while clothes wash – they're where fellowship happens, where friends are made, and where community is built.\n#SittingTogether #OrangeChairs #PositivelyConnecting\n",
  "storyTranscript": "Making Friends While Doing Laundry\n===\n\nSpeaker 2: ~Somebody who's gonna talk to them, ~[00:00:00] Somebody who's not gonna make them feel like they're, they're their duty, but hey we're here. We're doing laundry, we're talking, we're making friends.\n\nFellowship is a strong word that we like to use. So having fellowship and not just a duty. I think also I struggled that a lot for a long time, is. Serving as I am here and you are there and I'm putting my hand down to help you. It doesn't feel so good. It is not, it doesn't build the other person.\n\nAnd what I get from, the gentleman and the woman that I meet here is, that's not the attitude. The attitude is we're sitting together. There's no one is putting their hand down. We're sitting together. And that's very powerful. \n\nSpeaker: That's awesome. That's good. That's a really content.\n\n~What's this idea of story for you? The reason I'm doing this is that we're gonna have lots of different people's telling their story. Yeah.~\n\n",
  "excerpt": "\"The attitude is we're sitting together. There's no one putting their hand down. We're sitting together. And that's very powerful.\" This reflection from one of our volunteers captures the heart of Ora...",
  "videoStoryLink": "https://share.descript.com/view/YP2YzYWGgzO",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/YP2YzYWGgzO\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recVajRcaR2N5aGJN"
  ],
  "storytellerNames": [
    "Chris Mourad"
  ],
  "mediaIds": [
    "recvHjH52Y3nQo9HW"
  ],
  "themeIds": [
    "recA7KrEd6ZZ6NwXT",
    "rec8pynVha5ZPl4aY",
    "recM51tZEZyIjk7VK",
    "recnjSBY1R0JxKIho"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "rechTpnJ3jSEKsyh3"
  ],
  "featured": true
}