{
  "id": "recMQ87ZDucibef1F",
  "title": "Community Kindness: A Helping Hand with a Smile",
  "storyCopy": "\"These gorgeous ladies and gents, they'll take anything. And not only that, they'll dry it and they'll fold it for you all with a smile.\"\n\nWe love hearing how our service makes a difference! As this friend shared, sometimes getting behind on laundry happens to anyone – and having a helping hand (plus a friendly smile) can make all the difference.\nOur volunteers don't just wash clothes; they create moments of dignity and connection that ripple through communities.\n#SmallActsBigImpact #KindnessMatters #OrangeSkyVolunteers\n",
  "storyTranscript": "Community Kindness: A Helping Hand with a Smile\n===\n\nSpeaker 6: ~And what do you think about Orange Guy? ~\n\nSpeaker 5: ~Oh, ~[00:00:00] I appreciate it because there's been times when I've got behind with the washing and I've only got a small washing machine. And these gorgeous ladies and Jens, they'll take anything.\n\nAnd not only that, they'll dry it and they'll fold it for you all with a smile. \n\nSpeaker 6: Wow. And what about like the, just the people too? What do you think about the people and the service? \n\nSpeaker 5: The people are good. They're good, they're friendly. I'm not very good on names, but you know, I just say, hi, darl, how you going?\n\nHi sweetie. Or, or whatever. And sometimes people give you a kiss and a hug. Sometimes people are upset and they need to talk to someone. I'm not saying I understand everything or that I can help everyone, but it's nice to just have a little talk. ~Mm And, and some people, not for me to say, they come down and you can tell they've had the same t-shirt on for a month.~\n\n~Mm. Not my business.~\n\n",
  "excerpt": "\"These gorgeous ladies and gents, they'll take anything. And not only that, they'll dry it and they'll fold it for you all with a smile.\" We love hearing how our service makes a difference! As this fr...",
  "videoStoryLink": "https://share.descript.com/view/47YVpVof6nN",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/47YVpVof6nN\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recov7pUSzHbRRwbZ"
  ],
  "storytellerNames": [
    "Sharna Wentworth"
  ],
  "mediaIds": [
    "recHthLuFAAtNyhHe"
  ],
  "themeIds": [
    "recFnWU924ItQpETi",
    "recAzZ7hse0O8DVp9",
    "rec8STQf125WyZJuf",
    "recGuUx1jyAhdnDmK"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "recMnBRiSmrELgnVe"
  ],
  "featured": true
}