{
  "id": "recm7uI6MjzIi8MkM",
  "title": "Just Two Disasters Away",
  "storyCopy": "",
  "storyTranscript": "\\# Just Two Disasters Away\n\n\\~~So you learn and then you just interact with the people who bring their washing in for all sorts of reasons.\\~~\n\n\\~~You hear some of their stories, which is really lovely to hear some, it's very sad at times. And \\~~[00:00:00] For many people, they're just two disasters away from needing this service or needing a roof over their head. And, yeah. So that's the sad part of it, but providing some service, providing some help, it's always appreciated.\n\nI thought in the beginning, and I can't remember it happening, but I remember just getting like a birthday. It can, like happy birthday from the whole Orange Sky, which was really nice.\n\nSo I don't know if it happened, whether it's as, it's got bigger, it's been quite so much, but I really thought that's just looking after your volunteers and I like that. 'cause again, in schools we rely on volunteers. So I know the importance of, you still gotta appreciate what time people are putting in.\n\n\\~~So Yeah, and I think the organizations. Really good at trying to do that. 'cause you've got a whole range of different people and personalities.\\~~\n\n",
  "excerpt": "\\# Just Two Disasters Away \\~~So you learn and then you just interact with the people who bring their washing in for all sorts of reasons.\\~~ \\~~You hear some of their stories, which is really lovely ...",
  "videoStoryLink": "https://share.descript.com/view/RnBVF1WQKRx",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/RnBVF1WQKRx\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recCKm8Cdz6VClNlu",
    "recCZMoS9f1h0h8dU"
  ],
  "storytellerNames": [
    " Jared Keating. ",
    " Tracy McIntyre"
  ],
  "mediaIds": [
    "recUsYUyZ9L9sa3Rk",
    "recGCKWPQSt1asTyP"
  ],
  "themeIds": [
    "recBWXgpvATjbuFeM",
    "recSkZ9LoQ9VgE232",
    "recLXgljuvwE3o3oT",
    "recEu6oMyHxJTJ3jW"
  ],
  "themeNames": [],
  "location": "Adelaide",
  "shifts": [
    "rec2VqYMVIm456rcB",
    "rec2VqYMVIm456rcB"
  ],
  "featured": true
}