{
  "id": "recmKVvKSQZ9PEKk0",
  "title": "Living with Just the Clothes on Their Back",
  "storyCopy": "",
  "storyTranscript": "\\# Living with Just the Clothes on Their Back\n\n\\~~Sort of behaviors, and I know \\~~[00:00:00] one shift I had a gentleman come up and say, oh, is the van still washing? And I said, yeah. He said alright. I said do you wanna go and get your washing? And he proceeded to strip off everything except his jocks. And that was something I haven't seen here. But it just goes to show that some people are basically living with the clothes on their back.\n\nIt's great that we can help them to do, to be able to, wash it for them. And I think it helps concretize other people who I talk to about. The difficulties and challenges of, people who are doing it tough at this time, and I think that helps to raise the awareness of the inequity in our society and hopefully help address that.\n\n\\~~I think it's been increasing. I've been in Adelaide, this is my 10th year, and more people who are. Doing it tough and and a lot more people who would be homeless on the streets.\\~~\n\n",
  "excerpt": "\\# Living with Just the Clothes on Their Back \\~~Sort of behaviors, and I know \\~~[00:00:00] one shift I had a gentleman come up and say, oh, is the van still washing? And I said, yeah. He said alrigh...",
  "videoStoryLink": "https://share.descript.com/view/M9Oyh7qnpoe",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/M9Oyh7qnpoe\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recCKm8Cdz6VClNlu",
    "recCZMoS9f1h0h8dU"
  ],
  "storytellerNames": [
    " Jared Keating. ",
    " Tracy McIntyre"
  ],
  "mediaIds": [
    "recUsYUyZ9L9sa3Rk",
    "recGCKWPQSt1asTyP"
  ],
  "themeIds": [
    "recBWXgpvATjbuFeM",
    "recSkZ9LoQ9VgE232",
    "recLXgljuvwE3o3oT",
    "recEu6oMyHxJTJ3jW"
  ],
  "themeNames": [],
  "location": "Adelaide",
  "shifts": [
    "rec2VqYMVIm456rcB",
    "rec2VqYMVIm456rcB"
  ],
  "featured": true
}