{
  "id": "recpT9AZYph9ZXGyn",
  "title": "The Foundation of a Healthy Home 🏡✨",
  "content": "\"Healthy homes are the start of everything. You need a place to call home where the wind can flow, you're free from mites, with a kitchen to cook in, protection from extreme weather, and affordable power. The people of Tennant Creek just want to look after their families and community.\"\n",
  "transcript": "\\# The Foundation of a Healthy Home 🏡✨\n\n\\*\\*Speaker 3:\\*\\* \\~~Hello Puppy. Hello puppies. I yeah, so I guess for me, I'm just needing time to digest what we've just. Seen and heard and felt, and certainly I think that \\~~[00:00:00] Healthy homes is the start of everything because you need to have a home that you can call home and that you're happy with, and the wind can flow in and out and you can have your family there and you're free from mites in your in your home and in your walls and in your bed.\n\n\\*\\*Speaker 3:\\*\\* And you can have a kitchen that you can cook in and have a roof over your head and a home that's not too hot in the summer and not too freezing in the winter when it doesn't need to be. And also one that's not costing a bomb. And in fact you don't even know that it's costing and then all of a sudden you have no power.\n\n\\*\\*Speaker 3:\\*\\* So for me, we've seen lots of homes, that felt a bit uncomfortable. Didn't feel that it was the home that you'd wanna call home. There's lots that I've learned, but I've also learned that, the people in the culture here are really great people and they want just look after their family and look after their community [00:01:00] and spending time with Patricia and LT and Dianne, and then meeting at the cultural center, which is really amazing. Mr. Jones and Jimmy and just hearing about the journey that people from Tenant Creek have been on to where they are now that's first. And then I bring that role of being a CEO and that's a blessing that I feel that I've got some influence to make some change.\n\n\\*\\*Speaker 3:\\*\\* And, for us at The Snow Foundation, it is about listening to communities and empowering communities. That's a big part. And it's also about backing really great people. \\~~So we've been lucky to be joined by the team from the goods project who are doing these beds. Really simple beds that are really lightweight crates.\\~~\n\n",
  "excerpt": "\"Healthy homes are the start of everything. You need a place to call home where the wind can flow, you're free from mites, with a kitchen to cook in, protection from extreme weather, and affordable po...",
  "videoUrl": "https://share.descript.com/view/bCbC9zXYSLU",
  "hasVideo": true,
  "image": {
    "url": "https://v5.airtableusercontent.com/v3/u/42/42/1750579200000/qjXZYZbGXfXmWSnGZRmcQQ/jmOFpa5yxCDvhZENzFW51RmnmEcHztR9zi7ufcmNTp9Y5LXPLWL7HY6HmXGF6G6Ri0zRr1Dk4feFjAgeTuC49BJOQkUSy7VBk4vdZtMxjwUIq3z1lp0fHVtdKOu1Gz2p_CgF0Bxdy3c4aNt1wFgGPsLyulNkHt6ZoXOuj2lklCU/bCXk7QPWtZa2wY70Z_dkMcJFjFRmaOPPbyJJw5gzhMY",
    "thumbnails": {
      "small": {
        "url": "https://v5.airtableusercontent.com/v3/u/42/42/1750579200000/22-l4TSfzKPF01zOn-yH8A/jtlNycEN5khXmxk8ZWFxSEZM6P19XOGqpAAhb7anS047qGYQNuXZ13HODGUzqS7VcithraDSSDsX8xISVZRp3rFSHfLFvXKcEJtRDkGgf8YS0RAhifQ_M1z2QT75EfH62r3n8W8_fjG0KcW6NJLBKQ/iBFfkKBBB2oJwwTVuWoT7eRp2NezzlJu5a5OCnQgS-w",
        "width": 54,
        "height": 36
      },
      "large": {
        "url": "https://v5.airtableusercontent.com/v3/u/42/42/1750579200000/S2AZe_sS-rbiNK-LC8qZ3w/ZULH2y7hUfdj-Z9uXKxsT38qFZFvH6PoUMK-sQ7b3_Ix4siuF5nZ140Az87Gn8nd6hyKVCDzf4Ppeq2I4XGMFA1mCc-IqQGYKUiPKh2v4Z_rdPYJds-sMzPXxX71Vc3HDluNCjBKI1GwX2GH9WfCpQ/k3zZMamd1TC93FuswM6vCJ-SOQ7Q-bkZPdKO752k4Ks",
        "width": 768,
        "height": 512
      },
      "full": {
        "url": "https://v5.airtableusercontent.com/v3/u/42/42/1750579200000/Seo-9LjdNLQPVoyLozCK8g/5tHoERnIvArnOCKSO4BKmNq_6F62e-e5CcmqKx4N-HL7DRjfx-AVXwlinfBnCuIP_3NEjB_FbxMGsIizOmhJRvGzjTo5JjBUKQXL8hegHjxOJSkrlUJrjuzOxoddwMBGTMP1c48I9h09-jwyNjwPJA/V6LR1A2CvxqsEsj-OiN-x2j_1aR5Tz1pX7g92HsKEPQ",
        "width": 2000,
        "height": 1333
      }
    },
    "filename": "IMG_2919.jpg",
    "size": 366801,
    "type": "image/jpeg"
  },
  "hasImage": true,
  "storytellerIds": [
    "recaeLdRAl45tSzUF"
  ],
  "storytellerNames": [],
  "mediaIds": [
    "recPHgc2LoM3v72W2"
  ],
  "themeIds": [
    "recPRPZ8spyagLki0",
    "recLMStwCnGGbErv0",
    "rec61b005wUuI9791",
    "recywfsG0DRh9a46N"
  ],
  "location": "Unknown",
  "createdAt": "2025-05-20T00:23:21.000Z",
  "featured": false
}