{
  "id": "recpJmxRzRqgWoqD2",
  "title": "The Power of Listening: Building Genuine Connections",
  "storyCopy": "\"Humans connect through, I think more than anything, listening, being present in a conversation. More so listening than talking... Looking eye to eye, smiling, reacting.\"\n\nThis volunteer perfectly captured what makes the Orange Sky experience so special. We might provide laundry and shower services, but it's the genuine, non-judgmental conversation that creates the magic.\nEvery week, our volunteers don't just wash clothes – they listen. They hear stories from walks of life they might never experience themselves, creating a tapestry of human connection across our communities.\n#PowerOfListening #GenuineConversation #OrangeSkyMoments\n",
  "storyTranscript": "The Power of Listening: Building Genuine Connections\n===\n\nSpeaker: ~That's awesome. What's how would you define this idea of connection with people? How do humans connect and why is that important?~\n\nSpeaker 2: ~That's a great question. ~[00:00:00] Humans connect through, I think more than anything, listening, being present in a conversation. More so listening than talking. I know I say I love talking but really listening is a lot more powerful in my experience. Listen to somebody looking eye to eye smiling, reacting, being surprised, being shattered.\n\nIt builds our fabric together as humanity to be connected. Get to live an experience with somebody who lived in rural Australia here for maybe 20 years. Somebody who live worked in a coal mine, someone who worked as a race a bike racer. Someone who worked as. A bodybuilder. People who met here that, lived lives that I've never lived before and I don't think I've ever lived them.\n\nBut through them I'm exposed to part of humanity that I would have no connection with. \n\nSpeaker: ~That's cool. What from working here, how is your concept of what this idea of experiencing homelessness is, has that changed for you?~\n\n",
  "excerpt": "\"Humans connect through, I think more than anything, listening, being present in a conversation. More so listening than talking... Looking eye to eye, smiling, reacting.\" This volunteer perfectly capt...",
  "videoStoryLink": "https://share.descript.com/view/apZQU7tvidz",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/apZQU7tvidz\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recVajRcaR2N5aGJN"
  ],
  "storytellerNames": [
    "Chris Mourad"
  ],
  "mediaIds": [
    "recvHjH52Y3nQo9HW"
  ],
  "themeIds": [
    "recA7KrEd6ZZ6NwXT",
    "rec8pynVha5ZPl4aY",
    "recM51tZEZyIjk7VK",
    "recnjSBY1R0JxKIho"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "rechTpnJ3jSEKsyh3"
  ],
  "featured": true
}