{
  "id": "recTzsFYGwIYoNnpv",
  "title": "The Hidden Impact of Everyday Conveniences",
  "storyCopy": "",
  "storyTranscript": "\\# The Hidden Impact of Everyday Conveniences\n\n\\~~Like part of it's laundry, part of its conversation, part of its people. What do you think in terms of what it actually does to people?\\~~[00:00:00] \n\nThe bigger impact is you don't realise it, it may seem like only a small thing. If you've got a washing machine and a dryer home, you don't even have to worry about these kinds of things or where you're gonna wash your clothes or, today I was up to my I actually, I had no more clean jo on socks left.\n\nIt was basically get me washing done today and without you guys, I would've been lugging it up to the bloody laundry mat. Paying an amount of money, which is literally 20, 30 bucks that someone like me in this position, I don't have that 30 bucks. Like we don't have that. So a service like this, like I said, and until you don't have it, is you don't realise how much of a convenience having a washing machine is.\n\nLike most times you throw 'em in the basket at home and they get washed, don't they like, and they're there, but. No. So for someone to actually think about this and think about that service that needs to be provided, and it's it's godsend mate, it's bloody awesome. It's bloody awesome. \\~~And even all chatting with all the blokes.\\~~\n\n\\~~Great service. Great service. We can't say thank you enough.\\~~\n\n",
  "excerpt": "\\# The Hidden Impact of Everyday Conveniences \\~~Like part of it's laundry, part of its conversation, part of its people. What do you think in terms of what it actually does to people?\\~~[00:00:00]  T...",
  "videoStoryLink": "https://share.descript.com/view/tXVbBbRXWSP",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/tXVbBbRXWSP\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recTPZNYgDMg1UhAB"
  ],
  "storytellerNames": [
    "Aaron Stapleton"
  ],
  "mediaIds": [
    "recIiJgKjETkTZZgn"
  ],
  "themeIds": [
    "recavI8ku48dJrTQC",
    "rec0WS7FfgbeSXYTk",
    "recoW6CNXfl9lZVsF",
    "recm1qAwzZBewi39Z"
  ],
  "themeNames": [],
  "location": "Adelaide",
  "shifts": [
    "recu3DWqzUEO1Xty4"
  ],
  "featured": true
}