{
  "id": "recUWGY0kjXHPqG3x",
  "title": "David loves Orange Sky",
  "storyCopy": "\"Makes a big difference. You'd be terribly lonely and stuck if you were just at home on your own and not able to get out and see these people.\"\n\nDavid hit the nail on the head about why Orange Sky exists. It's not just about clean clothes – it's about bringing people together, creating connections, and fighting the isolation that too often comes with tough times.\nOur mobile laundry service is a vehicle for something much bigger: genuine human connection. Just ask the friends who visit us at shifts across Australia and New Zealand!\n#CommunityConnection #BeyondLaundry #OrangeSkyAU\n",
  "storyTranscript": "David Highlights\n===\n\nDavid: [00:00:00] Oh, I think it's a terrific idea. Especially nowadays that things are getting tough. And you need somewhere to bring it to. If you're sleeping in your car, or anywhere, sleeping about, you need to be able to bring everything down to get washed and cleaned.\n\nwe come round these places. To meet people and talk with them and keep you associated with what's going on and around you.\n\nMakes a big difference. You'd be terribly lonely and stuck if you were just at home on your own and not able to get out and see these people. Yeah, absolutely. But it's surprising how many of them you meet in so many different places, all the same situation. Oh yeah, it's terrific. \n\n​\n\n",
  "excerpt": "\"Makes a big difference. You'd be terribly lonely and stuck if you were just at home on your own and not able to get out and see these people.\" David hit the nail on the head about why Orange Sky exis...",
  "videoStoryLink": "https://share.descript.com/view/ATRzTxx116G",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/ATRzTxx116G\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recpef5KEbRJglgGG"
  ],
  "storytellerNames": [
    "David Allen"
  ],
  "mediaIds": [
    "reca0o6mvLBetAwRN"
  ],
  "themeIds": [
    "recKrstJ18w9wVOgm",
    "recNpLT6EDMYS3Sci",
    "reciX9GnrevKAtAzW",
    "recD4ujK5lFS42k4M"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "rechTpnJ3jSEKsyh3"
  ],
  "featured": true
}