{
  "id": "recVmRL0L017j13g1",
  "title": "A Heartwarming Christmas Miracle",
  "storyCopy": "\"It's nothing for a hundred plus people to turn up at two separate settings on Christmas for a meal and a little bit of happiness, laughter, a generous present and a nice box of food.\"\n\nThe holidays can be a difficult time for our friends experiencing homelessness or hardship. That's why we love partnering with community organizations that provide warm meals and festive cheer.\nClean clothes + good food + genuine connection = a recipe for dignity and joy, at Christmas and all year round.\n#CommunitySupport #MoreThanLaundry #OrangeSkyPartners\n",
  "storyTranscript": "A Heartwarming Christmas Miracle\n===\n\nSpeaker 5: ~And as a result, a lot of them have heard about this place through word of mouth and they've just drifted across here and it's nothing as Steve is extremely generous. ~[00:00:00] And it's nothing for a hundred plus people to turn up at two separate settings on Christmas for a meal and a little bit of happiness, laughter, a generous with the present and a nice box of food to help you through the Christmas break.\n\nAnd for miles around, this is the only place where you can get a good quality meal. And they, they have soup in the wintertime as well as the meal. And you can take food away and people are grateful for that. And it's good food that you can eat. A lot of people don't have cooking devices because they're maybe sleeping in the car or something like that.\n\nThey can come here, get a nice full belly, and they'll sleep well that night. \n\nSpeaker 6: ~Yes, it's true. It's true. How do we talk about these places that other people these ~\n\nSpeaker 5: ~people are on the same level as me?~\n\n",
  "excerpt": "\"It's nothing for a hundred plus people to turn up at two separate settings on Christmas for a meal and a little bit of happiness, laughter, a generous present and a nice box of food.\" The holidays ca...",
  "videoStoryLink": "https://share.descript.com/view/g9G8ggClF0R",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/g9G8ggClF0R\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recov7pUSzHbRRwbZ"
  ],
  "storytellerNames": [
    "Sharna Wentworth"
  ],
  "mediaIds": [
    "recHthLuFAAtNyhHe"
  ],
  "themeIds": [
    "recFnWU924ItQpETi",
    "recAzZ7hse0O8DVp9",
    "rec8STQf125WyZJuf",
    "recGuUx1jyAhdnDmK"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "recMnBRiSmrELgnVe"
  ],
  "featured": true
}