{
  "id": "recwUU5lk0puPxkl9",
  "title": "Navigating Closed Doors: How COVID-19 Shut Down Essential Services",
  "storyCopy": "",
  "storyTranscript": "\\# Navigating Closed Doors: How COVID-19 Shut Down Essential Services\n\n\\~~I really appreciate it. That's cool. Casper, what are you doing? What's what's the last few years been like? The last four years have been a bit crazy.\\~~[00:00:00] \n\nIt's just been quite difficult accessing services. I've just had to work out different ways of getting things done that I had to, thankfully, because where I used to work.\n\nI knew we used to get a lot of people up and moving, so I know you've just got to keep moving and grooving and yeah, that was really fortunate. I come here on I've only really been coming here the last couple of months because I didn't know about it beforehand.\n\nI found it very helpful. They do a meal, it's like a little camaraderie with a few of the guys that seem to be fairly regular and nice. We've got different ladies that volunteer here, but they also seem to be in a roster. I've seen a few of them a couple of times, and it's just nice to know the washing is washed and dried and I've set for the week.\n\nSuch a simple thing, which for me, I can wash that. I cannot go up and downstairs or hang on my clothes line. So it's been like a massive life save. It's been very helpful. \\~~What's the connection like for you here? Like how.\\~~\n\n\\~~I am like, like I said, I've only been a few months, but everybody seems to be unusually nice.\\~~\n\n",
  "excerpt": "\\# Navigating Closed Doors: How COVID-19 Shut Down Essential Services \\~~I really appreciate it. That's cool. Casper, what are you doing? What's what's the last few years been like? The last four year...",
  "videoStoryLink": "https://share.descript.com/view/oH7ZnLxYIAL",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/oH7ZnLxYIAL\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "rece36Yk191YwcIuL"
  ],
  "storytellerNames": [
    "Julie Jauncey"
  ],
  "mediaIds": [
    "recqlUj4jmiBwyeyq"
  ],
  "themeIds": [
    "recvp4CQ7rL8b9zBr",
    "recUuTlmoh55FXsJq",
    "recXGZRuZ58tYjDv6",
    "recBSDaQsPcLnaSoz"
  ],
  "themeNames": [],
  "location": "Adelaide",
  "shifts": [
    "recD94IKMO1jm0cfS"
  ],
  "featured": true
}