{
  "id": "recXeWzBDUvlm7Kjw",
  "title": "Adapting and Thriving in a New World",
  "content": "\"We learned to speak our language at home and English at school, meeting kids from different lands. When you visit a new community, always go to the elders first – sit, talk, and they'll show you the way forward.\" – Dianne\n",
  "transcript": "\\# Adapting and Thriving in a New World\n\n\\*\\*Dianne:\\*\\* \\~~It was in that time it was a very hard time for us, but going back, still talking language to our families.\\~~\n\n\\*\\*Dianne:\\*\\* \\~~Got raised in a place where we learned to speak language and then going away to speak English. \\~~[00:00:00] It was easy. Like we are getting out of our language, speaking English, learning more sports and doing things and meeting up with different kids from different land, different areas.\n\n\\*\\*Dianne:\\*\\* Coming to one school and learning different languages at school by listening to other kids who spoke language, and it was good. Hey, it was good. Yeah. Because some of their language that I learned from, I've learned a little bit of, a little bit of other languages like listening to the other kids that were speaking language, especially the girls where we used to stay in their dormitories.\n\n\\*\\*Dianne:\\*\\* It was something different from where we've been. Just to the school where we've been in dormitory, but when we were at home, we were staying in where the eldest had a single home where they made it themself by tin shacks or [00:01:00] by a grass humpy. We used to live in that with ladies and going up to boarding school, it was like it's different to back home, but living in a house.\n\n\\*\\*Dianne:\\*\\* In a dormitory where we had ladies, young girls, we had house mother that was a lady used to be around us. \n\n\\*\\*Dianne:\\*\\* If you have an idea what place you'd go to first go and talk to if they know you're coming, go to the elders.\n\n\\*\\*Dianne:\\*\\* Sit down and talk to them or a group of people and tell them if you can show them how to make them beds, and they'll probably be keen on joining in and helping out..\\~~ Yeah. Sometimes you can go to a there's a organization where they have aboriginal people go there, have meeting with them and let 'em know, and they can take you out to show you where a good area to go to, where you can sit with some people.\\~~\n\n",
  "excerpt": "\"We learned to speak our language at home and English at school, meeting kids from different lands. When you visit a new community, always go to the elders first – sit, talk, and they'll show you the ...",
  "videoUrl": "https://share.descript.com/view/y5n0nbALmPZ",
  "hasVideo": true,
  "image": {
    "url": "https://v5.airtableusercontent.com/v3/u/42/42/1750579200000/-0Tz4TA45lY-WcCgCq4Z3w/E37ndyFcDZj8vdamfOsslAkBmkJ4VVaMsQUhc09-6yrX8_LE0xJ7lYIZFqscwUWckHaj8z8uvAA4zVBg1EQQQV-PtH3pvo5cssqGDpk-KIiDqesR4PHMFRBoekGIenRTZjEVcjZZx9yDCAapdz6p1_Yd5nhGQ-ZzeuXKJBDmI64/_8LqDg5Xx5SCTf8S64uuWWSEFX97yVmged_uhVGtPrw",
    "thumbnails": {
      "small": {
        "url": "https://v5.airtableusercontent.com/v3/u/42/42/1750579200000/k9wBQ3-wxCl0y4hDLQ9AZA/xEb-5KyL-K3dFLnmerwrsZeElG6-9QNjyvfLDKFIG4mVcpbFy8ZlCVSQ1VeiQNVbalfYveMe0XCuULg0RFPGZfiZHq3TXW-kQLPIxkFsPWkQjuIeCct8B6LPggcRTBgE9vD5D2SikFVZKTV7Ja9bcw/919XROyTl2xkBYO-WufVBFaJAWxDL5bZz5SWEf7mwlc",
        "width": 54,
        "height": 36
      },
      "large": {
        "url": "https://v5.airtableusercontent.com/v3/u/42/42/1750579200000/AY9YuwA9lpmbYGafGnbpKw/8DatvtFqHNN0fALNFMeu4d46RJrwfuZZDkLBc5aVwk3_caO5PJ4a0BEs1PMN8Jhtz2KIEdSMOOEgijONo7RX09s7T1xz2sb3ikiDoZnZmfSkq8KooF3PZXzl7aRo3iTEhmVnDAIC9duWwFpyi_lVuQ/GU5xjA64hiVSuLt8lZ52bsEcBNn3rq66-fayrMsoIA8",
        "width": 768,
        "height": 512
      },
      "full": {
        "url": "https://v5.airtableusercontent.com/v3/u/42/42/1750579200000/XVseRA1mF45mTfOQxGLlBA/M_TBJus0453FaarqB9v0e8sIdSju8kGGVZ_7qWT4TbnapyWRrVoZA8H_TOnn2zaGgwHPb-q4fO0UmfbWTpo10bnM8TnguqIlfv6M39xWwrqwvpH5DArmm0wegoqogZ0Swip_9reZNLl5bVqSuQ5f_g/Cnxc5VDyBrZ8LRhVyyGx-VZTC4_HP9Z2YryoHxTv_6Q",
        "width": 2000,
        "height": 1333
      }
    },
    "filename": "IMG_2195.jpg",
    "size": 288739,
    "type": "image/jpeg"
  },
  "hasImage": true,
  "storytellerIds": [
    "recKRfFagRCjfrs4v"
  ],
  "storytellerNames": [],
  "mediaIds": [
    "rec1hqFk1TlaF5Hlm"
  ],
  "themeIds": [
    "recuZ3NGKtRQsnJma",
    "recDMgiKFC9Je6pNc",
    "recgwulyYXN07Fxjh",
    "recejZ06T0bkHicjF"
  ],
  "location": "Unknown",
  "createdAt": "2025-05-19T21:14:36.000Z",
  "featured": false
}