{
  "id": "recYMTb7IgVqCsmGU",
  "title": "Empathy Over Judgment: Seeing the Person, Not Just the Addiction",
  "storyCopy": "Needles on the pavement used to scare Briget; now they spark questions. Partnering the laundry van with food trucks and outreach crews, she’s learned to look past the habit and meet the human. “They’re people too.” Empathy is the first step in harm‑reduction.\n\n",
  "storyTranscript": "Empathy Over Judgment: Seeing the Person, Not Just the Addiction\n===\n\nBriget Perry: ~If they notice somebody's on drugs, is there a way to feel more comfortable and not be just immediately scared and think, oh no, that's a scary drug addict. Like they're people too. ~[00:00:00] They use drugs. Yes. But they need to be seen as people just like everybody else.\n\nSo I really like there to be some sort of harm reduction awareness training for volunteers in Canberra.\n\nHaving service providers to partner with is a really smart way of doing things because it's not just we park the van and that's it. Like we park the van and we have Vinny's come, or we're at. Red Cross Roadhouse or early morning Center where they're serving food or whatever it is.\n\nIt's not just the one thing, it's we've partnered with someone else and that's the business model and it's smart. So I think always expanding and thinking of how you can expand the service that little bit farther is really smart.\n\nIt's just a matter of, trying to get HQ and the service [00:01:00] volunteer here and all of that stuff. All the pieces put in the right places. I've been trying, I've been trying to do it.\n\n~When I started, a volunteer that was on shift with me had said that somebody asked her, oh, that's great that you're volunteering your time, but like, why not just give them money?~\n\n",
  "excerpt": "Needles on the pavement used to scare Briget; now they spark questions. Partnering the laundry van with food trucks and outreach crews, she’s learned to look past the habit and meet the human. “They’r...",
  "videoStoryLink": "https://share.descript.com/view/9bD8dncOObg",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/9bD8dncOObg\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "reczc8EPrsTTXYhNq"
  ],
  "storytellerNames": [
    "Brigit Perry"
  ],
  "mediaIds": [
    "reco40dNEVd0B0GyE"
  ],
  "themeIds": [
    "recHieZerfPg8iqWD",
    "reccpniUkftUThinE",
    "recGbLuqeuLHuPFyN",
    "recgokWjjlc2lVsvU"
  ],
  "themeNames": [],
  "location": "Canberra",
  "shifts": [
    "rec7aoqOpJ7eomAfm"
  ],
  "featured": true
}