{
  "id": "reczWuNVZSmbQuN49",
  "title": "More Than Just Laundry: Compassion in Action",
  "storyCopy": "\"They're very thankful that somebody can take care of their laundry and not only take care of the laundry, but take care of them.\"\n\nAt Orange Sky, we know that clean laundry is just the beginning. What our friends really value is being seen, heard, and respected as individuals with stories that matter.\nEvery week, our volunteers across Australia and New Zealand don't just wash clothes – they create spaces where genuine conversation and friendship can flourish. That's the real impact of our service.\n#CompassionInAction #MoreThanLaundry #OrangeSkyImpact\n",
  "storyTranscript": "More Than Just Laundry: Compassion in Action\n===\n\nSpeaker 2: ~So much? So my only exposure is walking in and walking out seeing that seeing the laundry and what I know from people who should sit with me on the table.~[00:00:00] \n\nThey're very thankful that somebody can take care of their laundry and not only take care of the laundry, but take care of them. Somebody who's gonna talk to them, somebody who's not gonna make them feel like they're, they're their duty, but hey we're here. We're doing laundry, we're talking, we're making friends.\n\nFellowship is a strong word that we like to use. So having fellowship and not just a duty. I think also I struggled that a lot for a long time, is. Serving as I am here and you are there and I'm putting my hand down to help you. It doesn't feel so good. It is not, it doesn't build the other person.\n\nAnd what I get from, the gentleman and the woman that I meet here is, that's not the attitude. The attitude is we're sitting together. There's no one is putting their hand down. We're sitting together. And that's very powerful. \n\nSpeaker: ~What's this idea of story for you? The reason I'm doing this is that we're gonna have lots of different people's telling their story. Yeah.~\n\n",
  "excerpt": "\"They're very thankful that somebody can take care of their laundry and not only take care of the laundry, but take care of them.\" At Orange Sky, we know that clean laundry is just the beginning. What...",
  "videoStoryLink": "https://share.descript.com/view/PDinGJPagDQ",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/PDinGJPagDQ\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recVajRcaR2N5aGJN"
  ],
  "storytellerNames": [
    "Chris Mourad"
  ],
  "mediaIds": [
    "recvHjH52Y3nQo9HW"
  ],
  "themeIds": [
    "recA7KrEd6ZZ6NwXT",
    "rec8pynVha5ZPl4aY",
    "recM51tZEZyIjk7VK",
    "recnjSBY1R0JxKIho"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "rechTpnJ3jSEKsyh3"
  ],
  "featured": true
}