{
  "id": "recZHMbfmZvNZyLmO",
  "title": "Essential Human Rights: A Refugee's Insight",
  "storyCopy": "\"I think everybody deserves a place to sleep, access to water and electricity. As a refugee who sought asylum here... Otherwise, I'm not a human being.\"\n\nA safe place to sleep and basic amenities – these aren't luxuries, they're essential human rights. At Orange Sky, we believe in fostering environments where everyone feels valued, regardless of their circumstances.\nOur six orange chairs provide more than just a place to sit while laundry is being done; they're a symbol of dignity and connection in a world where many of our friends feel invisible.\n#PositivelyConnecting #EveryoneDeservesBasics #OrangeSkyAU\n",
  "storyTranscript": "Essential Human Rights: A Refugee's Insight\n===\n\nSpeaker 12: ~You are losing trust in everybody, especially the government. And then you tend to wanna blame and point fingers at, others. But at the end of the day, ~[00:00:00] I think everybody deserves a place to sleep, place access to, water and electricity.\n\nAnd as for me, as a refugee. Who seek for asylum in here. And I came and I got, they gave me asylum. I think these rights, I have to acknowledge that I need to make myself work harder to find another accommodation for myself. So I have a, shelter and. Electricity, water and all this.\n\n~Yeah. Otherwise, I'm not a human being, I cannot, I have to work harder to do this. Yeah. To find a house to live in. Yeah. Yeah. But yeah, it's all right.~\n",
  "excerpt": "\"I think everybody deserves a place to sleep, access to water and electricity. As a refugee who sought asylum here... Otherwise, I'm not a human being.\" A safe place to sleep and basic amenities – the...",
  "videoStoryLink": "https://share.descript.com/view/i9a0GIvxvDm",
  "videoEmbedCode": "<iframe src=\"https://share.descript.com/embed/i9a0GIvxvDm\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen></iframe>",
  "hasVideo": true,
  "storytellerIds": [
    "recSxR9ED03I7PuGg"
  ],
  "storytellerNames": [
    "Freddy Wai"
  ],
  "mediaIds": [
    "recH8gjZL3yfxIlf5"
  ],
  "themeIds": [
    "recGQB2rwpmldhZed",
    "recloBlgnFZ75Zfl7",
    "rec3gpxICZFBLDtLH",
    "rec8vJI8b206U1wXL"
  ],
  "themeNames": [],
  "location": "Melbourne",
  "shifts": [
    "recZ0LlHTsyQtlmA8"
  ],
  "featured": true
}