{
  "id": "recZNLAd3VIWHh11o",
  "title": "Uncle Allan Welcome",
  "content": "Journey to Great Palm Island (Bougamambara) with Traditional Owner Uncle Allan Palm Island as he welcomes you to his ancestral lands. Uncle Allan shares his skin name Nakawaraka and introduces us to Mulkal, the traditional language of the region.\nIn this moving welcome, Uncle Allan guides us through the surrounding islands, revealing their traditional names alongside the colonial ones, and explains the significance of the Mingina Mingina Ranges that form the natural boundary of this beautiful place.\nExperience the deep connection to Country as Uncle Allan introduces elements of cultural significance, including the traditional shield (Bukal) that represents their heritage.\nWatch the full welcome to better understand the rich cultural landscape of Palm Island. #CulturalHeritage #PalmIsland #TraditionalKnowledge\n",
  "transcript": "\\# Uncle Allan Welcome\n\n\\*\\*Speaker 3:\\*\\* [00:00:00] Good morning, everyone. My name is Alan Palm Island. We are here on Spoongeman Barra, Great Palm Island, and Daru Maru. We look around Great Palm, all the rest of the islands around the surrounding islands. And we are here today to learn about myself. My skin name is Nakawaraka, skin name. And our language name, our language is Mulkal.\n\nAnd we speak in, in, in our town that that we, we speak our language, that we call Nakarawaraka Burbanbara. You're welcome to Great Palm. But I say that Bougamambara. Bougamambara means Great Palm Island, Mambara, and Darumaru [00:01:00] means the rest of the islands or surrounding islands of palm, Great Palm.\n\nToday we just wanted to say that the islands behind me, it's Nuru, but they call it Curacao. Nuruwapri, North Palm, and Bougambarin. And across here, we got Guggenbeiren is Hofje's Island and you got across over here to Emilia, which is Fannum Island. Palm, Great Palm is, is sitting on as we got here on our emblem is, is Mingina Mingina Ranges.\n\nAnd in this, in this emblem emblem, we have a, what we call a shield. We call Bukal. Bukal means shield. And we. We, we put, I [00:02:00] put the designs on it as a two, because our boundary is, is, is come into form of a, of a big Mandaray. Our boundary, we call it Mingina Mingina Ranges, Mingina Mingina, Mingina Mingina.\n\nOur boundaries is that area of Great Palm Island. And in, in that area, it would keep, and I'm just trying to welcome you all today. Thanks for coming.\n\n",
  "excerpt": "Journey to Great Palm Island (Bougamambara) with Traditional Owner Uncle Allan Palm Island as he welcomes you to his ancestral lands. Uncle Allan shares his skin name Nakawaraka and introduces us to M...",
  "videoUrl": "https://share.descript.com/view/z2LyQi0wpQR",
  "hasVideo": true,
  "image": null,
  "hasImage": false,
  "storytellerIds": [
    "recCZ7laBXDzCfXru"
  ],
  "storytellerNames": [],
  "mediaIds": [
    "recPRb5xUmBnP1DQd"
  ],
  "themeIds": [
    "recpqxdvf8JppmPvL",
    "recQpTohqetxXXAAC",
    "recErhpyIAw25xOYj",
    "recnfoVhBXEjScbnf"
  ],
  "location": "Unknown",
  "createdAt": "2025-05-21T22:19:36.000Z",
  "featured": false
}