{
  "id": "rec1bD2SAvw2h4OlU",
  "name": "Steve Sutton",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "Steve Sutton, a retired individual with a finance background, started volunteering at Orange Sky in October. He initially found it slow, but as more people sought laundry services and support, his experiences grew. Through volunteering, Steve gained awareness of homelessness and stressed the need for affordable housing. He highlighted the importance of Orange Sky's broader community impact beyond laundry services. Steve values the interactions with people experiencing homelessness and camaraderie among volunteers, finding fulfillment in giving back. Additionally, he commended Orange Sky's innovations",
  "quotes": [
    "recbInDd31nn51HV4",
    "rec5Za8NSAhveqBa4",
    "recikvGGuBYmMrNr1",
    "recVmBO245Ieb5FMd",
    "recOguv6dfRK98BFV"
  ],
  "transcript": "Alright, just do your name and then spell it would be awesome too. Spell it? Yeah, can. Okay. So just your full name and spell it? Steve Sutton. So S-T-E-V-E and Sutton, S-U-T-T-O-N. Cool. Tell us a bit, you can check it if you want. No, no, it's fine. Tell us a bit about the Steve Sutton story. What's a little intro to who you are and who are you? Well, retired. So sort of worked in finance, business banking for about 36 years. And yeah, retired, I think it was about April 2022. My wife, she's a lawyer. My wife actually volunteers for the Shirley shuttle. So she does some running around volunteering and then said, well, what are you going to do? And I thought, well, I've been working for 36 years. I thought I'd take a little bit of a break for a while. So did that for about 12 months and then kept on saying, well, what are you going to do? And I think I looked at, saw a couple of Facebook ads for Orange Sky. I thought that looks pretty interesting. Wouldn't mind giving that a crack, see what it's like. I did. That was about October last year. What was your first impressions when you first started doing it? How did it feel? It was pretty light on, I think, the first couple of shifts. In fact, we didn't have any sort of washing at all. But anyway, I still thought I'd stick with it, see how it goes. Because they had said they'd had really busy days and then the neighbourhood centre here transferred. Just excuse me one sec. Hi, Steve Sutton. Out for two weeks, so we're trying to get it fixed. I forget to clap my hands because it's super helpful. Keep going. What was your first experience like in Orange Sky? It was a bit quiet to start with, but then the neighbourhood centre relocated here and it's been really good. So a lot of people have come to get, you know, support, food support, hampers. You know, talk to people about trying to get accommodation and then it just sort of picked up from there. So started getting a lot of people. What's your kind of personal take on the impact of Orange Sky for friends and stuff? Like, is there a certain element of it that you think is more better than the other or like a bigger part of it, like the washing, the connection, the conversation? Yeah, look, I think it's a really good service for the friends. You know, some of them just don't have or can't afford to get their laundry done. So, yeah, I just think it's a sort of vital service. You know, particularly the friends here, they seem to be all pretty chilled and easygoing and everyone is really, really appreciative. So, yeah, just nice people. Cool. What's your sort of, has your opinion or take or understanding of particular things changed since you've started? Or like what's the journey been like interacting with people experiencing homelessness in general? Has it changed or the same? Yeah, look, I would say I was probably unaware of how many people are homeless. And, you know, I've sort of done shifts here. I've done shifts at Wyong. I've done shifts at Woi Woi. So you get to see different sort of areas. And it's, you know, it's a lot of different things. Yeah. And it's, yeah, just interesting how many people are sort of living out of vans. And, you know, like you look at it and, you know, like I just sort of like in some cases wonder why. Like, you know, I look at the person they seem, you know, quite nice to chat to. You know, some of them have got interesting backgrounds. Some of them are quite talented. I think Steven over there is some sort of electrical contractor. And you sort of just wonder why are you living out of a van. So, you know, something like that. You know, sometimes you think but for the grace of God go I. So, yeah, look, it's a lot more widespread than I thought, I guess. Have you changed the way in which when you see someone experiencing homelessness, is there a different feeling than when you first volunteered? Or like do you notice different things in the community now like because you're closer to it? Or one thing I always think is interesting is like do you have different conversations with your friends and family? And stuff like that? Or like is that a constant change for you? Yeah, look, you know, a lot of people that, well, sort of friends and family that I talk to sort of say, you know, like what's Orange Sky? They've never sort of heard of Orange Sky before. So, you know, from that sort of perspective, it's good to, you know, just be explaining what it's all about. Hi. Do you want a coffee or a tea, love? No, I'm fine. Thank you. Do you want a toast of cheese, Sam? No, no, I'm good. Thanks very much. You sure you don't want anything? I'm totally fine. Thank you so much for asking that. Yeah. Yeah. Yeah. So, yeah, just basically just talking to, you know, friends what it is. Yeah. Like it's, there is a lot of conversation on homelessness, like especially in Brisbane where all the tents and stuff like that. Do you have a take on what, like, I suppose what's A, what's needed and then B, like what the impact is on the community? Like what's the, what's the role of Orange Sky is in general? Like, is it broader than just the Washington? Well, yeah. I mean, what's needed is obviously more affordable accommodation. I think that's, you know, how we're going to address that, I don't know, but there needs to be more money into, you know, affordable housing for people. And it's not getting any easier on the central coast. I think we are seen as, you know, like a lot of people move out of Sydney and sort of buy up here, but they're, you know, they're not getting any more money into, you know, the city. They're not getting any more money into the city. They're not getting any more money into the city. So, you know, I think that's a big part of it. Yeah. Yeah. Yeah. Yeah. So, you know, I think that's, you know, a big part of it. I think we are seeing as, you know, like a lot of people move out of Sydney and sort of buy up here, but they're, you know, buying up what would have been, you know, first home buyers or people that are on, you know, lower socioeconomic, you know, ability to buy a house. It's just pushing up central coast prices to making it more unaffordable. Totally. Totally. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Eek! Eek! Yeah. So, I don't know what you're thinking, but I'm kind of thinking that whatever you do, the general things that you're doing excitedly when you're around a lot of new stuff that sort of moves into that balance and I wouldn't exactly say is the intentional role but I'd say is the time when is the time setting the please come for me time. How did you decide whether to give it a go? Well, yes. the video, the introductory videos and everything that are in Sky is very good. They've got a great resource base to get in and learn how to do things. You know, like I've only been here since October but started doing the van leader sort of role and the massive information there is just phenomenal. So, you know, like I come from a corporate sort of background and you know the training videos available but Orange Sky's training videos are really good. That's good feedback. Yeah. What do you feel like you get out of it, volunteering and what keeps you coming back? It's probably, I think, well yeah, one my wife makes me, no she doesn't. But look, I think it's the interaction with the people is good. Like just the friends are really, really grateful and will come up to you quite often and say, look thanks, we really appreciate what you do. We really appreciate what you're doing for us and just the camaraderie too, I think, with the other volunteers is good value. So I'll keep doing it for that reason, I think. Yeah, look, I just get a bit of a kick out of doing it, I think. That's great. It's a bit of a difference from a corporate sort of background. It is. What's a leadership role entail for the shift, I guess, for the vehicle level? What do you have to do? For the van or in general, the vans? Well, you've got good support. I mean, I come from a van. I come from finance. I've got no mechanical background at all. And when they sort of tapped me on the shoulder and said, Steve, would you be interested in doing it? I go, yeah, you guys must be desperate. Good with spreadsheets, not with mechanical stuff. But no, look, the support's pretty good. You know, I think what they said for the role is they basically just want someone who's prepared to give it a go, take a crack and see what you can do. So in a few minutes, I'm about to try and get the van. I'm not sure. I'm going to try and see if I can sort out the diesel starvation problem on the dryer. So we'll see how that goes. Sounds intense. Huh? Sounds intense. I was always the worst on the tools with Orange Sky. I didn't know what was going on. Well, I brought the tools, so we'll see what happens. If I fix it, I'll be a hero. If I don't, I'll be, yeah, I knew we shouldn't have put that finance guy in charge of the van. Orange Sky started doing a few different things, like going out of remote control. Like going out to remote communities, like taking over some laundry mats, like doing shipping container type things as well. What place do you think innovation is in charities and like, yeah, like the opportunity to do more, I guess? Like how important is that in terms of the social sector, not the profit sector? Yeah, I like what they do here. I think working in partnership with the local government, I think it's a really important thing. Working with other service providers is the way to go. I, you know, like I just love the way here the neighbourhood centre sort of works together. Like you see them bringing out coffees and sandwiches for the guys so they can sort of sit around and have a bit of a social thing. And you know, the guys get used to seeing each other every Friday, so they turn up. A lot of them turn up early because they know we always turn up early so they can get in there nice and quick. But then, you know, like the laundry will get done, but they'll still be here until we, until we finish and go. But yeah, just the other services that they provide, like trying to find accommodation for the guys or the ladies, you know, the food hampers and different things and yeah, mental health if they need it. All right, that's about it. Anything else you wanted to touch on? I feel like you wanted to say, give some shit to Nick and Lucas. I don't know Nick and Lucas. I don't know Nick and Lucas personally, but it's a good thing that they've done. So yeah, I think it was, yeah, it's just brilliant. I can't believe how fast it's spread, the number of vans around. So yeah, good job boys. 10 years this year. Yeah. Wow. Pretty angry. I didn't think they'd last this long. Nick, that's on top of you Nick. All right, later. Thanks. Cheers. See you later. Bye. Bye. Bye. Bye.",
  "themes": [],
  "themeIds": [
    "recKMvpxzKSxNdSvC",
    "recYCyUFGBWZAecMH",
    "recWN3p7cawNGjY9i",
    "recMmR0tD0eWWZeFP",
    "recV7T7udhBP8pMEH"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}