{
  "id": "rec1fKngAgUJ7Gv5I",
  "name": "Amanda Mundell",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "Amanda Mundell shares her story of overcoming homelessness, mental health issues, domestic violence, and child abuse. She now works as a tenancy manager, helping others in similar situations. She credits an NDIS plan and support for her mental health recovery. She volunteers at Orange Sky, providing laundry services and connections with the community. Amanda emphasizes the impact small acts of kindness can have on those in need. She is also becoming a spokesperson for the Good Box charity to raise awareness of helping the homeless.",
  "quotes": [
    "rec4NxI2II2C6cEDl",
    "rec2WZcA5Kwf2x81e",
    "recxAeYMjARvdgUc5",
    "recjsuiI3qHEpukt4",
    "recOO1XtmACfCM8SB",
    "recWDCvviDt5dGCCT",
    "recxOcJ74Xu6LPlN7",
    "reciBU05jeyIRXBsE",
    "recfFs1tPRIBBLeSj",
    "recp5znt6mGkpnUPk",
    "rec7NswvPDYH3UDDH",
    "recPHX8evQ8hnQI7y"
  ],
  "transcript": "Alright, just tell us your name and if you spell it, it'll be amazing because that helps the editor. Okay, so my name's Amanda Mundell. Just look at straight at me. A-M-A-N-D-A, surname M-U-N-D-E-L-L. Tell us a little bit about yourself. I haven't met you yet. I'd love to learn a little bit about you. Who are you? I'm not really sure what to say. If you want me to speak in relation to Orange Sky, I can tell you. You're in relation to yourself initially and you just go from there. So who are you? Tell me a bit about yourself. So I'm a single mum. I raised my two girls on my own. I'm now working as a tenancy manager for Pacific Lynn Cowsing, which is a complete turnaround after everything I've been through. And I help people who used to be in the same situation I used to be in. So that's pretty incredible. What do you come to telling us about your history, I guess? What sort of stuff have you been through? I've been through homelessness, mental health issues, DVI. Child abuse. Yeah, I've been through some pretty dark times. How do you like to talk about that openly? Is there things you like to talk about or not talk about? What are some of the things you would like people to know about you? Some things I'd like people to know? I don't know that you can come out the other side. I think that's the biggest thing. I mean, I got to a point where I completely gave up hope. I didn't think there was... I was on the other side. And now I know there is. That's awesome. What was part of the change? Tell us a little bit about those moments of change for you. I was very lucky. I was approved for an NDIS plan for my mental health. And through all the wraparound supports they provided with psychology, participation in activities with the community and things like that, it really helped me get back on my feet mentally. And then I took a leap of faith when I applied for the cadetship with Pacific Link Housing, studied full time, got my certificate four in housing, and I now have a full time career in an amazing organisation, helping people who used to be in the same situation I was in. Wow, that's incredible. What are some of the things that you remember from when... Do you remember a lot about when you were in the cadetship? Or when you were in the situation when it wasn't nice? And is it okay to...? Yeah, please ask. Yeah, I remember. It was horrible. It's just so sad and lonely. And you have so much guilt for ending up in those situations despite how hard you've tried not to be there. And the impact of the people that sit here and talk to you, I mean, that was huge. Yeah. I mean, I remember when I used to line up here for food, line up here to wash my clothes, and I felt really embarrassed. But he just spoke to me the whole time I was here, and he was so kind and so caring, and he didn't judge me for the situation I was in or what I'd been through or anything I was talking about. And he just had the biggest impact on me. And as soon as I got myself a job and I got myself a house, I thought, I want to give back to the community that gave so much to me. And I became a volunteer for Orange Sky. Wow. Yeah. That's incredible. That's incredible. It's quite unique being able to talk to someone who's been through using the service and now a volunteer. Yeah. What does that feel like for you? It's very humbling. Sometimes it's hard because I know what they're going through, and I can't do more for them while I'm here other than the small amount I'm trying to do. Yeah, I think, but it's also very rewarding. Because I know when they're speaking to me and when they're smiling and, you know, they're just really in the moment and enjoying that moment with me. I know from experience that that has had an impact on them, and they will look forward to coming back next week so they can feel that same way again. That's cool. What was the feeling like even applying to be a volunteer? Like, was that daunting? Was it exciting? Like, how was it for you? Well, I'd never done anything like that before. I was very nervous. I didn't even know if I'd be accepted. I didn't know how it all worked. I just, I so desperately wanted to make people feel how I felt because I don't have the best vocabulary when it comes to describing things, but you really do feel invisible when you're struggling. You know, you don't really have anyone to turn to, anyone to talk to, anyone to help you other than, you know, the specified services. And they try to be as kind as they can, of course, but they can only do so much. The rest of the day and the rest of the night, you're on your own, and you're just stuck up here. And so to just sit here for a whole hour and be treated like I mattered, that meant so much, and that's how I wanted to make other people feel. That's cool. Is this really annoying? I thought that was it. No. It's not like a painful, like, annoying life. Wait, I really thought that was it. I was there. I was, like, maybe dreaming that that was actually there. Actually, this is... Maybe on the other side. Look at that. Oh, my God, that kind of worked. Am I speaking okay? I'm so good. Okay. What is it like as a friend sitting around and getting all, like, talking to all those, I suppose, staff and that kind of stuff? I think once you've been coming here for a little while and you've formed a bit of a relationship, I think that with the Orange Sky staff, it's not as overwhelming, it's not as embarrassing, and you feel a lot more comfortable and a lot more...a lot happier, a lot more open in your conversations. But when people first come here, obviously, they're not sure what's going on or how it works, but it doesn't take long for people to warm up to us. We're all such lovely people, and we all really do have a genuine empathy for everyone we're servicing and everyone we're talking to. And I think they see that and they feel that and they hear that. And they respond to that. That's cool. And then I guess now you're a volunteer. Yeah. Do you feel like you're able to talk to people differently or do you feel like you're the same as any other volunteer? What's that feeling like for you? I think I'm just the same as every other volunteer. We're all just here to, you know, help people and make them feel good and give them, you know, a kind ear and a kind word and some clean clothes. And, yeah, a nice meal from the services that are here. Now that I have the career I have, I sometimes feel like I can help people a little bit more with some advice and some assistance in the way of, you know, how to take a few more steps to get out of the situation they're in. But of course, I try not to do that too often. And I'm not here to tell people what they should do or tell people what I think they need to do. I'm just here to listen and, you know, talk to them. Cool. OK. Um. I don't know if I answered that many questions. I don't want to annoy you too much. No, that's fine. Orange Sky, like, it's laundry, but it's also like a connection space. Yeah. It's also like a genuine conversation. Yep. Are they things more important than the other or is it just dependent on the person that's using the service? A lot of people come for the conversation. Of course, if they need their clothes washed, we're going to wash and dry them for them. But some of the regulars still come even if they don't have any laundry. I think that that connection is huge. Cool. Um. There's a... Like, it's interesting, I guess, like, how would you describe the level of struggle, I guess, the whole community... Is there a general understanding that you have of how much people are struggling in this community or...? On the Central Coast? Massively. Massively. And I think a lot of it is hidden. You know, a lot of people... Because it really does take courage to come here, to have people know your situation, to ask for help. That's hard. It's really hard. I think the majority of people who are struggling hide. So... And then the statistics themselves, I mean, the rate of homelessness, the lack of affordable housing, the lack of rental properties, they're hugely increased. And if you have to pay a priest's rent, it's just making it worse. You know, I think the Central Coast has the highest rate of DV in New South Wales. Drug and alcohol addiction, mental health issues. I mean, that system is completely broken. There is no mental health support on the Coast whatsoever. Mm. Yeah, yeah. Do you sometimes think about, like, the levels of disadvantage from a female or male perspective? Are there different, like, risk factors and different things being a female and a male has? Um... I think a lot of people would say yes, because they would think that women are more vulnerable. But I think that's really taking away from how vulnerable men are as well. Yeah. But then you've got the elderly, you know. They're also physically more frail, more prone to illnesses. They don't have the capacity to use technology, which is what's required these days to submit referrals to services or apply for housing and things like that. Um... They also have their medical needs as they get older. But, I mean, the young, the old, the sick, the male, the female, I think we're all just as deserving of the help that we require. Mm. Yeah. I'm just gonna get the help of my mum for a sec. One sec. Take my mum. Yeah, it'd be great. I'm just gonna get the help of my mum for a sec. I'm just gonna get the help of my mum for a sec. I'm just gonna get the help of my mum for a sec. Can you just stand there? It won't be too much long. I'm almost finished. Try not to get the chin hairs. Is that right? I think so. Getting closer, closer, closer, closer. Closer. I'm glad I shaved my face this morning. Is that there? Yeah, that's pretty good. You've got a lovely shine on your face. Oh, thank you. My friend used to say, I look like Burt Newton. A big shiny forehead. Actually, I'm sorry, can you come over this side? I feel like it's a bit better angle. Going closer. Go back a bit. OK. All right. Come around a little bit. Sorry, this is so good. Back a bit. Go forward a bit. I'm just taking a piss now. OK. Um... Stopping you in a minute. What would you say to people that are on the fence about volunteering at Orange Sky and what's the impact that it can have on any type of individual? Yeah, please know that your time is so valuable. I mean, you're only here for one or two hours once a fortnight and the impact that that small amount of time has on the people that come here is huge. Huge. I mean, there are some people who wait all week to come here, just for that day. And you're literally changing people's lives with every conversation, with every load of laundry. You're in a very unique position where you can speak to both groups of people because you've had those experiences. Yeah. Are you comfortable almost, like, what would you say to people who are struggling, who are not wanting to come to Orange Sky, maybe because of different stigma or different people? Like, is there something that you would represent why they should give it a crack? As a friend, you mean? Yeah. So, everyone that volunteers here are so caring, so kind. They genuinely want to see you. They want to talk to you. They want to hear about your day. They want to know what's going on in your life. They want to help you with your laundry to make sure you've got beautiful, warm, clean clothes. And we're here to support anyone in need. So, please don't be scared to come down. You know, we'd really love to see you. Yeah. Um... Just go back a little bit. What was your first time here like, I guess? And were you hesitant in telling... Very, very. Um... Uh... I'd heard about the service. I mean, at the time, I'd just found myself accommodation and I had no washing facilities, so I had to find somewhere to wash my clothes. I heard about Orange Sky. Didn't know what to expect. I came down and saw all these really happy people talking and laughing and sharing a meal and waving each other over and, oh, hi, can we help you? You know, what's your name? Come and have a seat. And I just felt so welcomed. And I thought, wow, I'm gonna come here every week, you know? And I met some really great people and just like I said earlier, the impact the Orange Sky volunteers had on me that day and the way they treated me, it almost brought a tear to my eye of happiness and appreciation. It still sometimes does. Yeah. What is... What's the main difference now that you feel compared to when you were maybe at a lower point? Like, what's the representation that you feel now compared to then? Within myself? Yeah. I feel proud now. I never... Other than doing my best as a single mum, which I was really proud of, and my girls are amazing, so I think that's a testament to what kind of mother I was, as much as I've made mistakes along the way that impacted my family. I never really had anything to be proud of. I never had a sense of purpose. Volunteering and my career now give me that and... I'm not sure what else to say. Yeah. It's incredible. I think it's a really difficult thing to answer and you did such a great job. I mean, my self-worth is through the roof now. I'm certainly... I'm not obnoxious or arrogant, but I've spent my entire life with no self-worth, no self-esteem, completely beaten down, struggling to portray strength to my children. And now I can genuinely feel that strength and feel that pride and feel that self-worth, and that's incredible. What's kind of next, do you think? And in thinking about what's next for you, one thing I'm always very interested in, is there's different types of knowledge in this world. Some knowledge is learnt, some is written and read, and it's a huge part of the experience. So you've had this massive experience. Yeah. How are you going to use that in the next part of your journey? So actually, as of today, I'm not sure if you've heard of the Good Box. Yes, I have. So I'm now going to be a spokesperson for the Good Box, speaking to corporate executives and school children to promote what they're doing and the impact that it has on them. Yes, I have. And I'm just really excited to see what that service has on homeless people. So that's my next step in my charitable direction, because I wish I could do more. I mean, I'm not financially able to do more with my money, but I can definitely do more with my time. I remember when the Good Box started, they came in and they were packing their stuff at Orange Sky. Yeah. It's awesome to see how much... I got a Good Box, you know, and the little handwritten note, just makes a world of difference. little things that are in the box. I mean when you're homeless you can't afford shampoo conditioner and if you do it's the cheapest one possible whereas you get that little box and it's got brand name products in there and it's just like Christmas. Yeah. On that, what's the power of people coming together to do cool stuff? Yeah well I only spoke to them today and it was just amazing so I asked why are you doing what you do and they said just to share awareness and to also share the impact that these sorts of charities have on the people that are benefiting from them and that's what I want to be a part of bringing awareness to people of the impact they can have by volunteering, helping, donating, whatever option they have to give because it hugely impacts people's lives and the smallest thing means so much and I don't think people understand that they think oh I'd have to donate thousands of dollars to change someone's life. Five minutes of your time can change someone's life. How do you think about your next part in terms of being a mother I suppose? What's that identity feel like for you and what do you need to achieve in that life? Oh it's different now. My youngest just moved out so strange that having her at home, my little baby all out there by herself but she's doing really well. My oldest daughter's still at home and she's like my best friend. I don't think, as they become teenagers you kind of think I'd really like to live alone and then they get past that point and they just become these beautiful young adults and you think please don't ever leave. So yeah I just like to continue making my children proud and you know they are really proud of me because they know what I've overcome and I just want to keep doing well in life and show them what can be achieved and be a good role model for them and encourage them to participate and volunteer when they can. Well I'll have to say from you saying you were nervous and not sure what to do. My hands are sweating. My whole body's sweating. You can hide them away. Well we get it. That's it. Like well done. Like it was amazing. Okay thank you. Yeah thanks mum for holding the... Thank you.",
  "themes": [],
  "themeIds": [
    "recORucvcYz9smDJX",
    "recZ1GqqQzW8jWthI",
    "recJb0prlsgfa9V7p",
    "recI6guxSoePzK6SU",
    "recYRBHWeKkF7vbjL"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}