{
  "id": "rec1L7AGenWn9GID1",
  "name": "Terina Ahone-Masafi",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "Terina Ahone-Masafi, a 29-year-old in Australia for 11 years, enjoys art, music, and athletics. She appreciates Orange Sky's customer service and support despite being homeless. She came to Trambi for showers after couch-surfing. Describes friends as a strong connection. Thinks Orange Sky volunteers are welcoming, professional, and interesting to talk to.",
  "quotes": [
    "recbDBaNQs31bPfhj",
    "rectK4xTQNEUFKQkF",
    "recXAFDrDJec4IuZI"
  ],
  "transcript": "So my name is Terina Ahone-Masafi. So I am 29 years old. I've been in Australia for about 11 years. I came here when I was about 17 years old and I'm 29. What I love to do for my hobbies, I love doing art, I love doing music and I also am very athletic. Why are you coming here to do Orange Sky? So Orange Sky is in, okay so I am doing it basically because I'm homeless but I really love their customer service, I love how they treat people and I just really love how they're very welcoming and professional. Tell us a little bit about... what you... like why you come to Trambi in general, like why you need to do that? So I came to Trambi because I was couchsurfing with another guy and obviously I had to move out and then I got told about Trambi. I got told about Trambi a while ago but then I came here one day on the 25th of June and yeah, so I found out about Trambi, started to realise you can have showers here and that's how it all started, yeah. Cool. And just tell me your full name and spell it for me. So my full name is Terina, so T-E space R-I-N-A, Ahonima, A-H-O-N-I-M-A, S-A-F-I, S-A-A-F-I. Amazing, that's so cool. And like tell me this, we did this podcast about friends, what does friends mean to you, the word friends in French here? What does friends mean to me? Connection. Having a good connection, you know. You know, knowing, getting to know one another, each other's positives and negatives and being there for one another, yeah. Amazing. And any other words about Morin Sky and the ladies here? Very welcoming, professional and they're very interesting to talk to because they've got a lot to say.",
  "themes": [],
  "themeIds": [
    "recyZe8sz3e02F1Xe",
    "recdnAguSkb6t2aaA",
    "recWxJqRlevhzXUSJ",
    "recWcdloM7pj8iFFT",
    "recjwcHTzTvuHvjfT"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}