{
  "id": "rec14oJBH2Gr9stvL",
  "name": "Emily Bell",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Bundaburg",
  "videoDraftLink": "https://share.descript.com/view/n6TlgXkU4sQ",
  "summary": "Emily Bell is a stay-at-home mom who volunteers with Orange Sky, a charity organization that provides support to homeless individuals. She started volunteering with Orange Sky in Rockhampton after hearing about it on the news. Emily enjoys the organized and easy-going nature of the volunteer work and finds fulfillment in helping others, particularly backpackers in her community.",
  "quotes": [
    "recfR97aBaxY2bfvI",
    "recl3tSd171jeOBmq",
    "rectFoxkipqhWPoiL",
    "recav5qAZNAWtOgnO"
  ],
  "transcript": "# Emily Bell\n\n[00:00:00] Also the, um, sunshine Coast Bruce Highway. Yeah. Yeah. Cool. You have to pick your right time. Yeah, I know. I'm just cut my hands 'cause that helps me pick my cameras. Um, absolutely. This looking great. Um, let's just go your full name. Yep. And spell it out for me just so I get that right. Yep. So I'm Emily Bell.\n\nE-M-I-L-Y-B-E-L-L. Cool. Like ding-dong is what I always say. And what's a little bit about yourself? First up about myself, um, I'm a mom of a 3-year-old. Cool. Yeah. Currently not working. Um, have been doing um, orange sky volunteering as a transitionary thing back to work 'cause I've been on income protection.\n\nUm, so yeah, took on the team leader role last year. Yeah, it's, [00:01:00] I do enjoy working with Orange Sky. It's very, there's a lot of organized parts. Cool to it. Yeah's, easy going. What, um, when did you first hear about Orange Sky? Um, well, I heard about it years ago. When? When they were first starting it. True. Yeah.\n\nSo I saw, I remember hearing about it on the news. Um, yeah, and so then I was in Rockhampton at the time and they were looking for volunteers, starting up their, their service and um, so that's when I like, yeah, jumped on board. Cool. Yeah. What keeps you coming back to Orange Stone? The tips, like what are the things that excite you that you coming back, getting to know people and being able to support?\n\nI think here in Bundy, we do have a large amount of backpackers who use the service. If we didn't have them, then we wouldn't necessarily get as many people at the moment. Um, we work alongside Angels who had, they had, um, a [00:02:00] support center, but because of violence there, they had to shut that down. So we don't get as many people who are vulnerable and homeless, so that makes it hard.\n\nYeah. Yeah. Right. Mm. Um, what's some of the things that have, are there things that you changed in yourself, um, from volunteering with Orange Sky or things that have changed, shifted in your thinking or any of that kind of stuff for yourself? Um, I think, I know government and politics and everything, that's just the whole other guilt ball game, but it impacts everything that everyone does.\n\nAnd you know, people are struggling at the moment, so it's good that organizations like Aaron Sky are out there. I think here in Bundy, I want to try and, I dunno how, but try and get more people to come to get, come to the service. Um, which is hard because of the support center not working. I've been trying to get, um, one of our volunteers to maybe take on, um, sort of the [00:03:00] community engagement officer role.\n\nYeah. We are right on the edge of a very busy car park. Everyone loves coming to the mini mart. It's always cute food. Oh, right. Yeah. Free food Mini mart. Yeah. So it's like the food bank. But, um, a little bit of, so they do, do, um, they do meal school meals for multiple amounts of kids, um, a day, and then they help with different Christmas and back to school campaigns as well.\n\nYeah. Cool. Um, what's the, um. Um, what do you think that the people that use the service, you said like backpackers come and stuff? Mm. What's the main like, outcome for them, do you think? Like, is it primarily washing or is there some people that primarily love just because it's a place to hang out? Like what's your feeling around that?\n\nYeah, so the backpackers, it's purely the washing, [00:04:00] um, because they get charged $5 a wash, $5 a dry, but it's also convenient. It's right across the road from where they are. But we do have a lot of friends who come more than morning shifts. They get more friends who like to come. They do need the laundry done, but they also like to stay for a chat.\n\nThere was one gentleman who would literally just come for a chat. No washing, but then some friends have made him feel a bit unwelcome, so I've found out now that's always a hard thing to balance, really, but Yeah. Yeah, a lot of people like to stay for a chat. Yeah. And we enjoy having a chat as well. Yeah.\n\nAnd how do you feel about the orange skies, like as being part of the organization and what's that kind of feeling? I feel like there's a lot of support there. Probably a lot that we don't use well enough, but um. Being a team leader, I try and I'm trying to make a regular thing of, you know, putting forward different, um, policies and support things that our in Sky might have [00:05:00] available so that everyone's aware, um, we can always call up support services.\n\nThey're great as well if we haven't have any problems. So yeah, they're always there and able to help out. Hmm. And what's the general sense of community in Bundaberg in terms of people doing it tough, do you think? Is there a. Understanding of it, is it not as bad as other places? What do you, what's your general vibe, I guess, of people doing it tough?\n\nI think there's a lot of people doing it tough. Um, I'm not sure whether the pod is in the right location any longer. It was initially, I, I agree, but not any longer necessarily. Mm-hmm. Um, I think there's a lot of people, a lot of like single moms and families are in hostels, motel rooms. Mm-hmm. And stuff.\n\nAnyone who was sort of like camped anywhere have pretty much been moved out of onto the edges of town, so it's really hard to know. Or they're moved along quite a lot, which is really [00:06:00] hard to see. But I see that on the news. A lot of places, a lot of people are moved on when they don't really have anything anyway.\n\nUm, I feel like there's a lot of government organizations who try to make a difference, but. Uh, it's still just taking the edges and it's all about ticking boxes rather than actually helping lives sometimes. Yeah, yeah, yeah, yeah. Um, and anything you think that houses can improve on? Whether they doing right, wrong?\n\nOh, orange sky. Yeah. Uh, I think it's a wonderful concept. It's brilliant, um, and it's great. To have multiple amounts of volunteers. Mm. Um, I think we just need to try and somehow encourage, um, friends who are doing it more tough. Back here for that support. Yeah. Um, but I think there's a lot of [00:07:00] other undercurrent things in Bundaberg.\n\nI've only been here just over a year, so there's probably a lot of stuff that, um, I'm not aware of. And I live out at Bera by the beach, so it's, you know, it's quite different from here in town. Mm. Yeah, I think that's where I stayed on the hotel. Yeah. It's quite nice out there. Mm-hmm. Yeah. I love that. It is, um, it's quiet.\n\nMm-hmm. And yeah, it's just, it's peaceful. It's beautiful. Mm. But you still feel like you're in the middle of a suburb. Yeah. Which you are, but it's not like, um, yeah. It's not too bustling or anything. Even Vanderberg is a great town to be, to be honest. Hmm. Yeah. But there's a lot of, um, socioeconomic issues and it's quite a low, low economic sort of town.\n\nMm. Unfortunately. Yeah. Yeah, yeah, yeah. Yeah. Cool. Anything else we didn't get to or es or topics? No, I think that's great. [00:08:00] Yeah. Alright, I'm gonna take a photo. Oh gosh. And then you can see.\n",
  "themes": [],
  "themeIds": [
    "rec7rvJylvDyIyght",
    "recRCRh9Wc7YrshDF",
    "reccgndo9jsQLWhSR",
    "recC4UegAkDoXQ7mI"
  ],
  "shifts": [
    "rec7Rp0dprgIjD1sI"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}