{
  "id": "rec2g2gr89MSlsn5x",
  "name": "Pam Wellham",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "The transcript features an interview with Pam Wellham, a volunteer with Orange Sky, who talks about her involvement with the organization and the impact it has on the community. Pam discusses how she first learned about Orange Sky, her role in the Rotary Club of Belmont, the importance of giving back to the community, and the value of providing clean clothes and a listening ear to those in need. She also reflects on the need for innovation in support services and the positive effects of volunteering.",
  "quotes": [
    "recIt3rZwbOdRoU07",
    "rec7FEsXcqLClDjXv",
    "recSAi0ZDi92q9MhC",
    "recBAyHKqfq7jETWu",
    "recm1tpoNLMM6Gf18",
    "recl37Fyib4TmO67x",
    "recM1WaA2sqjvbxiN"
  ],
  "transcript": "Hello. Oh, chair for you. So good. I was worried that I wouldn't know the answer. All right. So first off, if you could do your name and spell your name, your full name for me, it would be awesome. Pam Wellham. Just P-A-M-W-E-L-L-H-A-M. Stop. Tell us a little bit about how you first found out about Orange Sky. I found out about Orange Sky just so I think on the radio or something. And then I asked one of the gentlemen who was in charge of Orange Sky in the Hunter area to come along to a Rotary meeting and talk to the Rotarians about Orange Sky. Awesome. And so it just went from there. He just spoke about how many shifts there are during the week in Hunter. And I asked him whether he needed people, and he wanted some people at Belmont to first. But then there weren't many people at Belmont. It was over COVID. So then they moved it down here later, and so I'm here. Because it's reasonably close to Belmont anyway. So it made it convenient for me. And so you're part of Rotary? Yeah, I'm in the Rotary Club of Belmont, yes. What's that? What's the Rotary about? It's a service organisation. So it's similar to Lions in that it's an organisation of people who want to see an improvement in the community. It's humanitarian, peacemaking, economic development, helping people in our local area as well as overseas. And yeah, it's just elsewhere, just in schools, anything. The motto is service above self. So it says you're working for other people. So it's a good motto, and most Rotarians live by it. So it's a really good organisation. And this is just an adjunct to it. I'm the only one in my club who's actually volunteered because the others are fairly busy. Some work still, but I'm retired, so it's much easier if I'm retired. What's that do for that sense of community and that kind of stuff? Yeah. I think it's good. I think people who are particularly retired, but other people as well, I think giving back to the community is something that really makes you feel better. Volunteers always seem to be a happier type of people, and they like to just see other people benefiting from the time that they have free. Once you've been working in the community for so many years, it's good to be able to do something, not just sit around and go to the beach, which is nice. But it is good to be able to give back a bit to the community. Why did you... What stood out for you, I guess, at Orange Sky that made you feel like it was something you'd want to do? Well, I think because I'm aware there's a lot of homeless people. We don't see the homeless very much around here, but I'm very fortunate in life. So when you see other people who are worse off than you are, you want to be able to do something for them. And Orange Sky just worked well because I'm sure they're... are more homeless than actually come here. And I know people who come to Orange Sky aren't necessarily homeless. Sometimes they're living in their car, which is homeless, but, you know, they live in their car, they can get a shower, but they can't find... get their washing done. Or they're in public housing, or they've been given an opportunity to go to a motel, and motels don't have... necessarily have washing facilities. So we often get some people who have been homeless who the different service organisations, have lined up accommodation in a motel, but they come here and they wash their clothes until they find a place with a washing machine and drying facilities. What's your sense of the broader community and, like, doing a tough duty? Like, do you have a concept of that? And has that changed since going here? I think... I think... Well, when I first started, it was COVID. And so people were... they weren't out and about. And I think emotionally or mental health issues arose because they didn't meet with people. So we were doing shifts during COVID. I mean, making sure we got social distancing and doing all the correct things, but it allowed people to come and talk to us and have someone to assist them. The service organisations that are close, providing food and things were often close. Since COVID, I think there are so many people who are homeless. Even in this area, because it's such a beautiful area to be in, people could be down by the beach. You know, they might be... they might catch a bus and go to a certain point where it's quite isolated, but they can catch a bus here and they can get their washing done. So it seems to be on the increase. And also domestic violence. You often have people who come here who have been relocated because of domestic violence and can't provide for their family to live. They can't provide for their family to make sure the children have clean clothes to go to school or just clean clothes necessarily. How... Is it often that you are asked to describe what Orange Sky does? And is there a certain way in which you describe it to your friends, family or others? Yeah, I have been asked a few times about... Particularly if you go shopping and you've got the T-shirt on. Do you have a spiel or things you go to? Or is it like you change it up every time? It's a bit of a variety. I don't... I don't learn something. I have in the past, in different organisations do the rote learning. But I think I try and gauge what the person's... What's going to interest the person more. Is it... Sometimes it's how often do you do it? Yeah, that's what they want to know. But yeah, usually I say Orange Sky assists the homeless and those in need to get... Have clean clothes on a regular basis. That's cool. Yeah, so... What's the balance of support that's almost like... Like someone's washing something and some of it's like connections, some of it's like just someone to talk to. What's the balance of that do you think? I think... I think in our shift it tends to be pretty balanced because people will bring their washing. We used to get a lady who came here and I'm sure that she got the clean clothes out of the cupboard to bring here to wash because they're all neatly folded. And when she saw that I actually unfolded them when they went in the washing machine, she said, Oh, I'll make sure I do that next time. So she wanted a chat. She was living in a home unit but she couldn't actually get washing done. She had a line so she could dry it but she still often stayed here so we could dry it for her as well because she liked the talking. She was a very bright lady and liked to engage in quite in-depth discussions at times. That's cool. What do your friends and family think about what you do? Do they ask random dumb questions or do they ask good questions? No, they usually just say, What are you doing again? Are you volunteering again? I go, well, you can come along. Oh, no, I've got to go to work. Yeah, but that's the biggest thing with my family. So what are you doing today? How come someone who's retired is so busy? What's the value for you doing all this stuff? Like why not just go to the beach? Why volunteer? Why do this? I don't know. It's something you make up, I think. I think the way we were brought up to give back to the community, to just don't do a half job at things. So when you don't have a job, you kind of go, Oh, I've got to do something. I can't sit around. I mean, I would sometimes love not to be able to go to a shift or something like that. But when you're rostered, you have to be here. So it's a bit, yeah. I've got enough in my life really to do other things, but it's always good and it's great to be able to catch up with some of the people. The friends who come on a regular basis, they change over the time that you know them. So one of the gentlemen hasn't been here today. He hasn't been here for a few weeks. So we're all a bit worried. Where is he? What's happened to him? He could be just taking a break on holidays, but he's very meticulous. Every week he has an apron to wash. So I think that's astounding actually. Yeah. Because I don't use a bath. I don't use an apron when I'm cooking. But anyway, so it's a bit of worry when you do build up that rapport. Yeah, yeah. And usually when they come the next week, there'll be some explanation about what it is. But you do, they are a friend in a way, but we don't disclose anything. They don't necessarily have to talk. The gentleman I was talking about, he really doesn't really want to talk. He'll go and play basketball. Yeah. While we do the washing. He won't sit with us. And when we're finished, we'll just yell for him to come and he'll fold everything, put it in his suitcase and we'll see him next week. That's cool. Do you think your perceptions have changed at all from starting to volunteer to now in relation to people that are doing it for you? Or do you think that you already had a very good... I think I probably, I think the nature of my work in the past, I probably had, knew what was available around the world. I think I had a lot of experience and I think I had a lot of experience with what was available around and what people lacked. And yeah, I just thought it was such a good idea to have a mobile laundry. And I think it's amazing that, you know, Lucas and his mate came up with the idea and persevered after school. I just think it's amazing. And it's a pity some of the other, other young ones who have got ideas don't carry them through sometimes. Because kids generally are good. It's an interesting point. Like, I think Orange Sky sometimes gets seen as like welfare laundry support sometimes. But then also it also, it's like an innovation type place. Where do you think like creativity, innovation plays in supporting people doing it? Like, does it need, do you need a lot of innovation or does it get in the way of... No, I think you do need innovation because this van can be taken anywhere. Really. I mean, if you haven't got a water supply, we can have clean water. We can have water there. And having, I mean, we're lucky here. We've got all the, we can have power if we want. We've got water laid on. So we're right. We can water the plants with our grey water. But other places, more remote areas, they mightn't have that. Even though they might have water on, it might be town water. It might be tank water. So you don't want to take the resources of some particular areas. And we're not a remote area. So, but in the remote area, it would be good to be able to have access to a van like this. And, yeah, it's a pity that we don't have the showers as well. Because I think that's a big need to have a shower. But, but yeah, the people, at least they have clean clothes. And they feel good. They come and have a talk. Their mental health improves, I think, because they are talking to people. And, you know, we can have a joke. It's not all serious chatter. Yeah. Yeah. Cool. Is there anything you wanted to say that you don't think you got to? Is there anything you wanted to say? I think it's good. I think it's a marvellous innovation. As you said, it's innovation. And we need more innovation to help us. We've been doing the same thing for many years. We should, you know, use some of the resources that are available to see what, how we can better help the people who aren't as fortunate as we are. Good grab, that last bit. Good. All right, well done. Okay. I'm just going to take a photo of you now.",
  "themes": [],
  "themeIds": [
    "recrRjHpGcTCMLcgu",
    "recOoVCte2tnhppwt",
    "rec7jkJ5hLS3sa2WV",
    "recvCue7yOY1JnHm7",
    "rec7AWpgRolvKANKQ"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}