{
  "id": "rec3iGMWcSXQLKT0d",
  "name": "Colin Banks",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "Colin Banks shares his experience of being homeless since Christmas, living in a caravan, and finding support through Orange Sky Laundry service. He highlights the importance of community and the friendly volunteers at Orange Sky. Colin also addresses the need for more permanent solutions for homelessness and better understanding and support from the public.",
  "quotes": [
    "recsIjajDHBWXATJL",
    "reccaoGQdqRy1lwGo",
    "recJj6pIlaQiKQr2V",
    "reccNajq7HprM4sdq",
    "recCQy7a5Xff0RGc6",
    "recOsvqzfwSkXpjJC",
    "rec0qG0lfp3ByMlgq",
    "recJlvmt190Pr566G"
  ],
  "transcript": "All right. All right, brother. Wicked. Just tell me your name and... Your full name and spell it would be great. It's Colin Banks. C-O-L-I-N-B-A-N-K-S. Okay. What's the Colin Banks story? Tell us a bit about you first. Well, I originally came from Sydney, relocated to Harvey Bay, then came back, and came back... Then I've been homeless for the last... since Christmas. Staying at a... different car parks, and found out about this, and came here to do me washing. I've been doing it by hand. It's a bit hard when you've got nowhere really to do it. What was the... Was there a particular reason or journey to being homeless? Oh, yeah, family. Oh, you guys. Yeah, right. And then... And then... What's... For people that don't know what your experience is like, do you want to share a little bit about what you get up to? Really? Right. Well, really... It's hard off. I lost my pension when I moved out of home. So I had no income. So I had to stay in car parks. But I had a caravan. So I was pretty right there. And... I just couldn't afford to stay in, you know, caravan parks and that. So I just stayed around local, trying to work things out. How did you sort of stumble across Orange Sky Island? I was... I don't know what you meant to say, but you didn't know what you were talking about. You didn't know what you were talking about. I don't know if you were talking about the caravan. I think I was told about it. I'm not sure now because it's been coming for a while. And I'm told about the help with the church here, the community centre, and the wash machine. Oh, very hard. You only can do a few things at a time. It's a different feeling to be doing that. But I think I was told about it. And I was really, really, really, really worried that I wasn't going to be able to get out of it. And I told them that I was going to have to pay. And I thought, well, it's not going to be easy. It's not going to be easy. church here, the community centre and the wash machine. What's washing by hand? Very hard. You only can do a few things at a time and then you find some way to put them up to dry. Coffee or tea? Two sugar. Coffee. Thanks. No, thank you. Tell us about where you're staying now and what that's like. I'm staying in... ...a friend's front yard with a caravan. Thank you for that. What's it like living in a caravan? Oh, I don't mind it. Less of a clean. I've got everything in it, fridge and water, shower. So I'm pretty right there. Independent. Tell us a little bit about Orange Sky. What do you feel about the service? I like it. It's very good. The staff are very friendly. They're very lovable, cute. Do you want a cheese-tasted sandwich as well? Yes, please. Do you want one? No. OK. They come down and do our washing and you meet other people here and talk to them. What's the community like, I guess? Is there a community of people experiencing homelessness? There is a big community of it around. I was staying at Lakes Beach down here. There's quite a few there. There's another one at the entrance. There's quite a few staying there. But the only thing is... ...councillors sometimes come and make you move. You know, there should be a more permanent spot where the homeless are controlled. What's that like, I guess, with the relationship? Like the council and being moved on? How does that feel? Well, actually, down here it's pretty good because there is a... ...how can I put it? A place where, if you look on the internet, it's coming up with New South Wales Government, that if you're homeless you can stay in public areas and the council is supposed to help you find some... ...and community senators to help. What would you say is like one of the more... ...some of the more important things about Orange Sky? Like why is it good and what do you get out of it? It is good. You do meet people through Orange Sky. You get to meet people. You can do a bit of your washing and that. You're staying clean and tidy. You're not walking around like a grub. And what's it like, I guess, just being here and talking? Is that good as well? Like why is it good? Yeah, it's good because you're doing something, you know, and you're relating to other people. Do you have like a normal day? Like what do you do on a normal day, I guess? Just sit around, read books, probably go for walks, depending on the weather and where I am. Is there a sort of thing that you're trying to do at the moment to change your conditions? Or are you okay in the caravan? I'm okay in the caravan. I don't mind it. As I said, it's handy. It's not a small one. So I've got plenty of room and that in it. I've got a shower, toilet, so... What do you think the general perception is of... ...some of the things that you're doing? Someone in your situation, I guess, from an Australian perspective, do you think people have a good understanding about your situation? The homeless and all that? No. What do you think? I think a lot of people don't want to recognise it. It's interesting like... They know it's there, but they don't want to be involved or recognise what's going on. I have met people that say we shouldn't be... ...staying in places where we've got to stay. You know, it's Australia-wide and... It's a big thing. Different circumstances have put people in different positions. Are there people you think are really disconnected to a homeless? And like... Are there things that we could do better in terms of providing spaces... ...for people to be hanging out together? Yes. Yeah. A bit more. Can I have one of your walls? Thank you. Very full of love. You got it? It's hot. Yeah, just for you. I'll put it down. Sure. Yeah. I think there should be more involvement, you know... ...in things that are happening. Yeah. Yeah. Yeah. And I just got kind of like a... It's not just like a washing laundry place. It's kind of like a... Meeting place. Yeah. Well, how do you feel about that idea about having a place that you can just yarn and have a catch up and stuff? Yeah. It feels good to have someone come down. I come down on a Friday morning and we sit around and talk and that. That's cool. And how do you feel about that? Yeah. That's cool. And how do you find the volunteers? Good. Very friendly, nice, helpful. It's interesting too, like, because they... Do you think it's better that they are volunteers because you know that they're doing it... Yeah. ...for their own reasons? You know they're helpful and that because they're volunteers. They've got their heart in the job. That's cool. Cool. Is there anything else you wanted to say or...? No. I can't think of anything. Can you? No. It's awesome. What I'm going to do is take a photo though. Okay? So... Yeah.",
  "themes": [],
  "themeIds": [
    "recNFg1tiG3nPWLeD",
    "recP7w3C7uDsO4yke",
    "recdRQGozaPZ0AhfS",
    "recArHp0HmaikItBA",
    "recDiWLiF2HoMuU3X"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}