{
  "id": "rec3oj9t0jfLmKL2R",
  "name": "Celeste Gibbs",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Canberra",
  "videoDraftLink": "https://share.descript.com/view/aLwaWPvxon6",
  "summary": "Celeste Gibbs, a volunteer at Orange Sky, public servant, radio station worker, and international relations graduate student, discusses her work in diplomacy and treaty implementation in a brief interview.",
  "quotes": [
    "recdQt2CsunfHbTaM",
    "recUv8Nmn4Ja2xyjJ",
    "recdjqZ7xR3GPFkTi",
    "recxTbtkMuP4US0Sm"
  ],
  "transcript": "Celeste Gibbs\n===\n\n[00:00:00] \n\nFun. Fun. And I'm gonna cut my hands. Wows, they've got hats. What? Yeah, they're doing the roofs and stuff around here. Okay. And there's a history of asbestos? I think so, yeah. That's scary seeing those things. I know there's something really like visceral around, so people walking on those things, hat smartt suits, you're like, oh, do I need one?\n\nOkay. And cool. So first thing. We do. Is I'm going to get your name. I'm gonna make sure we're still rolling. And this is focused, it's really hard to focus this one, a little tiny screen, and you're like, is that focused or is it not? Cool. So just let me know your name and spell it for me.\n\nIt'll be awesome. Celeste, C-E-L-E-S-T-E Gibbs, GI double BS. Cool. And email or phone? That's either or honestly. Yeah. Cool. CG dot Gibbs. [00:01:00] GI double BS Yep. zero1@gmail.com.\n\nAmazing. I got it.\n\nAll right. Bit old.\n\nTell me a little bit about yourself. First and foremost, who are you? I am a volunteer at Orange Sky. I'm a public servant. I work at a radio station on weekends, and I'm doing my masters in international relations. That's a lot of things in a very short amount of time. That's like the most succinct.\n\nProfiles someone, are you also very as part of your work, do you do things to increase efficiency? No, actually I work in diplomacy and treaty implementation. Wow. We'll have to talk later. [00:02:00] Sounds amazing. Cool. And tell me a little bit more about, I think if you tell me a little bit about, a little bit more about your work.\n\nYeah. Because that might help lead into the next bit of conversation. Yeah. Okay. So I work for the department of industry Science and Resources. Currently that's what it's called. It might be called something different. And this is all done. And I work on the diplomatic relationship between Australia and Timor Lessee.\n\nGreat. I was just talking to someone about these two directions. Alright. So tell me how you first heard about or Skype. So I was doing my undergrad at the time and Covid had just hit, I was studying from home, didn't have a job feeling very classically isolated and I was just walking past the TV and somebody had it on whatever channel and it was an ad showing the different volunteering opportunities you could do to help people.\n\nAnd I figured I don't have any money, but I have a lot of time on my hands. And I'd heard about Orange [00:03:00] Sky previously because of when Nick and Luke won the young Australian of Year award. Yep. So I just signed up, rocked up and have been here nearly five years later. Wow. Yeah. That's awesome. Tell me a little bit more about this idea of what keeps you coming back to Einstein.\n\nFor me, a big part of it is the community aspect. It's. I found myself really passionate about Orange sky for a lot of different reasons. One of the main things that keeps me coming back is our friends and the people I volunteer with it. It is a very big community here. There is a very big community.\n\nYou have individual communities of different ships where we have, friends who come back every week and you get to know them in their lives and their stories and they touch you in a very personal way. And I've also made some lifelong friendships with other volunteers, who I see outside of volunteering.\n\nWe go get lunch. Stuff like that. It's. [00:04:00] It just become a really essential part of my life. I don't, I can't imagine how it would be without it. So Cool. Yeah. What's the impact do you think, on a volunteer in general in, in turning up the orange sky and is there something more than just the way in which you engage or the friends that come, like what's, is there a broader impact you think on volunteers that come to.\n\nBroader impact. That's the main thing you are looking into, isn't it? Yeah, I,\n\nI would say yes. It's a bit like it's a domino effect. It, the butterfly theory, a butterfly flats, it wings in Africa and then suddenly a mountain falls in China or whatever you, it's. It's not that dramatic, but there's definitely, I've seen a very I've seen an impact in how we behave and how that influences our friends and then how our friends treat one another.\n\nWe've had we have two friends at another shift I've go to who have met [00:05:00] and they take care of one another now, right? They do little things to help each other out. One of them buys the other dog food, that sort of thing. I think it also. For a lot of our friends, I've noticed we become a core part of their social institution, their social circle, and a core part of their routine, and that has a really.\n\nNoticeable impact in who they are as people and how now they go and navigate the world. Something that I always find really exciting. Oh, I whacked the microphone. Sorry. I'll do that again. Something that I always find really exciting is so we work this shift here, blue Door is an at-risk housing facility.\n\nSo something I find quite heartening is when our friends are able to. Find permanent accommodation and every single one of them who has got an accommodation, they cite Orange Sky, is one of the reasons they're able to do that because it's given them a sense of place and purpose and has helped them be people again.\n\nCool. Yeah. What is the things [00:06:00] that are there certain elements that you like more about knowing Sky Shift or less? What's the thing that keeps. Coming keeps you coming back and other elements of that are hard and but still keeps you coming back as well.\n\nThe hardest thing, I think\n\nsome of the people we meet, it can be quite confronting because they've had such tough lives and we're ordinary people. We're not. I'm not a mental health specialist, right? So finding an equilibrium and a balance and help in being able to support them for the two and a half hours that we're here, I find can be challenging at times.\n\nThere's a heaps of resources. Orange Sky provides to help, which, and also the fact that we have three people here. We can like work together as a team and support one another. It's challenging if we have to turn people away. Or when there's not enough [00:07:00] time to do all the loads. This shift especially can get quite busy. We've done 13 loads once. We were very dedicated that day. Just because, it's very tough for people to then have to make alternate arrangements at times.\n\nYeah. I think the main thing I love is our friends and the people I volunteer with it. It's a really lovely atmosphere. I think it's a very community heavy atmosphere and yeah, they keep me coming back. I wanna see who, I wanna see how people are doing. That's cool. Yeah. Cool. What's this idea of like your work for the radio station, which is cool, and maybe there's interactions with the public who interact with the radio and what that communication's they, what do you think the power of.\n\nSharing more diverse stories is rather than like the media's very good at showing things that create buzz or hype or fucking whatever. How important is it to try and tell more diverse stories? Oh, diverse. Diverse stories are crucial, right? I think especially because [00:08:00] Australia is such a multicultural country and the fact that so many people have such different experiences in their lives, I think.\n\nThe ability to see yourself reflected in something more mainstream is incredibly powerful because it asserts your sense of self. It yeah. So di diverse stories, I think are crucial in doing that and also in teaching others about other things in the world, right? It's to be. Given the opportunity to learn about somebody different than you, I think is such privilege because it opens your eyes in a very unique way that wouldn't happen otherwise.\n\nAnd I think is very humbling and very heartening. That's cool. And we call this keys to the city. Which means is rambling we didn't talk about that you think is important. Or is there things that like even. Relate to orange sky or friends or something that you've always wanted to say something about?\n\nSomething about orange sky in general. [00:09:00] That's like always been, you've always wanted to put somewhere. Do you I what I, something I really love about orange sky is, so the experience of homelessness is by its nature, very isolating, right? To wind up in a position where you have so little and when you have so little.\n\nSelf-determination and agency that you wind up on the street is inherently an isolating experience and. And we all do it right when you're walking on the street and you see someone doing it tough and you don't wanna look because it's too confronting. So you just keep your head straight and you just zoom, walk past and we all do it.\n\nWhat I find really valuable about Orange Sky is that it gives that dignity and agency back to people who are so often denied that, and it gives back that social experience to people who are so frequently denied that in an environment where there's no judgment, there's no. Issue. Everybody treats people equally and it's just, it's such [00:10:00] a wonderful environment that I'm so proud of being able to contribute to.\n\nAnd that's cool. Yeah. There we go. Amazing. All right. Now we just need a photo. You just stay there? Yeah. Trying a new thing here. Hopefully I can make this work.\n",
  "themes": [],
  "themeIds": [
    "recIMQtwbfmsoZCzz",
    "reciXK8EmpL2XpLti",
    "recPbtsf3ezLZSiNm",
    "recVPhV18rxm9A7IH"
  ],
  "shifts": [
    "recywajtNjhcR4yPO"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}