{
  "id": "rec5Zstosvak6VT9K",
  "name": "Michael Young (Bear)",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "The transcript involves a man named Michael Young sharing his experiences, including his love for a car with adaptive cruise control, his background in commercial agriculture and cooking, his struggles with addiction and loss, and his journey to finding support and companionship at Orange Sky, a community organization that has helped him regain self-worth and make positive decisions. Michael expresses gratitude for the caring and non-judgmental environment at Orange Sky and discusses his goals of finding stable accommodation, improving his health, and continuing to find",
  "quotes": [
    "recEPVgu7j9TFracT",
    "rec1tNAr0RqyFOoKK",
    "recYNNKzS7AaGugLX",
    "recWqC8UMy6GiElk7",
    "recY7CoCIKZWwZmSJ"
  ],
  "transcript": "Give it a go. He said it's got adaptive cruise control, it's you know got all this tech in it and man I fell in love with that car. Well I drove from here to Yungle and back and I only had to put my foot on the accelerator and the brake three times. The rest of the time the tech did all the work, it was fantastic. And it had the speed sign monitoring in it so as we were going up the hill it was taking the 20k bends, the 30k bends without me having to put my feet on the on the pedals. I just sat there and steered it was awesome. Righto brother we're gonna rock on. All we're gonna do you're gonna talk to me. This is gonna be a conversation, if you don't have hands enough with something that's fine I'll cut and edit it so. That's all good. You can even tell me whatever. So what we'll do is start with your name so if you just do your full name and if you can spell it for us that would be amazing. My name is Michael Young, M-I-C-H-A-E-L-Y-O-U-N-G. My nickname is Bear because everywhere I go there are plenty of Mikes, Micks and being a being a little fella, Bear just seemed appropriate. I've had that nickname pretty much most of my life. Tell us a little bit about the Bear story, where do you where do you want to start and have your childhood based family now? Good morning everyone, my name is Michael Young and I was born and raised in New South Wales. I'm her dad. I'm 21 so I don't have an opportunity to talk if I'm doing well or not, it's unfortunate but I did have a family generations background upon you and I'm still very happy to be with you. My dad moved out of Australia to a country called commercial agriculture a couple of years ago in 1916!!! So what's your background up to her fact books for a household. My dad's life started in the short time he slot ladies at home so he thought He actually orchestrated my career at sea, which was interesting, because he brought us up to be very independent. And when I left home, which was my fault, and I freely admit that, he said, if you want to live under my roof, you live under my rules. And I went, fair enough, packed my bag that day and moved out. And got myself a job as a delivery boy in Sydney. This was back in the late 70s. Met a guy at one of the pubs, because I was very tall at 16. Met a guy at the pub, he was the secretary of the seamen union, and he got me a way to sea. I found out 10 years later that Taffy Sweetinson knew my dad. And dad had said to him, oh, listen, my son's up there, can you see what you can do for it? But because of that, I got to travel the world. Best thing that ever happened. And I have, because of the work ethic that my father gave me, I got to go to places that I never would have gone. Because I, the way the registry worked was that the first 50 people got the chance of taking a job or not. And then they'd throw it open to anyone. And then if the job was still vacant, then the first person had to take it. So I was always there to see what jobs were going. When I was on leave, because I hated staying in the one place. And I got to go to amazing places. I was in Berlin when the wall fell. I got to do six months in Antarctica on a research ship because no one knew what the ship was about. And I just put my hand up and said, yeah, I'll take it. Fast forward, wound up leaving the merchant. Wound up as learning how to cook. Did an apprenticeship. I was a chef. I was a chef. I was a chef. I was a chef through a friend of mine who had one of the first Australian restaurants. Indigenous themed restaurants, push foods in Hornsby. Wound up with my own cafe. Did that for six years. Did well out of that. Went to the Gold Coast. Fell in love with it and spent 23 years there. Sold up down south. And then got married. Didn't have a family, but it came. It came with a stepson. Then in 2005, my life changed. I went from having a good career, plenty of money and that, got run over by a concrete truck on a building site, wound up with this nerve damage, made the mistake of suing my employer, got blacklisted from the construction industry because of that because he wants to employ someone who successfully sued his employer. And got addicted to prescription drugs to the point where I was suicidally depressed, pushed my wife away, pushed all my friends away. My dad had a stroke, so my mum asked me to come up and help give her a break. So I did that, but I was still addicted to the prescription meds. And that really messed with my head. When my father died, and he slowly starved himself to death because his dementia said that he could swallow tablets and coffee, but he couldn't eat food, and he'd chew and spit his food. So I watched him slowly waste away over nearly eight years. And when dad died, I just lost the plot. I didn't care anymore. That's how I wound up in the system here. And when I first came to Mackay, I was... I was still a... Not quite a mess, but almost a mess. I tried hiding in the bush for 11 months. And I learned that you can't hide from your demons because they follow you. I got into the hostel system down in Bundaberg, and that helped a lot. But it was when I got here, I got the opportunity to move into a transition house just down the road. And I started coming here to do my washing. And Lisa and the other volunteers here, were always welcoming. They were always someone who would listen to me. And I was able to talk a lot of my demons out of me because of that. Apart from being able to do my washing, it was the companionship. It was the... You know, they helped me get my mental health together to the point where I'm a lot more positive about life. And, you know, I... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... It's... What's the word? The... The... The... The... The... Comraderyship. The... The socialization. Because when I first came here, I was very quiet and... Too much in my head. And... It was through the volunteers here that they... They got me out of my head. And... Once I was out of my head, the demons started... Going. Because all I did was I was in this mental loop... Where I didn't know what I was doing. or where I was going or... Yeah, I thought when my dad died that we'd said everything we needed to say, but I was only kidding myself because that's all I thought about was dad wasting away and what's the point of anything and... Yeah. But that's my story in a nutshell. Mate, you pretty much answered all of my questions in that. Yeah, it's incredible the way in which you were able to explain that journey, like a hero's journey type story. One thing that stood out, I guess, was you said the system. Can you talk a little bit more about what the system feels like to you? Well, I'm talking about the social system. St Vinny's, the hostels, the social workers, who are in the hostels, they helped me to talk all this stuff out. So I was sort of semi-socialised by the time I got to the transition house, which was around in Keats Street, and because it was so close and I... Every time I went to do my washing at the house, it was either raining or someone was using it because I was sharing with a number of people. And then I found Orange Sky. And once I started doing my washing here, everyone was so welcoming that I just wanted to keep coming back. It was awesome because rather than just sitting at where I was living, trying to distract myself with TV or YouTube or... And even my YouTube was just remembering my old life. That is no more. So I was still stuck in that loop of what I've lost, not what my life is. Not what my life could be. And it was through Lisa mainly who kept helping. And yeah, so... Yeah, without Lisa and the other volunteers here, I'd still be stuck in the past. And that was something I just could not get away from. I thought I had it all under control, but looking back at it now, and even though I'm still a YouTube addict and I love my four-wheel drive, so... And all that sort of stuff. It's... It's just entertainment now, whereas before I would remember what I'd lost. Sometimes it's hard to talk about impact with Orange Sky. Like, I guess some people think it's just washing or just conversation. No, no, it's... It's not... It's... Coming to a place where people care. And they genuinely care. They're not doing it because they're paid, which, as much as the social workers at Vinnie's helped, it's their job. Orange Sky are volunteers. They care because they care, not because they're paid to care. And that is a huge difference. Even... It's such a simple thing. As one of the volunteers who comes, she's got a sewing room at home. And... Because I live with clothes until there's... You know, they fall off. I'm a big guy. Finding clothes is always challenging. Some of my boxers and shorts and that were starting to come adrift at the seams. And Vicky took them home, sewed them up for me and brought them back. Now that, to me, was worth more than anything. Yeah. The fact that someone cared enough to do that for me and do it joyously was awesome. Yeah. It made me realise that I'm not alone, that people do care, not just say they care. And that's what this place is all about. They put their caring into action, not just words. It's easy if you've got money to donate to a charity. I used to do it. Did I really care? Eh. It made me feel good. I could say, oh yes, I donate $100 a month to charities. But did I really care? It was just money. When I first started coming here, I valued this so much that I used to help set up. My legs weren't quite as bad as they are now. Yeah. And that's where I am going up and down stairs. My knees are shot now. But I did it because I wanted to give back, to say thank you, and not just in words. And even now, when they set up in the morning, there's always one or two of us that will help with whatever needs to be done, even if it's such a simple thing as carrying the sign out the front for them. And that's what I did. And even now, when they set up in the morning, there's always one or two of us that will help with whatever needs to be done, even if it's such a simple thing as carrying the sign out the front for them. And I'm really, really grateful to them. Yeah. And, yeah, it gives us, it sounds cliché, but it actually gives us dignity here. Whereas everywhere else, if you're poor, homeless, living in housing, you're treated like a second class citizen by most people. They judge you by how you look. Yeah. As somebody with a disability, you realise how uncaring the world is. And mine's physical, not just mental. So, you know, for people who don't have obvious damage, it's a very uncaring world out there. And it's places and organisations like here that make a huge difference to us. You touched a little bit on, I think, the fact that you're not a person who's a person of colour. I think that's a really important thing. I think that's a really important thing. You touched a little bit on, I suppose, these things of isolation and being by yourself. And I guess, you categorised maybe loneliness in there. What's, like, at a macro, broader perspective, what do you think that does to society when people feel that way on scale? And how does Orange State help with that? When you're lonely, you feel forgotten. And when you feel forgotten, you stop caring about yourself, your situation. It's really easy to, you know, fall back on alcohol, drugs, all that sort of, whether it's illegal or prescription, it makes no difference. And it also doesn't help that the medical system is so happy to pump you full of prescription medication, to make you feel better. But they're just doing a job. You know, they, it's when you come to a place like this that you realise that people do actually care about you. They don't judge you. They don't, I'm not even sure what the word for it is, but yeah, it's this lack of judgement. If you fall down, they don't give you a hard time over it. They judge you. They just reach out and say, how can we help? And that gives you a bit of self-worth and slowly brings you back to, you know, how you were before your journey started. You know, I say to people that you're six poor decisions away from winding up here. And it's really easy to make those six decisions when your life isn't going well. And then they compound. And then suddenly you're there going, wow, how did I get here? And yes, there are circumstances, but you know, people have family members who die and they don't fall apart. You know, people have accidents, but their life doesn't fall apart. But it's the combination of one hit after another. And then you start making, once you make that first poor decision, it's really easy to make more poor decisions. And it's through here that they help me start making good decisions because they care. I've only got one more question because you've been so rad, I'm going to run out of time. What's next for you, I guess? And then what impact does the next have? What does Orange Sky have on that next? Like what do you hope is next? Well, that's a hard question to ask. I'm looking for more stable accommodation. That's flat. It's my knees are shot. I'm hoping my knees are going to recover. I've found a molecular supplement that should help. It's just a bit hexy. But again, this is where it comes back to Orange Sky. Because of Orange Sky and the other people who help out here, like Phoenix House with breakfasts and the brekkie van with a sausage and egg. That's allowed me to use what's left of my pension because I lose half my pension in rent and power. What's left, I've been working on debt reduction because I managed to, when I didn't care, I just racked up bills. And rather than going bankrupt, I chose to pay all that off. So I've tapped into all the charity systems in Mackay, which are fantastic, but predominantly here. I'm at the stage where I'm now at the point where I can afford the medication that, well, I don't like to call it medication because technically it's a supplement, but I'll be able to afford to use that, which I'm hoping will help rebuild the cartilage in my knees. And just get me generally better in health. So that's sort of my plan for the next year is to try and get my health together. I'll still come here because this is the one place that I feel safe. I feel wanted. And it's somewhere where if I want to socialise, I can. If I don't want to socialise, I don't have to. And people will be there for me. I'll be friendly or not, depending on how you react to their friendliness. And that's rare because there's nothing worse when you're feeling down than having someone come up all the time going, are you okay? Yeah, they want to fix you. And sometimes you don't need to be fixed. You just need to be able to vent. Because how are you going to work your demons out if someone else is trying to fix you? The only person who can fix you, is you. That's what this place allows me to do. Yeah, apart from being able to do my washing and all the physical stuff. It's having caring people. That's a good way to end it, I reckon. Well done. Alright.",
  "themes": [],
  "themeIds": [
    "rec0lb4IcaqmvWrpe",
    "recgjy3hhXAA8dpP9",
    "recIzSEcjluKaNuIb",
    "recwBb8YP6E5YEAqU",
    "recCYQO6BqaWcEQlh"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}