{
  "id": "rec7Uv5b8WQq0WbMM",
  "name": "Suzanne Evans",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Newcastle",
  "videoDraftLink": null,
  "summary": "Suzanne volunteers at the Christchurch Cathedral's Horbury Hunt Hall, where they feed the homeless and underprivileged fortnightly. The initiative has been running for 40 years and is supported by volunteers and donations. Students from the grammar school also participate in serving meals. The program serves 60-93 people, focusing on providing not just food, but a social activity for those in need. They also offer emergency housing assistance and refer individuals to support services when needed.",
  "quotes": [
    "rec4fyi1SzHICYEoD",
    "recgqSsWRqulbBZyN",
    "recNT50U8wAW3eiX5",
    "recbUtXF1tzVcmfQ6",
    "recZzA6cPUwxHMaLA"
  ],
  "transcript": "Okay. Tell me your name first then. Suzanne. Suzanne, awesome. How do you spell Suzanne? S-U-Z-A-N-E. The French. Tell us where we are, where are we? We're at Christchurch Cathedral and it's the Horbury Hunt Hall on the Grammar School site. What do you get up to here? We feed the homeless and the underprivileged fortnightly. Wow. How long have you been doing this for? Well, Andrew's been doing it for about 16 years and I'd have been about 10. Why do you do it? What's the reason for you to do it? Well, there's a need, right? But it's also a very rewarding job too because you see the pleasure on their face when they come. And not only, of course, are we giving them the food, but it's also providing a social activity for them too that they can get together. Which, of course, during COVID unfortunately couldn't happen because we had to leave them outside and feed them, you know, hand them takeaway through the door. What are some of the normal sort of characters you get here? Can you tell me about some of the people that come? Well, as I said, there's the homeless and some of them actually sleep in the doorways of the cathedral overnight. We also have people... We have people that are impoverished. They might have... We have young families that have been put out of work. And we also have some people that are lonely and so they come along, you know, so that there's somebody here that they can communicate with. And also we do have some that have been released from jail and rehabilitation from drugs, et cetera. So it sort of covers a whole lot. Do you... Do you sort of think your upbringing or the work you did during your life like helped you to want to do this kind of work now? Or why do you want to do this work now, I guess, from your... Well, I came... Right. Both my grandparents were priests and I sort of grew up knowing that people came, you know, to the churches to be looked after and when they were in need. So there was that background plus the fact that I was also educated. I was educated here at the grammar school and the grammar school are part of this because students come along and they actually serve the meals and do the washing up, et cetera. What's it like being able to help kids sort of experience this kind of stuff? Like, what do you think? Why is that important? It's very important to be with the young people because, number one, it's a learning experience because some of them wouldn't realise that people aren't as fortunate as they are. And secondly, they're the future carers. So we have a learning sky out here. What do you reckon about that service? Oh, it's invaluable because it's giving them the dignity that they can actually, you know, have clean clothes, et cetera. Do you... What do you think about the opportunity to partner, I guess, because you're growing food or it's going to... Washing, why do you think that's important for the whole ecosystem and, like, support? Well... Well... Well... Well, it's showing them that people are caring for them and are concerned about their needs, all their needs. And, of course, what happens, as I'm sure you know, that they actually have the meal while their laundry's being done. Yeah, pretty cool. Yeah, it's wonderful. What keeps you going? How do you come back here? What's, like... Well, as I said, from a... from a selfish point of view, it's a very rewarding experience, which you'll see when they start arriving. And how long... Sorry, I've got to stop talking. How long has this been going on for? Oh, well, we're... This is our 40th year. No way. How does this continue to be supported? Is it through the church? Well, yes. Everything's completely voluntary and we have people on the roster. Now, some of them, for example, are on dessert, so they turned up... the cheesecakes. And some were on the roast part, so they might have had chicken or beef or lamb. And so it's all done that way. It actually doesn't cost the parish anything. How many people do you get in the farm on average? Well, we go from 60 up to 93. And how often is one to eight? Four times a day. And twice a year. Yeah. Well, the first one is that the grammar school... is the one that hosts the tournament of the mind. And they have students coming from all over the place. So we... The preparation's done here. The washing up's done here. But then the students carry the meals across the road and we feed them in the cathedral. And we do the same for Christmas, for their Christmas lunch. Yeah. And, like, people who come here obviously have a lot of needs. They need housing, they need... and all these things. Well... What part do you think... are in this stage of learning? Well, with the housing, you see, we can't ask anybody any questions because of the privacy. But we pick it up from if they start talking to us. And the associate priest of the cathedral, he comes over and has lunch with them, sits at a different table. So we can pick up if they're in trouble that way. But we have a book in our pantry that's actually for the emergency room. So if somebody's out on the street and homeless and needs somewhere to go, well, we can look it up and also refer them to the Samaritans for... if they need cash for something. And coupons for food. Well, this is wicked. I really love this. Thanks for yarning.",
  "themes": [],
  "themeIds": [
    "recdS09Xr4aHZFN2f",
    "recSqhs4VstG8FeOq",
    "recJTf6wu2x9karJy",
    "recT8L3I5F7p7AZgt",
    "recZqs4TS7D9zzzYD"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}