{
  "id": "rec9EUNs7oyXh0YlH",
  "name": "Marilyn Laner",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Gladstone",
  "videoDraftLink": "https://share.descript.com/view/qWnljdFVq2v",
  "summary": "Marilyn Laner talks about her involvement in her community, particularly in assisting the less fortunate through various services. She emphasizes the importance of human connection and friendliness. She expresses her love for life and people, describing herself as someone who collects people like stamps.",
  "quotes": [
    "recP2kLjdVfEnlE5S",
    "recfgGlUtTobc2H5D",
    "reclfljDvYnh7Ttjz",
    "recUSyRtxFYTOC301",
    "recB9YVgtlRsrFnci",
    "recjBddQvv3tQMA71"
  ],
  "transcript": "# Marilyn Laner\n\n[00:00:00] \n\n**Speaker:** Okay, I'm all ready. Yes. So all you need to do really is just your full name and then spell it, and you just have to talk to me. Don't worry about this thing. This is just like little pretend thing that's doing the stuff, but we're just having a yarn. Yeah. So your full name and then spell it for me.\n\n**Speaker 2:** Okay. My name is Marilyn Lanner, M-A-R-I-L-Y-N-L-A-N-E-R. I come down here every Wednesday morning when I can mostly because it's in, within my community. We live in Kora. We've been here 40 years, but it's for the people and less fortunate that me, some of them. But wonderful facilities having the orange sky to, to wash their clothes while they're having them washed.\n\nThey can pop down there and the Salvation Army will make them a hamburger, a drink, but it's to people to talk to each other, and that's what we need. We can go shopping [00:01:00] and get our groceries and go on home. We can go and pay our bills. Pass the money over and somebody mightn't even say Good morning to you.\n\nSo I really think we need to be more friendly. It's a beautiful city, and to come down here just to start the day is wonderful. I think. So cold morning lights is, morning is surprising the amount of people that are here. \n\n**Speaker:** Yep. And tell us a little about yourself first. Oh, \n\n**Speaker 2:** that's, that could be a long story.\n\nI love life. I love people. I often say I collect people, like I collect stamps. I'm a Bush girl. We come from the Boyan Valley. I had hardworking parents and we suffered misfortune. We, I've lost two brothers in life. But no, we had wonderful parents. Opportunities weren't as opened [00:02:00] and available as what they are today.\n\nNo, I. Experiences of life is my education. It's not so much of what I've done. I love working with people. Voluntary. I've volunteered most of my life, but yes I love people and I guess I do talk a lot, partly because my mum was deaf and I married an Italian, so I had to repeat things twice for my mum, always speak to my face, and then when I married.\n\nMy husband he found it hard to be accepted for a start, but to talk with him, yes, I, and then I worked with children and daycare centers and childcare centers for 18 years. Then my last 10 years I've volunteered at The Aged Care 'cause my mum was a patient. Yes, I've experienced life all levels, but I love it.\n\nI [00:03:00] love life. It's not what who I am, it's what I can give. \n\n**Speaker:** Yes. And you've, had the ability to use the service yourself for different, in different types of capacities? \n\n**Speaker 2:** Here I love the orange sky because anything that at the moment anything that I am decluttering because I'm having a house renovation at my place.\n\nGood opportunity to get rid things. So I bring 'em down here and have 'em washed up, and then I'll give 'em away. And when you get old in life, you don't need all these things. You really don't. Yes, like this morning I've come down early and normally I wouldn't, but I've come down early because I had some blankets to wash and I'm cold at my place and there's people less fortunate that could use my blankets.\n\nSo they'll wash 'em up and I leave them here and somebody needs a blanket, I'll take them home. Same with towels and things like that. So orange sky is very important to me. And even a friend this morning, she didn't she did know about it, but [00:04:00] she just didn't feel that she should have been using it.\n\nAnd she said, I need to have my sheets washed and dried and I won't be home. And I said drop 'em off by the time you do something, come back and collect them. And that's what it's all about. Yeah. But as I said, you can see. We're all sitting in the cold over there, whereas I would be sitting in the sun.\n\n**Speaker:** Tell us tell us a bit about what you feel the role of the volunteer is and how that, how the volunteers like feel. \n\n**Speaker 2:** Oh, the volunteering with Salvation Army is just a one they just push the buttons. They had a lovely big volunteering day for the Salvos here on Sunday. It was a fantastic day.\n\nThey supplied food and drink and it was, but sadly it, the locals don't come, they go elsewhere. But it was lovely. The people, they had an an ethnic group and I just said to the girls, 'cause those that [00:05:00] didn't come I just said to them, we rocked up. And I said, we always say hello to everybody.\n\nAnd I said, and these young couple came in and they'd only been in G Gladston two days. They come up from Melbourne and they needed to know Gladston a little bit more. So the first thing you say to them, we'll take you down and have a sausage sizzle down here with the salvos and a drink. And then you can sit and talk.\n\nBut people are friendly. People are friendly. They don't wanna talk to you. They have other problems, don't they? Yep. \n\n**Speaker:** And this idea like orange sky has volunteers rather than workers. And what do you think that changes in terms of the ability to connect? \n\n**Speaker 2:** A lot of people don't volunteer because of time factors.\n\nAnd a lot of them can't volunteers because they need to be paid for what they do. And I'd experienced that myself. I worked in a school and you volunteered, you start off in a tuck shop because [00:06:00] your own children are at school, and then you go to sporting fields and you volunteering, cutting up the oranges or washing the shirts.\n\nAnd then. Not only that, volunteering is part of life, but it's getting less and less because people need money. You need, and they need to be paid for their work. They haven't got the time to do it, and they can't give it. And that's so sad. And not only that, rules and regulations, people don't trust people like they used to.\n\nTo say at the moment, we've got builders in my house and for us to come down here, we've had to trust them to be in my house while we are down here. That's, you must trust people. And even volunteering, to say there's every opportunity for a person to volunteer, but you've gotta say. Why am I volunteering?\n\nHey. Why are you doing it? It's to help somebody [00:07:00] else. It's not that you can have the pick of everything in the shop because you are there. No, you help somebody else. Yeah. It's a purpose. Yes. \n\n**Speaker:** And are sky like they talk about impact and there's impact in getting your clothes washed, but there's also impact in having connections and conversations.\n\nYes. What balance do you think that plays in Orange Fire's Mission? \n\n**Speaker 2:** These girls here, sometimes there's some guys here too, and that's very encouraging to see men helping with the laundry. 'cause it's heavy job. They've gotta get up and down into that van too. But it's to encourage people to come.\n\nLess fortunate people, because some of us don't have washing machines. We don't, and wash by hand. And water's expensive too. But for these people, they make it that they learn to come down here each week, talk to the people, have a cup of coffee. It's just a place, and you do it. You commit yourself to do it.\n\nYou might think [00:08:00] this morning, so cold, stop at home, but to come down here and talk to somebody else, they're all so cold too. Yes, no, and as I said this morning, there's. The regulars, but then if somebody's new, then you make them feel warm too by talking to them. Yeah, that's what it's about.\n\nVolunteering. It's just something I love, to say it's just something you get to know people, interesting people listen to their stories, what they can do. Some people can't read and write, but hey, they're good workers. They're good cooks, they're good sewers. You find things out from other people, you don't have to ask.\n\nYou can, they're gifted. They're gifted. \n\n**Speaker:** And why do you think some of the people come to use Orange Sky from the region? Like, why do you think they personally make the decision to come and get their clothes washed? And \n\n**Speaker 2:** I don't really know. The people that you'd have to ask the sky.\n\nPeople that probably know more about why people come. I encourage them to come, especially it's time [00:09:00] saving. I don't know if everybody believes that washing isn't a job, washing is a job, and not any of that to be cleaned and tidy. It makes you feel good too. And, but then to know that they're doing it for you and you respect them.\n\nAnd that's what volunteers need. They need to be respected. They're not working for you, they're volunteering for you, and that's something you've gotta pull apart. Some people. When they're working, they take it as a job, but then they get it into their mind that if I'm doing this for nothing, why aren't I doing it for money?\n\nSo it's a very big thing that people should analyze themselves. I'd say give with your heart, not always your head. And that's something, it's not what money can buy. It's what you can do. And you can, you don't have to have everything to come down here this morning [00:10:00] and just to have somebody talk to you and have a cup of coffee and, no, I think it's special.\n\nYes, I've never had to go out and live like some of these people, so I've been fortunate enough to, as I said. I dunno what it is. It's just that it's just I walk amongst people and I try to help them. That's what's back. \n\n**Speaker:** So cool. Okay, I'm gonna take a photo. \n\n**Speaker 2:** Oh dear me.\n",
  "themes": [],
  "themeIds": [
    "recJffCSFmujG0mww",
    "rec9nZxKCIvziGczz",
    "recMdRcE3MtqQeixl",
    "recmuD02SxMHYSLRP"
  ],
  "shifts": [
    "recztH9xwFE3kdcK4"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}