{
  "id": "rec9jNhaxgLd8Op2r",
  "name": "Chris",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "The transcript is a recount of Chris's life story, starting from his roots in New Zealand to his journey to Australia, struggles on the DSP pension due to health issues, his views on society and politics, appreciation for community services like Orange Sky, and the importance of companionship and human interaction. Chris reflects on facing health challenges and desires to return to his motherland if Australia becomes a republic.",
  "quotes": [
    "recA8Eszv4mlgERIi",
    "rec8YwG1YkpxWLepa",
    "recs67TAg9HrpOUuI",
    "recZbUvDtxCTm1ZNe",
    "recHqv3H179XtVoOK"
  ],
  "transcript": "I wanted to be an actor in school in Wellington. Oh. I wanted to be an actor like Russell Crowe when I was younger. Maybe you still can. Huh? Still can. Nah, nah. Everyone wants to be frickin' Sonny Bill Williams. Alright brother, tell me your name and spell it for me first. Chris, C-H-R-I-S. Cool. Oh, Chris. What's the Chris story? Tell me in a few words what the Chris story's about. I was born in Nelson in New Zealand. I come over here in 1981. Cool. January 1981. They wrote a song about me. I was only 19. I come over here just... to teach Aussies how to work properly. And... because you can go so far in New Zealand and... and the rest of the family come over here in October, November. Me and my sister come over in January after being in the Sea Scouts and... went to a national jamboree and regatta and... and... Hastings and Napier in the South... North Island of New Zealand. We got back down to Nelson. Then we went from Nelson down to Christchurch. Christ... I went back to Nelson, stayed with my uncle there. Then caught the plane down to Christchurch. And... on the 24th of January... 1981. QF 85. Qantas flight 85 from... Christchurch. We left for our grand adventures of... going to Australia. Got off... I said, is this fucking Australia? I said, oh... I said... we were living on the Sunshine Coast. And... my first kangaroo was up at... Bribey Island. The first kangaroo I seen in Australia was a fucking dead one. It was a bit of road cool. And... and... ah... I... I... was built... worked on high rises, buildings. When I went to Sunshine Coast... there was two high rises at... Eredris. Ah... Aerodrome Road. Bound Neander on one side of the road. Trafalgar on the other. All 15, 20 storey buildings. Before that... we'd been here a week. Mum said, oh we're going... we can go to Gingin and pick... ginger. I said, can we? Well here's me, only been in Australia... about a week. In the freaking Queensland hot sun after being... in one of New Zealand's coldest winters... pulling ginger. I said, Mum... you can stick your fucking ginger up your ass. I said, I'm not freaking... I said, I'm... I'm finding a decent job. That's when I went... That's when I went on the high rises and building and... Yeah. Then I... had enough of the Sunshine Coast, went down to Brisbane. Stayed with my auntie down there. Got a job down in Brisbane. Rode a little... 175 bike from... Sunshine Coast down to Brisbane. Rather than single carriageway each way. I'd hit the freaking forestry and freaking... Beewah there and freaking... Lansborough and come out and freaking... Then... Yeah. I didn't want to freaking... get... I didn't want to... I didn't want to freaking... take the traffic on a 175... trail bike, eh? But nah. Then went down to Brisbane. Up and down the Queensland coast, chasing work. Like you do when you're in the building trade. And on the way down there... I... Christopher chased and bezeled all my money in Quintex... when they built that... Sheridan Mirage Grand Prix... Sheridan Mirage Resort at Port Douglas. Then I... left there in 1988. Went down to Brisbane. That's when they had Expo 88. I was working down there and... worked a few different places like... Mako Kitchens at Virginia and... yeah, that's when I was pretty young... a bit younger. And... What about now? What's going on now? I'm a DSP pensioner and freaking just a worn out unit. Just trying to enjoy life. I'm up here... catching up with my son... who didn't really know his father... because his mother was a... the local push bike. And... now he knows me as his father. It's good. And... I'm... got diabetes and freaking chronic asthma. Chronic asthma, freaking... bone on bone knees... and freaking... osteo-rematurator arthritis right throughout my body. I started work when I was 14, 15. My body's just... worn out. I've been on the DSP pension since... 2010... 2015. And... waiting... Does it make it tough to live and to get by or...? Oh, it is, eh? Well, I've taken a few pictures for Chris Picton... our local member for Karrawarra... in South Australia... to show him... that... how to cure the freaking... youth crime rate... is don't give them a freaking skate park... that they freaking throw rubbish in. And... I've taken a couple of photos. I'm gonna... put them all together in a book. And... put it on his desk and say, hey... this is what you should do. Because five prime ministers... have come from my hometown in New Zealand... Nelson, top of the South Island. And... little Johnny Howard had to go over there... to see how the GST run... and the... daylight savings. He couldn't work it out for himself. And what's tough for you? You reckon, like, people like you... who are trying to live on the pension? No. Um... I... I would... want... I want to get back... to country. I've got a girlfriend that's... a bit younger than me. And... she works with indigenous. I'm... I'm... I'm an Australasian. I don't think you should become Australian. It's just... revenue munching. Which is... when you're Australian... Kiwi coming over here... that's just... that's part of BANZAC. Australian New Zealand Army Corps. And all that. You shouldn't have... you shouldn't have to... become... Australian. But alright. Now... now I've got Australian children... I thought... oh yeah... you don't lose anything. You... it's only stamped... I'm Australian on your head. But... at least I can speak English. I know... I know that... I know that... I know that... I know that... I know that... I know that... I know that... I know that... I know that... I know that... how to speak English... and I know the... constitution of... Australian government... not like... the Asians... or the... ah... Indians... ah... when... when... Australia becomes a republic... that's when I'll be... get me boat... and start paddling back to New Zealand. Eh? Because I don't want to live in the republic... with... ah... Asians... and... and... and... and... and... and... and... and... Brett Lawrence at Western... did you say Wolves of Australia...ster rapid lost four years? MOSES got... got... GOT... GOT... GOT... GOT... GOT... GOT... GOT... GOT... GOT... GOT... GOT... GOT... I had some washing to do the other day so I thought I'll come and do my washing. But down south they've got the portable vans that go round all the different day centres and all that sort of thing. And what do you think about Orange Sky? What do you think about the service? Nah, it's a good service. Well those blokes aren't worrying about their next feed now. They're alright. They're all round Australia, they haven't even gone across the ditch to New Zealand. And what do you think, how is it useful for people that come? Nah, it's good. They've got a story to tell. They're telling the story of their life and why they're in this situation. Because the rich are getting richer and the poor are getting poorer and there's no middle class anymore. And why do you think having people to talk to is important? Nah, because if you don't talk to anyone, it's a lonely life. If you can't have a joke and a laugh in life, you're a pretty morbid sort of person. And you don't have to believe everything on a phone. Who's Google? Has Google got mates? He's got relatives. He's got Instagram and fricking Facebook. Yeah, Fetch and fricking all that. And why do you think people come to Orange Sky to do the service? Ah, for a bit of community interaction and just friendship. Friendship and companionship and a life of friendship. And you know, I guess, it's a bit of, well, I don't know, I don't know what to say. I don't know what to say. I don't know how to say it. I don't know how to say it. But, it's pretty good. I think it's a good thing. I think it's a good thing. I think it's a good thing. It's a good thing. It's a good thing. It's a good thing. A lot of people are lonely. Some people are lonely. They live by themself. And they use it as service to meet people or congregate with the rest of the world, yeah. That's cool. And what's, why do you think that's needed in the broader Australian society? I think... They put it into a reason. Because, we were all born with silver spoons in our mouth. And that's one of... And the politicians only lie on their own nest. And they give themselves pay rises. And they give us a pay rise. Then they knock it off with another bill. And they say, oh, we'll give you this and we'll give you this and we'll give you this. But no, wait, we'll take this off you and this off you and something else off you. Yeah, yeah. That's awesome. Yeah. I'm just going to take a quick photo now. Is that all right? No, it's all right.",
  "themes": [],
  "themeIds": [
    "recNROZkWNejw8gJZ",
    "recT55norS4WV5GS8",
    "rec5SmrxbE8EUTRuK",
    "recAU5MKpRo15cAf0",
    "recRC1wC285X9xUHq"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}