{
  "id": "recaaM5Z3U82OjCpM",
  "name": "Lisa J",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "Ben, the service leader for Orange Sky in Mackay, describes their two pods - the first ever pod in Serena and the second one in Mackay. The pod is a fixed location with washing machines and dryers where they assist people experiencing homelessness. Ben emphasizes the importance of connecting with individuals during their shifts and highlights the positive impact of volunteers engaging with the community. He encourages potential volunteers to join and emphasizes that volunteers of all ages and backgrounds can contribute and benefit from the experience.",
  "quotes": [
    "reczGNUJc3zqKuako",
    "recIQdJK1pq2uSdNA",
    "recQZOvliWipKhIm8",
    "recEX7PwtKztjLXWK",
    "recLhHvDPvN5g4pbE"
  ],
  "transcript": "I'll just ask some questions like an interviewer. Yeah. G'day, Lisa. Hi Ben, how you going? Thanks for taking the time to come to Mackay too. We don't get too many visitors from head office. So this is a video for like, for Brisbane and people just around what the pod is. So give us a little description about what you do, I guess, your role. So my role here, I'm the service leader for Mackay and that includes the two pods we've got. So we've got the first ever pod that Orange Sky put in the world, we like to say. And that's Donny down in Serena. And the second one we have is Jellybean here at Mackay. So I'm always keen to point out that Serena was first. They think that they're our poor second relations type thing, but they are the world leaders when it comes to pods for Orange Sky. Amazing. Tell us a little bit about, I guess, let's go over to the pod and you can sort of walk through a little bit how it works and how we do stuff. Okay, come along. Well, five years ago, we laid this grass. I haven't seen it. All right, we'll move through here. Okay, so this is our pod. What we've got here is washing machines. We'll have three of them down the bottom and we've got dryers. So they're all plumbed in, ready to go. As I say, just like in any other service where our friends come along and they just need to shake out their washing, load the machines. We have our detergent over here. As I said, same as any other normal service for Orange Sky. And so the only thing different is we're permanently here. We're not the van that moves to locations. It's about being fixed in the one location. And what's set up? What does the set up look like for you? So our set up is that we'll come in and bring out our awning. We'll also put out some marquees for shade because up here in the tropics, it's either wet or it's hot and there isn't too much in between. And you'll find even on a late March day like we're here now, with that breeze around, it's pretty hot and humid. So come summertime, we'll actually put backing panels on the marquees to give it a little bit more shade. But at the moment, things have cooled a little to what we've had and they're fine without it. So it certainly makes us loud and proud and visible. And that's probably one of the key things that works for us is that people know we're here and where to find us. How would you describe your role in creating the Orange Sky shifts and like the occasion for them? So as service leader, I think I've probably got one of the best roles that I get to engage not with all the shifts but also with the service providers and the community we have in Mackay. And Mackay is such a giving and caring community. There's a lot of talks I go out to to actually talk about Orange Sky. And it's always pleasing to know that people know about us, not everyone. And they're very generous in their support to come back and the positive feedback we get. And a lot of that is because people are driving past and they'll see us and they'll know, hey, I saw you there. A lot of people know about us. We've got a lot of people here. It looks really good. It looks really vibrant. And we do have a vibrant sessions when people are here. And there's these chairs here that you have conversations in. What's the importance of, I guess, sitting around and having a go at this shift? Look, the chairs are the big thing about our shifts. We all say that, you know, laundry is good for the hygiene. Our service providers bring the food, which is good for people's sustenance. And some of our shifts, they really need it, like on the Monday mornings. But it's that time in between when people get the chance to talk. And that you understand more about that person. And, you know, it just humanises people. But there's also things that we can do to help, that we have support service available, like our partnership here with Vinnie's. You know, it's easy to say, let's go down. Vinnie's will be open at 9 o'clock. What they can do to help you there. And we've got other agencies around. So just having that conversation. And for a lot of our friends, sometimes it's the only conversation that they've had. I've had examples where I've met someone here on Wednesday morning and been speaking to them. I've gone to another volunteering role on Thursday afternoon and saw them down there and had a chat here. Hi, how are you going? And I was really taken aback to say, well, you're the only person that I've spoken to in that whole time. And that was a day, day and a half. And no one had spoken to that person. And they're well known in town. They're not a newcomer or a transient. So I think that just highlights the importance of what we do and why those chairs are there. And that connection. And what would you say if someone's thinking about volunteering and got on the fence a bit? Hey, come down and give it a try. There's no problems coming down, having a look, having a talk to the volunteers. Not just talking to me. I think you talk to any of our volunteers. And we've got a wide range, from uni students right through to 80-year-olds. We actually have our fourth oldest volunteer on the shift here today who proudly claims to be the fourth oldest. So it caters for all types. We have people that work, people with families, people that are single, retirees. There's something there for everybody. And it's also about that connection. I think every one of our volunteers gets something out of it. As much as you think it's a giving role, they'll all walk away with a big smile on their face and think, Hey, that was a good shift. I didn't realise I'd get so much out of it that I do.",
  "themes": [],
  "themeIds": [
    "recuEyBWkcxvir4TD",
    "recQepFUSd1257t1U",
    "recLeW6kG4dkGDl3w",
    "rec3w0lTqkdwO5zsa",
    "reciNjeLqtuLkGxnp"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}