{
  "id": "recBbeLsIPdI99ZON",
  "name": "Siobhan Leyne",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Canberra",
  "videoDraftLink": "https://share.descript.com/view/nOevaLeMhBw",
  "summary": "Siobhan Leyne talks about filling out information, including her name and contact details, and mentions starting her story from the beginning.",
  "quotes": [
    "recARuMaGcc8C7mpp",
    "recefI4Qi9B7W7OK1",
    "recCTSKio8yQknS9N",
    "recqxTSbvBQIJXICG",
    "recYoQd7f61qcwjI5",
    "rec5FqN7hzGmM0lbw"
  ],
  "transcript": "Siobhan Leyne-\n===\n\n[00:00:00] \n\nI'm gonna clap if that was loud enough. Cool. So all you need to do is actually I'm gonna do this as well because I always forget I built this app just for this reason. Oh, wow. Forget to use, okay. Yeah, sure. That's not a useful app then if you don't use it. Yeah. It's not useful. You don't use it.\n\nYeah. That's the first rule. Okay. So you just need to tell me your full name and then spell it out for me. Yep. So Sivan Lane, S-I-O-B-H-A-N. Sorry, one more time. I just totally didn't get that. Yeah. SSIO. Yep. BHAN. Yep. Yep. My surname is L-E-Y-N-E-L-E-Y? Yeah. NE. Amazing. And would you prefer email or phone number to send stuff through?\n\nEmail's fine. Which is sivan Fair. So SIO. B-H-A-N-F-A-I-R-E-S-A-I-R-E-F-F for Fred. Okay. F-A-I-R-E. Yep. A IRE. Yep. At [00:01:00] gmail.com.\n\nWicked. And do this.\n\nAnd\n\nCharlie forgot to change it this morning. I was like, I had this one thing I need to change and I didn't. Ah, yeah. Look, they're on it. I can hear the machine. I'm so tuned in to listening to the machine. That's all part of the story. Yeah. And we are at the early morning shift. No, this is into the village.\n\nBlue door. Blue door. Blue door shift. Yeah.\n\nCool. Let's start off with a little bit of this sh vo. Is that right? Yeah. Story. What's the shavonne story? A little bit of it. Oh. Where do you want me to start? Start from the very beginning. You don't go away. Hours. Hours. Yeah. Whenever you want. I guess I quit my job in [00:02:00] 2021 and was looking for some stuff to do around camera because, got tired of my job, which is why I quit it. My partner retired, so it was a great opportunity to change life. So we now spend a lot of time on creative projects at home and dogs and craft and art and all the rest of it. And this is a volunteer thing. We do Orange sky, which I like because it's contained to one thing and it's one good thing.\n\nSo good. Yeah. Where did you first hear about Orange Sky? Like when's it first pop up? I was just Googling for volunteer opportunities in Canberra and there were a lot, which were, took a lot more commitment than this. We all want you to commit for four days a week, three hours a day. It was like, I don't want to do that 'cause I wanna be living my life at the same time.\n\nSo this just felt like a really nice commitment to. I knew what I was doing and it's what I always say about orange sky. I like that I come for two hours, once a fortnight and once a week, and I know what I'm doing in those two hours. So I think I just Google it and it came up that way and it suited me, like I'm [00:03:00] really attuned, obviously, to the washing machines.\n\nAs soon as they go off, I'm ready to jump up and do the washing.\n\nWhat is it that keeps, so you've passed on what's your connection to it and that sort of stuff? What keeps you coming back? I like the friends. We have really good conversations and we see the same group because Canberra is so small, I've been on a number of different shifts. So you end up seeing the same people that from shift to shift and even when you are not seeing the same people or you've got shifts like this without any friends turning up 'cause it's cold and wet.\n\nI like that I'm doing something really practical for someone and it, there's a very basic dignity in providing someone with clean clothes. And we've had some volunteers on other shifts who, it wasn't enough for them. They wanted to do more, they wanted to fix more. They wanted to get in and do stuff.\n\nAnd it's I can really respect the basic dignity of clothes and clean clothes and how good that makes someone feel. So that's what makes me keep coming back at, I find it personally very satisfying just to do a really [00:04:00] basic thing for someone. Why do you think the friends keep coming back? I think they like us as a captive audience for sure.\n\nSo one of the friends you just met as you were setting up, he just likes having a captive audience to talk to. And I think and he is interesting and we engage with him and he knows all of the Orange Sky volunteers across Canberra. But I also think people don't talk to him much in life. And so we are a regular people who talk to him and know about his life and ask him questions.\n\nAnd so I think that's, and that's rewarding for him anyway. Yeah. Yeah. Is there things that you have learned along your time at Orange Sky that you maybe didn't know before or other things that have changed in your perceptions of things or I think that it's just made me really aware to stay humble with my own life.\n\nLike I know I'm in a privileged position to be not working full-time at the moment and enjoying what I enjoy in my life and my safe and secure housing. And it's just normal here. Yeah. And it just makes me really aware to [00:05:00] just be grateful for things. And we had a shift earlier this summer. It was so hot.\n\nIt was like 36 degrees and we're all complaining about sweating. And then one of the friends came saying that the storm, the night before the lightning had hit the footpath beside him. He was sleeping rough. He didn't like to be indoors. And we thought, no, we'll just stop complaining about our problems with the heat.\n\nRight now, actually, and it's funny, Ainsley Village, I used to work 20 years ago, I worked for a drug needle service. So we used to exchange clean fits and we would not come here 'cause it was too dangerous. So the fact that orange sky can now be here is a real change in Canberra and the environment and.\n\nAnd I really like seeing that. I like that there's safe places. This has now become a safe place for people where it's not a safe place for people. 20 years ago when I was working that job, so Wow. It's good. So it's nice. It's just nice to see the other side of Canberra, which is incredibly privileged.\n\nPeople have a lot of money here. Every time I go to do like a pottery class and I can't afford it, [00:06:00] I just think canberrans have far too much money. So I like seeing the diversity of Canberra. Yeah. What are those conversations you have with more socially, with friends, family or broader public around what you do?\n\nIs there ways in which do you change the way you talk about stuff depending on who you're talking to? Or do people have different perceptions of it, or how's that for you? I don't think I change depending on what people are, who people are. I'm pretty open and upfront, but I do make sure I talk about.\n\nThe volunteer work we do and some of the stories we get from friends, because I do recognize that Canberra ands have a lot of money and they're very privileged and a lot of my friends are now either senior public servants or retiring public servants, and they are so wealthy and they do not see the side of Canberra where people are not as wealthy as them, or they're having to use food services or laundry services or access the parts of life that wealthy Canberrans don't know exist.\n\nSo I like to share some of [00:07:00] the stories we get from people and some of some of the guys who come here have such interesting lives and they've lived all over the country and they've done such interesting things and they've found themselves in a position where they no longer have secure housing or they no longer have the supportive family and friends.\n\nAnd I do find that important to share with people so they don't just keep living in that Canberra. Privileged environment. And friends of mine have come to volunteer here or they make donations 'cause that's all they want to do. And I don't insist on that with people, but I just, I think it's nice for people to stay aware of what's happening in Canberra.\n\nWhat are like the practical things that you appreciate around or don't appreciate around, like when you, like Orangeburg's quite a big organization. Yeah. Are there things that easy, difficult because of that or have you seen a change? Does it grow or what's that like for you? I, as it's grown, I think it's a bit more data focused.\n\nSo I find the volunteer check in checkout quite frustrating and it's like I, [00:08:00] when you've got 12 loads of washing lined up, you're not actually thinking about that sort of thing. And I know that's a priority for the organization and I know. From auditing and all of that, it's important, but also it's oh crap, I got to sign in.\n\nDamn it. But the thing I really like about Orange Sky is that there are rules around what we can and can't do. And there, there is a structure and I never feel pressured to do more. I volunteered for organizations where it's six months later I'm exhausted and I do not wanna volunteer again. Yeah.\n\nBecause I know personally I have a hard time saying no, which is I think common amongst people who volunteer for any kind of organization. So I like that there is structure with it, and I think that's something Orange Sky should keep. They don't impose too much of their volunteers. They never ask too much.\n\nLike I know there are some vacant positions at the moment in the senior positions within Canberra, and there is no pressure to apply for those. I really like that. Because it just means I can come and do my thing, and I [00:09:00] find that satisfying, like I get a lot more outta the organization than they do out of me coming and doing the washing, just in terms of personally find it rewarding.\n\nSo yeah, it is just the focus on facts and figures, but that's every organization, and I know it's important for funding and my little public service heart appreciates it. But yeah, I always forget to do it too. Awesome. Yeah, that's practical, like feedback and yeah, super appreciated. Appreciated. Yeah, for sure.\n\nCool. Is there anything we didn't get to that you would talk about? I don't think so. I don't think I have, I like just heading up and doing the washing and going home, so I don't think there's a huge story there. It is just what it is. The whole picture of it was amazing. Yeah. Good. All right.\n\nI'm gonna take a photo.\n",
  "themes": [],
  "themeIds": [
    "recFoNBZkdpTw1V6w",
    "recGGmuFErRear8Xa",
    "recDbv5YyOcnHmor8",
    "recvKgDZkRAvJBWIE"
  ],
  "shifts": [
    "recywajtNjhcR4yPO"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}