{
  "id": "recBwSKNbFfFCynZO",
  "name": "Daniel O'neill",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Canberra",
  "videoDraftLink": "https://share.descript.com/view/GD4cBQjRTnM",
  "summary": "Summary: The transcript is a conversation with Daniel O'Neill, who talks about his background as a country Victorian boy, his military service in Iraq and Afghanistan, and his current work at Communities at Work. He provides his full name, contact details, and a brief overview of his life story.",
  "quotes": [
    "rec6aLIZ81KBd8Cpz",
    "recLlYWI94rBXrDgD",
    "recMVv26dvCW9cgOw",
    "rec0wJfHa2VPsGPll",
    "recnc7uZQKajA87Pg"
  ],
  "transcript": "Daniel O'neill\n===\n\n[00:00:00] \n\nAnd I'm moving so much. I'm gonna cut my hands. Yes. I'm getting better at, clap my hands. It's quite hard when you want a good clap, right? All right, so as look at me, I'll get my eye line close enough. I think it's always a drama. This eye line thing. Uh.\n\nAll right brother, so all we need to do is just tell me, uh,\n\nso just let me know your full name, Daniel O'Neill.\n\nSo it's D-A-N-I-E-L? Yep. And then o, o apostrophe, N-E-I-L-L. [00:01:00] Cool. Uh, do you prefer email or um, phone for sending this to you? Phone's fine. Yeah. What's your number? 0 4 3 9 6 5 3 4 6 3.\n\nAnd we are at the, which shift are we at? Oh, good. I'll be able to tell you in two seconds. Is it Communities at Work? Yep. Cool.\n\nHi, rose. What's, um, tell me a bit of the Daniel story for a second. Uh, where do you want me to start? It's up to you, brother. What, how do you like introducing yourself and talking about yourself? [00:02:00] Um, well, I'm a country Victorian boy. Um, born and bred in the sort of the Mali area of Victoria. Um, went to primary school, high school there, and then after that moved away for about a year or so.\n\nAnd then after that I joined the military when I was 19. So I was then, uh, posted to Darwin. I then, uh, done some more training while I was up there. Uh, also while I was there, I had the, uh, the privilege of deploying to Iraq twice and Afghanistan once, which is a big eyeopener. And, uh, just in terms of like the way people live and work and breathe, it's a completely different.\n\nSort of environment, um, takes a bit getting used to and also takes a bit getting used to coming home as well. Um, [00:03:00] yeah, I've had my struggles of mental health and stuff like that, so that's why I sort of reached out to Orange Sky to, um, come here as a volunteer. Um, I was lucky enough to start about 80 months ago here at Orange Sky.\n\nUm, I did about six months. Here with the communities at work. And then I was then also given the privilege of being a, an active assistant team leader. So that was another big eyeopener, like managing people in the volunteer space. Um, 'cause you can't really tell people what to do. You just ask, I suppose.\n\nUm, and yeah, here I am being dragged in from the streets to, uh, help out with this shift. Um. Yeah. Cool. What, um, what was the first sort of interaction with orange fire? What, what'd that feel like? Uh, what sort of stood out to you? I guess? Uh, I always [00:04:00] like giving, uh, instead of like receiving like at Christmas time and stuff, I would prefer to give 10 presents and receive one.\n\nWhereas if the other way around, uh, it doesn't sit well with me, so. Yeah, I completely forgot what you asked me. No. Yeah. What was the first time you saw her? Yeah, basically just social media. Um, and I think I seen the van once or twice around town and just interested to see what it is. Um, yeah, about 18 months ago, joined the crew here.\n\nUm, my previous employment allowed me to come here like every second week, but now I've sort of moved on to a new job, which is nine to five. Um. I've got today off and they were short a person, so thought, pulling the boots and give it a crack. That's cool. Um, how do you relate to your own experience when you're talking to people that are coming and using the band?\n\n[00:05:00] Is that something you think about or you try and turn that off? What's your process? Uh, not so much turn it off, just sort of turn a filter on, I suppose, and just listen. Without judgment is the biggest thing. Um, I was a very judgmental person probably up to about five years ago, but yeah, ever since I've been here, it's completely flipped around.\n\nUm, yeah, I, I love it here. Why do you think that's flipped you? Like what was the things that maybe, um, caused the change or was it, was it a bunch of things or was it like, uh. Whenever I go to like a big count, uh, like a big city and stuff, and you see homeless people everywhere and like begging for money and stuff and I'm just like, there's gotta be an easier way to actually deal with this.\n\nSo that's why I volunteer here. I also donate to Orange Sky every month as well. Um, and sort of, I wouldn't say it gives you like a warm and fuzzy feeling, but you just know that you're [00:06:00] helping. In it being here on shift or donating money so it can then go and help for the future, I suppose. Um, yeah, I'm always interested in like, so much some of the things to donate to.\n\nMm. What's the, what's the theory behind Lawrence Sky versus something else? Uh, I know where the money's going and I have seen change, um, even the short period that I've actually been here and the short period that I've been donating as well. Um, and yeah, you can sort of see where your money's going. I, uh, yeah, I think, yeah.\n\nThat's cool. Um, what's this like feeling of conversations around the day and is it something that's forced and you need to do it or is it natural or how's that feeling? Uh, it sort of comes natural, I suppose. And just going back to the point of being, uh, non-judgmental, just listen without judgment and.[00:07:00] \n\nSometimes I can relate to the stories and actually then give my own experiences. Um, but yeah, but the biggest thing is just listen. Um, there's people around the town and around the city that have pretty much got no one to talk to. Um, so the only time that they might talk to people is when they come here.\n\nUm, or different settings like this, I suppose. That's cool. Um, so you don't have. Great job. I, there's this thing we call keys to the city. Sorry, there's something, good keys to the city. Never heard of it. It's, um, just a way for me to say, is there anything else that we haven't talked about that you've always wanted to talk about or elements of already inspired that we haven't touched on or, yeah.\n\nThe biggest thing in this job is the homelessness and just understanding like where people have come from and, um. And they're only here for say, [00:08:00] maybe five minutes when they drop off their washing, it's a five minute chat. And when they come and pick it up, if they wanna chat for five minutes or five hours, we're here to do it.\n\nSo, yeah. Um, and in terms of, yeah, I, I don't really have much to add. Sorry. It's amazing. Um, we might be able to talk to one Jasmine. Jasmine, do you much about Jasmine and her? Yeah. Oh, do you, do you know much about her though? Not, uh, not really. I know that she loves coming here for a chat. She's a big, big chatter, which is, and she just brings in a, like completely different vibe.\n\nBut when she turns out, um, yeah, she sort of brings a bit of energy to the room, as you say. But yeah, she'll be good for a chat. How long has she been comfortable? Uh, as long as I've been here. 18 months? Yeah. At least. Wow. Yeah. I couldn't tell you how long, but. I'm sure she'll tell you that. So, yeah. Alright, Brad, we're gonna take a big [00:09:00] photo.\n",
  "themes": [],
  "themeIds": [
    "recEAZCzlYboBPaLQ",
    "recniO3OPWsxlU10Z",
    "reca1Ej6CNe3Bupx5",
    "recuZt3NvyYsALDuS"
  ],
  "shifts": [
    "recEyI3nzqyjNhIQH"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}