{
  "id": "recb3IDtifNAc9eLv",
  "name": "William Radke",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "Summary: The transcript involves an interview with a student named William Radke, who is the school captain at St. Patrick's College in Mackay. He discusses his involvement with Orange Sky, a charity initiative where volunteers provide breakfast and laundry services to people experiencing homelessness. William emphasizes the importance of community engagement and meaningful conversations. The interviewer also briefly speaks with another individual involved in photography and business activities related to Orange Sky. William expresses gratitude for the opportunity and encourages others to get involved in similar community initiatives.",
  "quotes": [
    "recRo67mrHwOrPZ58",
    "recIBDzgl1Hp9mRDP",
    "recjPG5BtUJCKmPRa",
    "recAQ7CDcshwk6JnI",
    "recLY0IiC4TRLyzIL"
  ],
  "transcript": "I'll give you a little sound test. Yep, testing. How's this? Yeah, that's it. Testing, testing. Okay, all right. Got a little bit of sound play. That's good. It adds some character. We'll get one more walk and then we're gone. All right, brother. Tell us your name and spell it for me. That's right. Just look at me. Yep. William Radke. W-I-L-L-I-A-M. Radke. R-A-D-K-E. Cool, man. Tell us a little bit about your school first. What school is it and a little bit about what your year is and stuff like that. Yep, so I go to St. Patrick's College, Mackay. I'm in grade 12 this year. I'm school captain. Yeah, I love going to school. It's a good school. Sure. And what else about Mackay? What do you like about Mackay? Have you been here very long? Yeah, yeah. I've lived always in Mackay. I love the beaches. I go fishing. I love the sport, the community and stuff that happens. Cool. And how did you first hear about Mackay? What did you first hear about Orange Sky? It was just an initiative through the school. We started the brekkie van a few years ago. We'd just come down to Orange Sky. We cook breakfast, the snags and some eggs while they wash their clothes, while it's drying. We cook them and then we have a conversation, which is really important. Wow. And like being a young fella, what do you feel, what do you feel like people like yourself, your age, what do you think they should interact with our friends and create opportunities? Yeah. Cool. Yeah, well, it's really important because everyone benefits out of it. And then when you come down here, you really understand and you can emphasise what it is like. And through that, then you can, you can lead to actions that do help. The brekkie van is an amazing opportunity to get active within the community. It's not just donating to a charity. It's getting down here. It's cooking the snags yourself and it's giving to these people. Cool, man. What's like, what do you think you'll take with you? Like I guess you go to school, you learn, you have education. Yeah. But why do you think it's important to have things outside of school that are community based? Yeah, definitely. Well, there's no point just knowing the numbers in the book. It's about talking to people one on one. It's about looking people in the eye and saying stuff that matters. Because in a job, in life, you're going to have to talk to people and you're going to have to do stuff that matters, that helps the community. And the brekkie van in Orange Sky is the perfect opportunity to make this happen. Cool. And what's it kind of feel like when you come down here? What's the process? Yeah, it's a good community. You rock up in the morning at 6am. You get the snags ready. You cook the barbie. You have the serving table. People start rocking up. They put their clothes in the washing machine. And then while they're doing that, you serve breakfast. There's tea and coffee. And then after that, you'll sit down. You have a good chat. And it's all very good for everyone. Sick. And like, what's the school community's vision, do you think, with supporting this stuff? Yeah. And like, what are you going to do with it in the future? Yeah. Well, I think it's really important for every student to get involved. It makes every student get down here to understand. And then that helps us in our future as well, where we take an action within our community. And I think many students after leaving school will continue to volunteer in groups like Orange Sky, where we can all help the wider community. And what do you think the impact of Orange Sky is, I guess, like, from a school and student perspective? Is it the washing, the conversation, the connection? What do you think is most important? Oh, it's huge. I think the conversation is the most important thing because, yes, the washing and the food is very important. But it's the conversations. It's the cathartic experience, getting to talk to people. It's giving advice. We hear some amazing stories. And as a student, you learn a lot. And it goes both ways. Everyone benefits from it. On this one, the car. I was just trying to do this to try and like, for the world's worst sun visor. Anything else you wanted to say about like the school, Orange Sky, or is there any other things that you want to say? Yeah, it's just a great opportunity for people to get active within the community. It benefits everyone. And it's an opportunity we're very lucky to have as students at St. Patrick's to come down here and to participate in the break event and Orange Sky. And I encourage anyone to do it in likewise opportunities in the area. Wow. Mate, you're a legend. Well done. Thank you. That was very well spoken. You've been doing a bit of that at school, yeah? Oh, a little bit, yeah. Cool. They'll tell you. Hey, just come here. I'll do a quick photo in front of the- Can I take a picture? I like the kids, boys. I'll do a picture. I'm not going to take pictures. That's okay. I'm not going to take a picture of you. We're doing a lot of good things. Yeah. That's nice. Right. So that's all, right? Just come here. I'll do my best just to see how bright this is. Yeah. Definitely. Well, we'll have to let it go. Yeah. That's good. I hate to be in the photograph. Good feedback. Alright brother, look at me. Come around here a little way and stop there. Alright. Well done. Thank you. Thanks brother. Yep, um, yep. Have you got a friend? Yep. Have you got a friend? Yep. Have you got a friend? Yep. Have you got a friend? Yep. Have you got a friend? Yep. Um, yep. That'll be quick mention is- Oh, we didn't talk but he, he said to, um, have this follow up as a spokesperson. We'd already spoken to him. I was keen to get a couple of words from him. Oh, if he's keen. Hey, Beth. How you doing? Good to be back. You got a minute for two words? Yeah, yeah definitely. Cool, come sit down. I had like, what, I turned fifty-eight this week, so, sixty per target. I'm just tackling The sun but that's okay. So what you can do with this you can actually put this behind of this in front Okay, it's like a magnet. So this on the back like under you. It's like that sort of thing Yes, so put the magnet on the front I reckon because then you hide that. Oh, okay. So I spin it around Yeah, okay. Let's do that. Are you right with that sun Ben? Ummmm Well what I'm gonna do Never in the right spot So you keep pretty busy with your photography Ummm I don't actually do this very much I used to be the brand manager at Orange Touch Okay And now I'm kind of Just go across a little bit actually Can you just swing your chair this way? That way? Just a little bit more I reckon Just bring your chair this way a bit more Awesome Ummm yeah and now I kind of I actually have been doing some stuff with, do you know Nicholas Marchesi the co-founder? Oh he came and talked to us He spoke to us, yeah So I do a bit of stuff with him now A bit of other business type stuff Nick and Lucas love hanging out having me around And I like asking him to do this stuff But I go in and out I think I've got a bad attention span just staying with stuff That's fair enough though",
  "themes": [],
  "themeIds": [
    "recaeaYUCMywHUZUr",
    "recuEyBWkcxvir4TD",
    "recyT7lt7vrUgZH4N",
    "recJhuhdESBT1c8y2",
    "recHHdNiI7XydmQsq"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}