{
  "id": "recCfOxhvAG0WIKzm",
  "name": "Brontee Lawson",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/9Cd2JvMzZ2T",
  "summary": "Brontee Lawson discusses her background in social work and psychology, her studies, and her connection to Orange Sky through a friend's involvement. The transcript touches on her personal experiences and her passion for her career.",
  "quotes": [
    "recdoOq16j0Dt3Arz",
    "rec7T9E1kLBEppJbs",
    "recHd8PItKZXu7Dxj"
  ],
  "transcript": "# Brontee Lawson\n\n[00:00:00] \n\nPost video talk two, right? Yes. Video's working good. It's pretty good, I think. Alright. You look at me, don't look at this. It's pretty chill. And all you gotta do first and foremost. Is your full name and spell it. My name's Bronte, which is B-R-O-N-T-E-E. And my last name's Lawson, L-A-W-S-O-N. Great. Let's start with a bit about yourself. Can't a bit about yourself.\n\nThat's actually my least favorite question because I never know what to say. I always ask how do you like to either identify, introduce, or tell a story? At the moment, work is the biggest part of my life. I spent a lot of time doing that and talking about that. Very passionate about that. So I finished my Masters of social work last year and I've got a double degree in psychology and criminology as well.\n\nSo I've been studying forever. So finally in that career building stage, I'm very passionate about what I [00:01:00] do. That's cool. I spent almost 10. What was that? Sorry. I spent always 10 years at university myself. Yeah, it just creeps up on you. Yeah. Tell us about the first time you ever heard about Orange Sky.\n\nI was living on the Gold Coast and one of my friends at the time, she'd recently connected with Orange Sky, and I think she was there. I think she's still doing it now actually. So this would've been back in 2021, and she would just come home and tell all these stories about all the people she got to speak with and.\n\nHow special it was, and I didn't really think too much of it until I moved back to Hobart and was looking for a volunteer opportunity. And this is the one that popped up. Why? Why keep turning up for you? Why do you get to come to those scholarships? The relationships, definitely the people that come along every week and.\n\nJust, I like to be someone that will say hello to everyone and you see it. A lot of people will walk by and they'll be very straight faced and then you'll say hi. Like, how are you? How have you been? [00:02:00] And you might not get much from 'em, but you'll usually get some kind of smile. Or the fact that someone's stopped and asked them usually seems to, be a good part of their day.\n\nIt was awesome sitting down with Sarah. Do you know her very well already? She used to come. A lot used to come every, because I come here every fortnight and I used to see her really frequently. And sometimes when she doesn't come along for a little while, I do worry a little bit, which is a hard part of the work I do and my volunteering.\n\n'cause if you don't see people, you're like, there's so many different things that could be going on. But I know that she's got, really switched on and pushed through a lot of really hard stuff. Do you know much about her experience in terms of the language she experiences? Circumstances and stuff or in terms of like her accommodation status?\n\nYeah. A little bit. Yeah. I try not to ask too much because I like that we can give a break from the hard stuff sometimes. 'cause they, we get to go home at five 30 and go back to our homes and our lives and people don't get to stop going through the hard stuff. I always think [00:03:00] about this thing of orange sky is, some people want it to be lots of things and some people want it to be just.\n\nA few things. What do you think in your mind is the impact now and how do you think they keep that same impact going? Do I need to do more things outside of what they do? What do you think? Way better for them to stick with what they're good at. I think it's probably stick with what they're good at.\n\nI think there's a lot of organizations out there, excuse me, and at the moment, everyone's really struggling to keep doing the work they're doing. And so if people aren't meeting a particular need or if everyone's trying to do different things and service different people, then they lose their, impact sometimes.\n\nSo they stop getting funding, they stop getting people coming along and I think it's really known to be really sorry, it's Sunday. Really good to be known for what you do and doing it well, so people know that they'll come to us and we'll be friendly and we'll, they'll get some clean clothes and a good chat.\n\nAnd I think there's a lot of dignity in that. I do wonder how, 'cause I know on the mainland they have, [00:04:00] like the showers. Yeah. Which I do wonder if, it could be worth expanding into that because, if someone could, I know they've already got showers here at Salvos and most of the places that, orange sky parks up.\n\nBut I think, having a shower could be the highlight of someone's week sometimes. Great. I'd love to hear a little bit more. Okay. You allowed to talk about your work? Yeah, I can talk about my work. Yeah. Yeah. Tell us a little bit of why you got into. And what sort of is your day to day type stuff?\n\nMy day to day, the way the day starts versus the way the day ends is very different. I do a lot of work in the prison and work cl closely with community corrections. For me, I do the outreach up in Launceston. I'm up there every fortnight working with people up there too. I think that intersection of justice and disability just does get enough attention, and particularly in Tasie, it's a really.\n\nPunitive state. So people think, oh, you screwed up, you broke the law, lock you up, throw away the key. And people who are involved in the justice system, they have so much to give. They've got a lot of [00:05:00] resilience, a lot of knowledge, a lot of skill. And when we lock people away, we lock those contributions away too.\n\nI am pretty close to justice, the justice stuff in Australia. Pretty fascinating what's happening in Tasmania moment. They yeah, there's been a slight interest in how do you remove the detention center and create some home style detention education. Do you know much about what's going on there or?\n\nYeah, a little bit. Youth Justice was initially where I wanted to go. I've done some casual work in youth homeless shelters and counseling, work with young people and. It is really hard. It's, yeah. 'cause it's not just the young people, it's, their lack of connection to family and community and their brain's developing and a world that's changing so quickly.\n\nSo it's not just, why is this person in front of us offending? It's who are they going home to at the end of the day? What opportunities do they have? [00:06:00] Yeah. Let's talk after the interview about. Someone listen back to this little stuff going on track, got an agenda. Tell us a little bit about that interception though.\n\nI think disabilities, corrections, homelessness. What is the connection between some of these things or disconnect? I. Well, somebody who has, a brain injury or some form of cognitive impairment, those fundamental skills of, impulse control, decision making, planning, understanding consequences, and future thinking is usually really impaired.\n\nSo if someone's already in a pretty hard set of life circumstances, they're already in that, survival mode. So their decision making is gonna be really opportunistic and how do I get out of this stress right here, right now? So it's really hard for them to. Think about what the impact of decision making is.\n\nTo figure out who safe people are to be with and who's gonna help them reach their goals. And they've also usually learned to mask their whole lives. They don't necessarily identify as [00:07:00] being someone with a disability, so won't, seek support for that. And there's a lot of vulnerability, particularly in a, a prison setting of saying, yeah, I've got a disability.\n\nYeah, I've got a brain injury. So they just keep trucking along and they find some really clever ways to do that. But then particularly when they get out into the community after being in prison, there's a lot more decision making and then there's a lot less structure. And when you're coming out onto the streets, trying to navigate all of the services that are out there to support people, like it's one thing to have.\n\nServices, having the skills to actually remember to go to appointments or remember what's being said in appointments or implement the strategies that are being talked about is a whole, another set of challenges, I think. Yeah. One second.\n\nThere's this concept of connection. I think that's what I suppose that and like a lot of people talk [00:08:00] about this theory of the opposite of Dion's connection. Do you think there's similar things with disability in terms of that idea of connection and how that supports someone?\n\nHolistically? I think I'm thinking about one person in particular that I work with and they. It became they had their brain injury around 20 and they're in their forties now and massive impact to their cognitive functioning and a lot of vulnerability. Vulnerability there. And people think, maybe he's just intentionally being forgetful or, some of those social skills can really be impaired with cognitive impairment too.\n\nSo knowing who safe people are, how much you can share with people, because it's really hard to break through that vulnerability that helps us connect with people around us. And what do you get out of being a volunteer or expert? What's the, do you feel like you're getting growth experience and stuff here as well as providing service?\n\nI think any chance that we get to [00:09:00] hear people's stories and, they've lived lives I could never, ever imagine. So just that reminder of, it's hard out there, but it's not focusing on all of the bad things that come with struggle, but on the things that people get to share and their knowledge.\n\nAnd I think that's a really big part of why I do my volunteering and my work as well. We call this keys to the city. Is there anything that we didn't talk about that you wanted to say or talk about?\n\nI don't think so. If you didn't get me at four o'clock on a Sunday afternoon, perhaps I'd be a lot more articulate and forthcoming, but.\n",
  "themes": [],
  "themeIds": [
    "rectUuo2Z2j2mZEEP",
    "recZuTzZ11Q2j67ed",
    "recCSo5Zh2afu5Utf",
    "recGBOS6rCv1ZgMVN"
  ],
  "shifts": [
    "recsVCxQUtq7S86eP"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}