{
  "id": "recCZMoS9f1h0h8dU",
  "name": " Tracy McIntyre",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Adelaide",
  "videoDraftLink": "https://share.descript.com/view/VLzDTeCrT3k",
  "summary": "Tracy and Jared are volunteers who retired and joined Orange Sky, a charity organization providing laundry services for the homeless. Tracy has been volunteering for 2-3 years, and Jared joined after retiring in 2021. They both found out about Orange Sky through previous connections and appreciate the flexibility of volunteering bi-weekly.",
  "quotes": [
    "recQ1B67I4V4z988k",
    "recBUqCaUYmegJNMK",
    "recGslyD0TZ7LBuQY",
    "rec9UkLb5Xfsopcgo",
    "recbjfjXmP5sWgkya",
    "reco1rdetO626300x",
    "rec7sLGKgrTtsJyiu"
  ],
  "transcript": "# Tracy & Jared\n\n[00:00:00] \n\nThese broadcast comes, oh, an acronym for a military. Alright. Mics are good. You're good? Yep. Let's go. Okay. And first what we'll do is say your full name and spell it for me. It'll be awesome. Full as in na, first and last or just, okay. Okay. Tracy McIntyre. T-R-A-C-Y-M-C-I-N-T-Y-R-E. Amazing.\n\nAnd just your role, David. Just a general volunteer. Awesome. Yeah. Jared Keating. So G-E-R-A-R-D-K-A-T-I-N-G, like the former Prime Minister. And I'm a driver volunteer. So good. Tell me a little bit about yourself first. How long have I I was trying to work out if it's two or three years I've been volunteering here, but I retired in 2021 and was looking for some role in volunteering.\n\nAnd this was an area I hadn't really worked with before. So I was, and saw a bit of advertising for it and [00:01:00] just thought why not? So I put my name down and been here since. And we only, we have two volunteer, schedule. So we only do it fortnightly, which is good. And if you're gonna go away, it means that you don't have to be bound to turn up every time.\n\nSo it's very flexible and it's good. Awesome. Yeah. And how did you hear about it on this Skype? I retired last year and took up some volunteering, but I knew the boys when they first started 10 years ago in Brisbane. And we used to, have some of our volunteers where I worked there come and join the.\n\nThe work of Orange Sky back then. So connected to it for a long time. And how did you connect that back up with it in Adelaide? Did you pursue it or see it? Oh, just I knew they'd started working 'cause the bus is parked or the, our little van Splasher is parked down the road from where I live and thought it's handy for me.\n\nI can do this and. I come out on a Tuesday night, but here I am on a Friday morning, which is lovely. Just filling in today. And what keeps you coming [00:02:00] back to Orange Sky? Like why do you Yeah, I think it's the friends that come to have the chat and the people that you are on the shift with and it just feels good to volunteer and yeah, I used to work in a school environment before, so that community feel, I enjoy that and I find this is very similar yeah.\n\nAnd what's, has your sort of take on what orange sky does or homelessness or yeah, even like how you talk about with your friends, has that changed over your time volunteering or stayed the same? Yeah, most probably. 'cause as I said, it was an area I wasn't really had much involvement in. And I was really impressed with how the guys have operated it.\n\nI mean they're it's obviously got bigger, but. I think what they're out aimed to do is, hasn't changed. And I think it's helpful. And it's not necessarily just the homeless, it's the people that just don't have those vans that a washing machine might break or can't afford to run it, instead of hitting all people.\n\nAnd I love that it's here and they can go in and [00:03:00] have a meal. So you know, they're getting covered always. What does it I guess what does it feel like for someone who hasn't been on shift? What's a general shift like for yourself or this? So coming as a driver, I head in and pick the van up, bring it down here to Glenelg and try not to crash the van.\n\n'cause that'd be a bit of a disaster if it did. And then we set up and, just starting out, you get to learn how the van works and you've got other volunteers here who've done it before. So you learn and then you just interact with the people who bring their washing in for all sorts of reasons.\n\nYou hear some of their stories, which is really lovely to hear some, it's very sad at times. And I suppose there's that thing, you're, for many people, they're just two disasters away from needing this service or needing a roof over their head. And, yeah. So that's the sad part of it, but providing some service, providing some help, it's always appreciated.\n\nYeah. So cool. What's something that surprised [00:04:00] you maybe about R Sky or working here, or friends, so something that surprised you, like after little world of being? I thought in the beginning, and I can't remember it happening, but I remember just getting like a birthday. It can, like happy birthday from the whole orange Sky which was really nice.\n\nSo I don't know if it happened, whether it's as, it's got bigger, it's been quite so much, but I really thought that's just looking after your volunteers and I like that. 'cause again, in schools we rely on volunteers. So I know the importance of, you still gotta appreciate what time people are putting in.\n\nSo Yeah, and I think the organizations. Really good at trying to do that. 'cause you've got a whole range of different people and personalities. It's not an easy task, but I think they do it well. Yeah. Yeah. We operate with our service provider here. What's the relationship like and why do you think it's beneficial to, to work with a I think it's, it gives you a [00:05:00] connection, a reason for being here.\n\nAnd the good part here today, they're getting lunch on Tuesday nights. They get a lovely dinner. And so there's a purpose there. And then the relationship with the people who are coming to work in their volunteer service and we get to know them and they get to know us, and they appreciate what we bring to their community down here.\n\nI'm always fascinated, like Orange Spots had this tagline forever. Positively connecting communities. Yeah. Always been. Yeah, I guess people draw whatever they want from that, but there's a whole range of impact that's available here, which is is washing somewhere, there's showers, sometimes there's conversation.\n\nYou know what I mean? Yeah. Is there something that you think stands out more than others in terms of what impact it might have on an individual? I think it's just nice for some of these people. They might not get to interact very much, especially if they're on the streets and depending on the different where the van goes here, I think it's good 'cause the church has quite a good [00:06:00] idea on them.\n\nBut we were only saying at the start of this year, there's one person that we normally used to see, didn't usually always use. The van would come and chat with us. We haven't seen him come back. And then you keep asking the questions and hopefully someone checks in. And we've heard that possibly he's had a fall.\n\nAnd I think that's a good thing with it is you get those connections and you look out for 'em and yeah, it's just nice to get to know them. Yeah. Yeah. We had a similar one to be heard. Yeah. There was a similar one with a, a young mum and family. And, she hadn't been around for a while, and then she was here a couple of weeks ago and she said, oh no, I'm all good now I've moved to Burra and I've got a house and we've got three little pitties that can run wild.\n\nSo that was, just a positive story to hear from that lady who we'd done a washing for. She'd always arrived late and have a whole swag of washing and Oh wow. Wed get it done. And but yeah, it was lovely to hear that she'd settled and feeling really good. That's cool. Yeah. And [00:07:00] I'm just always interested in what is the influence on you as a person outside of Orange Sky?\n\nDo you think, are there conversations you have that come back about orange sky and your surprise that people's take on it? Or what are those conversations that you have in your social circle? And or even in public, can they be difficult sometimes? I suppose I've got friends that are in that field anyway, but then there's other people you might say you volunteer, just in a general conversation with someone you haven't met before.\n\nThere's a lot of people that still aren't aware of Iron Sky, and then when they hear what it does, they just say, oh, that's fantastic. Yeah, I suppose just trying to get it out there as much as you can, but yeah. No, I think most people think it's a great idea. Yeah. And are there particular challenges of being a volunteer?\n\nI think we've heard a few this morning. The van, yeah, when the van doesn't work, you get, people can't get my drawing done today. Oh it's a where will used asset and it's starting to show [00:08:00] sometimes we're not too bad here, but occasionally I've helped out in a couple of shifts and you get some interesting and.\n\nSort of behaviors, and I know one shift I had a gentleman come up and say, oh, is the van still washing? And I said, yeah. He said alright. I said do you wanna go and get your washing? And he proceeded to strip off everything except his jocks. And that was something I haven't seen here. But yeah, it just goes to show that some people are basically living with the clothes on their back.\n\nSo Yeah. And it's great that we can help them to do, to be able to, wash it for them. And I think it helps concretize other people who I talk to about. The difficulties and challenges of, people who are doing it tough at this time, and I think that helps to raise the awareness of the inequity in our society and hopefully help address that.\n\nWhat's the, what's your feeling about Adelaide in [00:09:00] general in terms of whether it's class or marginalization or struggle what's your general take on Adelaide's? Like temperature or like sentiment? At all that stuff. Is it, do you think it's like high or low at the moment or, I'm not sure.\n\nTension or, I think it's been increasing. I've been in Adelaide, this is my 10th year, and more people who are. Doing it tough and and a lot more people who would be homeless on the streets. And I think we've noticed it here just in the last 18 months, more people coming to get their washing done and you ask them where they're staying and they'll tell you, oh, in this driveway in the winter we are going to a car park.\n\nThose sorts of things. Yeah. But then also just generally, some may not be homeless, but the cost of living pinch is increasing, that's for sure. But yeah. Are there more things you think orange sky should be doing, can be doing? It's always interesting, like I think I heard a stat the other day that orange sky has the second most touch points of people experiencing [00:10:00] homelessness in Australia.\n\nNow, are there things that you think they should do more of? Or do you think they should like fit in their lane what they don't? I think the showers down here might be a thing. Yeah, I think the showers might be handy, but I think they're. I think it's good to keep doing what you do well.\n\nBut yeah, definitely I think the showers and that might help, but like anything new, it takes a while, so it's not just gonna be picked up straight away, so you need to be a little bit. Yeah. Here's some questions more for me, but I, yeah, I'm trying to work out how if you can.\n\nAnd how do you tell stories or do highlights shift that then get shared back? I'm just wondering if you had a way to see what other shifts are doing or what other shifts are like, see videos and photos of other shifts and even like almost search to see sentiment, that sort of stuff.\n\nIs that something you'd be interested in and why? I think particularly other states I think would be interesting to see how it works. Yeah. [00:11:00] Would there be certain ways that you'd love to see that or interact with that? Like it's no. No. Good. Just making another Apple place. I suppose they've got that website and I can't see why you couldn't add it to that.\n\nIt's not always the most user friendly website, but. I'm sure that can improve. Yeah. Just to, have a story, say from, I'd love to see how they work in the remote communities. Yeah. Having spent a bit of time working in those over the years and even in the floods, yeah. Things like that.\n\nSo just have, even if there's just a little, like you say a video of here's what we did in, at T Anger or wherever in, in the Kimberley. And then tell that story. And just have it there so you can say, we've got a new story up and that'll come out on the little message.\n\nHere's the link. So you go in and have a look at it. Yeah. Here's the story from, St. Mary's in Adelaide. Yeah. That's what I'm trying to work out. What's something that you can offer that's not like to some other random place to go over to something That's interesting. And because they do the weekly or the monthly magazine that you get emailed, but.\n\nYou [00:12:00] don't always have time to click into those things. All right. Yeah. 'cause I'd love to even if it's okay to test something with you after this sometime during the week I'll work our away to get like a link to this shift. And you guys, I'm not the best person to do 'cause I'm overseas as of Saturday night.\n\nThat's even better because I wonder, like you when you come back. Yeah, if it's still available and it's, yeah. Like I'd love to work out. I might have access to emails in that anyway when I'm away yeah. Cool. Yeah. 'cause the whole idea of this project is almost like, how do you tell a story but then make sure that there's a participation?\n\nYeah. That's true. Then you, this idea of I think Orange Sky's quite good at promoting themselves on social media and stuff, but I wonder what else we can do to almost like, like we're connecting communities. I wonder how, what else you can do to connect this community up more and because I think they connect to volunteers.\n\nIt's the, the friends that who don't have all the access to media that, how do you, they're good at putting them with venues [00:13:00] that they're coming for, for a meal. So yes, they'll come into the washing, but that must be one of the hardest challenges, I think, for them to, 'cause you've got it.\n\nAnd some shifts would be quieter than others. But. Yeah. Just I'm fascinated at what happens when you give someone agency over engaging as much as they want. Yeah. I was almost fascinated with anyone that wants to sit down and tell their story. So yeah. I just hope that we can find a way where people that tell a story feel good about it and you've done something.\n\nYeah. And they can see it. Yeah. Awesome. Was there anything we didn't touch on that you wanted to say about Orange Sky or talk shit about Nick and Lucas? I've never met them but you on the other hand. Yeah, I met them years ago and gee, they have an age. I reckon because that was so young to start off with, actually, I'll.\n",
  "themes": [],
  "themeIds": [
    "recBWXgpvATjbuFeM",
    "recSkZ9LoQ9VgE232",
    "recLXgljuvwE3o3oT",
    "recEu6oMyHxJTJ3jW"
  ],
  "shifts": [
    "rec2VqYMVIm456rcB"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "recm7uI6MjzIi8MkM",
    "recmKVvKSQZ9PEKk0"
  ],
  "storyCount": 2
}