{
  "id": "recda23sMaKE3vQAv",
  "name": "Clive - CEO Bega",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Kalgoorlie",
  "videoDraftLink": null,
  "summary": "The transcript involves a discussion about the organization's history, funding, programs, staffing, leadership development, construction projects, strategic planning, employee expectations, and future goals. It highlights the focus on client-centered care, workforce development, and creating a central health hub. The speaker emphasizes the importance of attitude over skills, workforce training and retention, organizational culture, and branding. Additionally, challenges like budget constraints and project delays are mentioned. The organization aims to extend life expectancy and stay true to its vision.",
  "quotes": [
    "recOEOWZImloTUCOR",
    "recGVPc7HTXERXQGD",
    "recs8lkr9m5PMFF1k",
    "recd5m1iba1ofFh77",
    "recAQkxD9bNENo6r6",
    "recmGd3WibM3WrLXk",
    "rec3FwYsT1vIAHBje"
  ],
  "transcript": "Right down the end there, see where that big car is? That's the sewed up centre. So more or less we're sort of spread right down here and all over here. Cool. You've got to keep moving in this weather. Keep moving. I know. How long have you been around with Beaker? Has it been around a long time? It's been a while. Cool. I was in the season of January 2002. Yeah, right. And I was much different back then. Everything was just in that one building. Yeah. And then we had the health programs. And is it primarily government that funds the mines a bit too? Yes, we get from multiple different governments. True. So we've got Department of Health which pretty much funds the clinic. And then we've got so many other programs and they're all funded by different government bodies and organisations. One of the tricky bits is to try and bring it all together. Yep. In a way that you're doing the best for the time. Yeah. Yeah, I spent a long time in Mount Isa. It's a different sort of concept but some similarities of community, and like, especially the distance and the different people coming to our central place. So that's where we run the social and emotional wellbeing at the moment. Cool. We've had a few schools, two don't have the back to accommodation. We're everywhere. Yeah. Taking over the streets. Thank you for the . I've got a proposal in with council. Morning. Morning. I've seen these things everywhere too. They're like eye scanners, yeah? Yeah. It's just, we've had a lot of stuff like that. Mm-hmm. Show you why it takes you home. Nice doors. It's fine. I'm loving it. Yeah. Yeah, it does. It's like the TARDIS. Right. Hello. Hello. No, I haven't seen it. It's a bit of a new thing. I'm not sure what it is. It's a little bit like a desk. A desk and a desk and a desk and desk and a desk and a desk and a desk and a desk and a No, I haven't seen it. I left at about nine o'clock so I might have missed it. But yeah, there was all the fellas out there trying to get me to buy them a tarp for the house out there because they were all getting wet. So see we've bought a camp because they're sort of like from the Dundasetta area. But the council and shire, they sort of like get funded for it to make sure it's maintained and everything. But they're eventually going to be moving that. Because you can see that big mine. So they'll be moving it closer to where Boulder Shore Stay is, behind somewhere. So we don't try and encourage people to live there. We try and have it like a, when they come in for a couple of nights, stay there. But because of the history they love that area. And then we try and get them to Boulder Shore Stay. Alright, I'm going to stop up to that. So the spears are cool. Yeah they are. It's my bane of my existence logging into stuff. Alright, let's break. Break my mind. I get it. Security and everything. Yeah. Maybe so often you've got to change your password. Yeah. I've just got used to it. I've just remembered that. Yeah, brother. So Anna's around today? Yeah, she's at the moment because they're sort of supporting with, um, oh you're not here next week are you? No. I've got to leave tomorrow. Yeah. So, because they made it a week bigger, sort of, um, there's some programs with us. So we do always, we do an elders lunch. And it started off small but we're just like, we were, there's so many elders sort of, I'm like where's all these oldies coming from? It's like we've been hyping up for years. Sure. And now they're just everywhere. Well they enjoy it so. Yeah. We've got the ball, the youth ball. That's a sort of big thing. Cool. Um, and we were on the march. We all met up at the march. We all met up at the park down there. So all ages and everything. Police, everyone's name is all there. And then we have like the guest speakers and then just providing stuff and information. Put a barbecue on. So apparently they've got the, um, Yabba band on the opening day. So that talk is already out now. Yeah. Awesome. Sorry Phil. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. Sorry. Phil's calling me. This was modified slightly to start with. Cool. Brother. It's Ben. Hey, did you catch up with the blog? Yeah. I'm in Bega now. Oh, all right. Yeah. Where are you going? Ah, true. I'm in Bega now. Oh, yeah. We're in Bega. Yeah, I saw Trace, yeah. Yeah, I'm going to do a little few videos and stuff. I'll probably be a few more hours now, so let me know if you're going to leave. Yeah, yeah, going to see Anna next, yeah. Awesome. Thanks, brother. Stay warm, yeah? See you, brother. All righty. So basically we last year celebrated our 40th anniversary. It's Aboriginal community control, because there was some people saying things about, oh, you know, communities aren't involved, or communities, because they run the place, they own it. And always acknowledge traditional owners and builders as an element. We have a board, which the board is the board of the Aboriginal community. So we have a board, which the board is the board of the Aboriginal community. So the board is basically called from a membership base. In order to be a member of the organisation, you have to be an Aboriginal or Torres Strait Islander person residing in the goldfields. The goldfields region goes from Eskimos Drive to Nemo or Laverton and beyond. So it's an area three times the size of Victoria, twice the size of Newcastle. So that's what we do. And then we'd like any organisation, we'd have a vision, vision statement, which the one sort of matter is the why, and why are we having it? Yeah. And then the mission, which then describes what we do in order to try and achieve the vision. We focus on some key areas there, sustainable, culturally appropriate, holistic, health care, holistic, as in the whole person, not the new age sort of holistic helping. We look at the whole person, which includes your social determinants, like health. There's no use patching somebody up in the clinic and going back to an environment where they just haven't been. And then workforce is the other one. An ongoing challenge for us here is always making sure we've got the workforce we need. So we have a non-site registered training organisation that trains Aboriginal health practitioners and then we bring them into the workforce once they graduate. So, and this was just to get staff thinking about, you know, a matter of lifetime, I'll do some training with this, what is big is why. You've got your vision, your mission, but condense it. Why is bigger here? Well, that's why big is here. Now, those are all the sort of functional or different areas that we have, different programs, I think. And I was just trying to show staff that, hey, what you do in your area is connected to that. So it's quite easy if you're a tobacco action worker, you help somebody quit smoking, you can make the connection. You're in the clinic, you treat somebody, you help their chronic disease, you can make the connection. So it was really just about getting staff to connect to why are we here. But it also gives you an idea that, gives the scope of services, strategic plan, which we're working on, or working to at the moment. And this was just an explanation that was given to me once as to think about it this way. The board owns a ship and the board determines where that ship's going. Cool. Which is big is why. The board then develops the strat plan, which is basically the map to get there. That tells us how to get to there. The board then appoints the captain to guide the ship and to get the crew and everything for the journey. So it's just giving people a little bit of information. Cool analogy, yeah. And for me, I like pictures too. Yeah. Some nice things for me. Yeah. And just going back, this was just recent time, 2007, the Orchard was about to close. Wow. And it was really, really funded. But Wade, the CEO back then, got back on track. We got significant funding through COA in 2010, but they might be number 50, and we'd upgrown everything that we had. And then we had a look at where we'd go from here. Conversations with the board was around, you know, wind, sea, bigger and higher temperature than this time. And, you know, that's still alive and good. Why? There's no use growing the organisation there. Well, your wine is over there. And pretty much, well, where do we go from here, get the board involved, and say, okay, well, these are some of the things we want to do. That led to what we developed back then was FIGA 2020, focused on four major things. We were also under increased pressure pressure that we take on more programs and deliver more having increased client numbers so we had to do something um that's what the strat plan focused on get the infrastructure right in order to have space do the stuff get your quality management systems so something like you saw the regular uh not working we use those some of the fingerprint scanners because we say big and spread out now and you know you need to have a system that everything is done automatically it's all automated and it's scalable to new buildings yeah instead of going well we need to be employed on five people to do it manually so that was all part of making sure that we've got all the systems we need uh get the organizational culture right make sure it's close that people want to come to work um that's the employer of choice thing and branding too because we didn't do well at branding everybody would come here and say geez don't do such awesome stuff yeah sure yeah and that's absolutely what we've done a lot there so we've got the structure right we work on what we call the client-centric model now again the future idea is the programs that we run and the idea because i understand this moment itself you know either that's my client i'm not going to help them well you might not be able to help what they need right now but you know where to take them so the client is the center of it and we all work together that just talks about the structure so again giving an idea of the the sort of programs we're doing that's going to be an area of growth into the future fits in there with social support but it also creates a link just referrals as well cool all of those things. This is what we're working on at the moment. That's where we are, at the building. We're trying to create a central health hub where everything gets close together. And for a lot of our clients who transports the big thing, just go, here's a referral, go there, or that way of getting there. So we're trying to put everything in one area here. It's taken a few years to get to where we are now, so the Healthy Lifestyle Centre was the first one. The 2025 road where the trucks are, that was the second one. And the last one we're getting now is 1240 McDonald Street. So that was the Healthy Lifestyle Centre, up and running. There's some amazing programs out there. And that's the maintenance, central halls, vehicle pool there. This is the big one that we have just started with now. The actual construction has started. We've got a lot of construction going on. We've got a lot of construction going on. We've got a lot of construction going on. We've got a lot of construction going on. We've got a lot of construction going on. It's taken a while to get there, but it has started. So that's two old buildings that we have. Again, old houses that have kind of been repurposed, patched, and just for purpose. And that's what's going on. Wow, look at that thing. So that's going to be- It's beautiful. It was originally going to be three storeys, but we had to cut the budget back after COVID, costs below us and everything. That's looking at it from the top, as if you were standing at the top of the street there. Wow. The idea is that you'll have a lot of the the TWB social support stuff, client access areas will grow and floor. So places to meet the clients that aren't having a therapy room, all that sort of stuff will be grown and floor. And then up top you'll have, the RTO will have an increased training space up there so it will take on more students. And then you'll also have, there's going to be a board room up there and all of the admin function from here will go there. That will free up this building as well. And this is what the plan is when you look up the street. The central health concept, that's the existing clinic and it will all be linked up to the plus you have health and arts and everything around there. So that's where we're going with it. That's my artistic impression from the top. And it's now, Now, we've got the construction started. So this was just explaining to staff where we get the money. The urgent health managers and all that. And just in becoming an employer of choice. Workforce profile. We have 112 staff. We're round about there at the moment. We've got a few more positions. We've got a couple of agencies. We've ordered around there and we always try to be 60 to 75. We're running, right now we're at 68%. We've got a couple of other agencies that are really good for any organisation. I've not seen organisations get over 50 and they're really small. So we do a good job there. Also we've got a leadership development programme. I run a group of about 20 or so senior staff. But also look at the emerging leaders of the future. Who are they? And start working with those people. Promote people internally. And we've got an Aboriginal workforce strategy. To try and help people into the workforce. But also retain them and give them opportunities. So it's not just a... What I find a lot of mining companies just focus on bringing in apprentices. And there's no career path after that. So we save years and there's equipment. So we look at over three different levels. Assisting people to enter the workforce. Not breaking barriers to entry. Creating the aspirant culture. Giving promotion. And then we also have a strong leadership group. So that when people look at somebody who is in a leadership position. And go that person started where I am now. I can get there. And we'll also help people through things like if there's a more senior role that comes available. A lot of times people are scared to appear. Because gee if it doesn't work out then I don't have a job. So we'll redeploy you for six months and we'll keep your current job open. And see how it goes. If it all works out. I'll put somebody on a temp contract in your current position. If it works out. Well then we'll just appoint you into the senior role. And we'll put somebody into the junior role. And if you go. It's a more long term way of doing it. But I just find you have to work on those three levels if you're going to make it a success. Don't just focus on we've got three apprentices this year. Wow. You've got to look at the different levels. This was a tour of the world. We had a few little attitudes happening. One of the big unthinking things we talked about is skill versus attitude matrix. I would rather have somebody with a great attitude and a low skill base. Because I can teach the skills they can be learnt. So I can send them on training. Or somebody who's got a high skill level. With a really terrible attitude and just upsets everyone. And is difficult to work with. So we tend to look for people who are the right fit. And if you maybe need a little bit of training to get the papers, the tickets, whatever. We'll help you do that. And that's what we talk about there. People generally fit into one of those three categories. Can do's are those who have got the great attitude and a low skill set. They're just out there kicking goals all the time. Can't do's are the ones that have got great attitude and a low skill set. And they're the ones who train. And the won't do's are the ones that can't do. And the ones that don't do's are the ones that normally tend to be older people. And they don't know how to do everything. And don't want to work with people. And don't encourage them at all. This is the first leadership group that went through. We actually had, we contracted the leadership W.A. To come and do a specific design program for us. That was the first group. And we do this as an ongoing thing. We have different co-ops go through the year. Benefits of working with W.A. Just to remind people. We've got great hours. There's a whole lot of other benefits. We shut down for two weeks over Christmas. Yeah, Bill was telling me that. He loves it. You get two weeks pay. Yeah, it's awesome. Yeah, just looking at all the different benefits. And then we also talk about the expectations that I and the board have of you as an employee. That you are committed to the year's vision. You're not here for the year's vision. You're not here for other purposes, egos or whatever. You know, respect in the workplace. No working silos. And this one, the issue. Unhealthy workplace behavior. I can't stand it. Walking in someone's room whispering something in the corner. It's like, nah. Don't like that at all. This was talking about getting our systems in place. So, SharePoint, ComEx, biometric, all those things. You see that everything is there now. As we grow. You can just scale and expand into different building things. Same with your finance, you know, payroll, all those sorts of things. You don't have to now go and figure out, well, if we grow from 112, what if we turn to 100 more staff? You can just grow with the organization. So that's all in place and there. The marketing, obviously our branding was terrible. But we're doing a lot now. Yeah. And just working together towards. Bit of media. Yep. Cool. This was all just over the last two weeks. Oh, cool. And then, so this is what I put up for staff just to think about. Awesome. So, pretty much, hey guys, let's understand. And again, this is really to try and get people to understand why we're here. That's not something we're doing for the money. It's something we're doing for the people. So, you know, we're doing it for the people. And I think that's a really good thing. Yeah. Yeah. And I think that's a really good thing. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. So, this is not just a job. And a lot of people coming in don't even know what the vision is. It's just, oh, it's just a job we're just doing. But this is what I'm trying to get people to think about and why we're here. Extend life expectancy, yeah. There we go. Awesome. That's great. Kind of selling us back with it. That's awesome. Thanks so much. And is there, is there a particular. There you go. Yeah. Is there a particular question. Yeah. Yeah. There you go. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. near future thing that you're working towards that has to be done in a certain amount of time or what's your next? Well, the bigger 2020 Strat plan it was all on track to be done by 2020 but COVID hit. We got everything else except that last building and that got delayed I'd say significantly because we continued on with the design and everything throughout COVID and then when we started emerging from it came time to start construction and the quality surveyors came back and said oh, the original budget was 12 million and I don't remember there was all sorts of issues about supply of building materials worldwide and they've come back and because of all those things now we've revised your 12 million figure to 18 but it could even go up to 20 and just in the next year or so. So we don't have that much money so originally it was three storeys and it literally just stopped the entire thing start again and then we designed it in a different way so that we want the same capacity but it fits the budget that we've got as well but the short-term thing is right now it's getting that up and running because I'm still getting pressure by different funding bodies to take on new projects Okay, Brian, I try to follow up on this It's one of my major implications it's simply that with electric components they are are all slightly美味ous even though they're from not necessarily new you don't really use Singapore it gets punished it's just I think it's a very hard doing around okay we'll think about when that's all done and that's when our current scrap plan is focusing on is where we're going once we've got everything in place because we needed to put a bit of a pause on Viva's growth to consolidate and get everything right and now you guys as a board need to be thinking how do we grow in this place, which direction do we want to take and the storyline with your why. There's a lot of ideas and things that people want to do. That's why I've said I've got it because I'm the number one. Oh we need to get this, we need to get this, we need to get this in. We've got to get this right first guys. Get it right. Good job, yeah. Look at that focus, yeah. So I hope that's just going to be all of it. I'll let you continue. Yeah. Okay. We'll do some yarns. Okay. And then I've, yeah, I've definitely put my little pitch in for my next trip so yeah I'd love to connect up early on in the piece and we can, yeah, if you're keen on other stuff too, it's like content based, story based, always keen to help. Was that recording? This? Yeah. Yeah? I think so. No, no it wasn't. Sorry. I do sometimes. I didn't know you had that on. No, no, no, no. I'm sorry.",
  "themes": [],
  "themeIds": [
    "recs4S9Bkm5PzCPH9",
    "recR2V06B2puBESh1",
    "recb16V964CIZ0EdS",
    "rec73eIQDXCB8zNW7",
    "recxklmagDv4IeQvF"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}