{
  "id": "recdP9nFbb6GS3oq1",
  "name": "Sarah Mayers",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/4x5QIG0F8ZF",
  "summary": "Summary: The transcript features Sarah Jessica Meyers discussing her troubled past, including her upbringing in Tasmania, involvement in the welfare system, incarceration, addiction, and homelessness. Despite the challenges, she pursued education and worked in youth services to better herself.",
  "quotes": [
    "recgLySWixWk3UDZC",
    "recDpaiIIzTdSt7FO",
    "recg83lNBy3mzyNl7",
    "reclZ8q2RSbu8qfEJ",
    "rec2zevG1fGPJhT4E",
    "recROfZgVBKlaXdGy"
  ],
  "transcript": "# Sarah Jessica Meyers\n\n[00:00:00] I'm just gonna clap my hands because it helps me sync the cameras up. Alright, I think we're rocking. Just look at me. Yep. First of all, just your full name and spell it. Spell it? Yeah. Just say your full name and spell it. My name's Sarah Jessica Meyers. S-A-R-A-H-I-R-E-L-N. A and d No, I'm terrible at spelling.\n\nNo, that's okay. I wasn't expecting that. Sorry. Oh, that was a head fuck. I've gotta but my full name is Sarah Jessica Meyer. So just tell me a little bit about yourself at the beginning. I originally grew up in wa. I moved to Tasmania in 2006 with my parents through, I guess a relationship breakdown with my parents.\n\nI ended up in the welfare system. I, by the time I think [00:01:00] I was 14, I was a offending and hanging out with some not good so good people, which resulted with me getting incarcerated quite a number of times. By the time I was 16, I'd broken out of that cycle of bad behavior and I guess addiction.\n\nI suffered with addiction issues when I was younger and it's led into homelessness as an adult. So it's my story. When I was 19, I got into my first relationship and. We had a good relationship for a number of years before it turned sour. But through that period I actually went and did my youth work, cert four and ended up working for council for a little while.\n\nSo there's many bad things that I have experienced. I've always tried to do the right thing and educate myself in ways that I can better look after myself and the community. And yeah, that's what. Just tell me at any point, or you don't wanna answer something, [00:02:00] but what are some of those lessons you think that stand out the most from believe in yourself?\n\nI think that's the biggest thing that I've taken out of this, is that everyone has different problems. We all come from different walks of life, and sometimes you've just gotta be there for yourself instead of looking for outside validation. You should recognize that you are the most important person in your life and that only you can help you, I think a lot of people seek outside validation to help themselves when really it's about going inwards, not outwards.\n\nAnd I think that's probably the best thing that I've learned is to work on yourself. And it honestly never stops. You'll always be learning. But it's that courage to try and it's that courage to wanna do better. I think the one thing that stands out straight away from the first part of your story is, bravery and you being able to tell that story, I think that's important.\n\nBut [00:03:00] then there's also experience in which you pass on. What are some of the ways in which you are working to pass on your experience to support other people that might like you guys? I think just being there for people. I think experience wise I know what it was like as a young person, not to have someone there, and so I think just showing up and being present, being there for people when they need it, everyone has different problems my ability to help my only just be advice and sending 'em in the right direction with someone who has that.\n\nInformation so that they can make an informed decision about what they're doing and not make a decision based from fear and being alone. Because I think a lot of the time that is what happens. People internalize their struggles and they make emotional decisions rather than rational ones.\n\nI think a lot of the curriculum, I think if we taught emotional intelligence and things like that in the schools, it would help a lot, for people to be able to navigate their own. Problems. Yeah. I think [00:04:00] most of the population has a very surface level of these words. Homelessness or struggle or disadvantage.\n\nWhat is it, what does that mean to you? Are those types of are they stigma? Are they worth connect with? How's that? Me and my friends argue about this all the time because I think homelessness is a choice. You can choose to wanna be a better person or you can choose to buy into the addictions and these things that were fed by society.\n\nBut it is a choice. And like I said emotional intelligence and having the ability to make an informed decision got will take you a lot further. And so I think education at the very basic. Level is a fundamental thing that needs to change in our country because without education you can't make an informed decision.\n\nSo I think that is really where we need to start the reform process really of education and the curriculum and what we're teaching children and young people, because [00:05:00] otherwise we'll stay, we stay stuck. What is special or interesting about the stuff that Orange Sky is doing as a service? I think what Orange Sky is doing is amazing.\n\nI don't know if you guys have been to a laundry mat, but it costs about 15 to $20 to do one load of washing. And I think this service is good, it's economical. They're helping people that are in need. Yeah they're always here. They're such a nice bunch of people. The volunteers are awesome to chat to.\n\nI'm friends with a few of the girls, so I think I've come away with lifelong bonds, and that's important. Cool. What what do you like different people have different perceptions of what the impact starts. Like from laundry to connection, to conversation to that sort of stuff. What was it?\n\nWhat is it for you? A bit of everything, but I think the social thing is a big thing for me. I think when you are struggling, whether you are homeless or. Whether you're just introverted or whatnot, being able to have other people to talk to and to [00:06:00] connect with is very important. Everything is energy and it's nice to have people with such good, uplifting spirits to talk to.\n\nYou get into some pretty interesting conversations with these guys, so it is good. It's nice to have like positive outlook and people that wanna see you do well and wanna help. And like I said. I think 80% of any job is just showing up. It's just being present and not worrying about the past, not worrying about the future.\n\nThey're interested in the here and now, and I think that's very important 'cause so people, so many people get lost in the past or worry about the future and it's just nice to have people that wanna talk to you in the moment, want to see what's going on in your life and, yeah. Do you think it matters that everyone's a volunteer rather than paid like, differentiation between the service and what support?\n\nYes, because the people want to be there. There's a difference in, I think being paid to go and do a job and having people that are volunteering their own time and energy and support to come and [00:07:00] help people, it is because they want to be here. They want to help the community.\n\nAnd that ma it does make a big difference because. They don't have to be here. They're doing it off their own backs, and I think that's very important. Yeah. Is, are there certain things around being a female that's different in terms of disadvantage or struggle or homelessness in your life?\n\nI think it's easy to be a homeless woman than what it would be to be a homeless man. And I say that because I think men are always taught to protect women and to try and help and serve and that sort of stuff. So I think just in general, women are better looked after than men and it's just, it's sad, but it's true.\n\nSo I, I don't really think it, it's that I have a disadvantage or an advantage. It is what it is because it also comes with, I guess the safety aspect of being a woman. But that's pretty much the only thing that I would say gives me a. Disadvantage, if you wanna call it that. But [00:08:00] I I doing a fair bit of work in youth justice and Tasmania's in a fascinating position.\n\nNow the youth center is this weird transition where they dunno what to do. Do you have perceptions on what is the government role in how they support young kids when they are in that position? I was in welfare and I was also in that detention center eight times. Like most institutions, I actually think they're breeding grounds for people that are not doing the correct thing.\n\nUnfortunately, people, people hired very well. And the Ashley's youth detention center was a very sad thing because there were so many young people throughout that period that were taken advantage of. My question is, how come it went unnoticed for so long? And even though that they know with, multiple accounts and multiple people having been arrested for not good [00:09:00] things, I wonder why it has not been addressed and why it's still, why it still is open. Because they know for a fact there's been multiple incidences there where, children were molested and raped and all sorts of things, I don't really see that the government has done anything other than chuck money at people.\n\nAnd to me that's just kinda like hush money. So it, it's effectively just created a cycle of trauma for probably everybody involved. And I think the issue is the government per se, can't really do anything about those issues. We need people that. Have, like I said, the education level has to be, it has to mirror the issue.\n\nSo I think the first thing that they should do is probably get counselors, get the people that are experiencing trauma dealing with these traumas to work alongside those kids. At the moment, I think what's not being addressed is that, that they're not even getting the right service help.\n\nSo I think that's the first thing [00:10:00] to addressing the issue. I think you touched on before a bit, like again, there, it's how do you provide like agency for people to do it themselves and how do you create things that are around participation? Do you see any of that happening within the.\n\nSocial sector over, not really. And that's probably the problem is that the access points for businesses to be able to come together to help in social issues like this. There, there's no funding for it. A, as you said about the volunteer thing, it's gotta be people that wanna be there, but people that aren't gonna abuse their power in those positions.\n\nAnd I think that's vital for this cycle of trauma to stop. It's having the right people to come together, to work together, to close the gap, so to speak, to create a service that can then be funded by the government. But I think we in the community need to do that. Maybe the government can supply the funding for things like that, but [00:11:00] ultimately it, it's the community that has to look after the people, yeah. Alright. Sky started, there's two young fellas in and got pretty big. Yeah. How, do you have any recommendations on how you think they can continue to stay true to themselves as they continue to grow? Like they'll, there's obviously a lot more interest in them and money and stuff. Like how do they stay?\n\nClose to. I think staying with the volunteer program will probably make it very effective in the way that the people that will jump on board are all gonna wanna be there. I think in terms of expansion for Orange Sky most of the people that I do know that work for Orange Sky are in other job positions as well.\n\nAnd so I guess just utilizing the skills that they have from those other jobs, transferable skills. Yeah. But, yeah, ones that, are going to empower young people because I think there's a difference between supporting someone and empowering someone. And I think that's what's gotta change.\n\nWe've gotta stop this. [00:12:00] We support stuff in the start empowering people, that's, yeah. Are there it's always difficult to talk about like really specific things that changed. Like your course. Were there different things that changed your course along the way? You said you've been in detention a few times.\n\nLike there certain scenarios that changed your course, even the better or worse? I think the things that affected me were emotional. I. Response. I think I would deal with things as a young person and I didn't understand my emotions or how to handle them. And I think from a early age I dealt with a lot of trauma from a very early age.\n\nAnd so I didn't have, I guess the best peer support systems and I didn't have very good role models around me. I learned through that, or I learned through making lots of mistakes. That you shouldn't punish yourself. And education really does matter. You think it doesn't when you are younger, but [00:13:00] when you're 16 or 18 and you can't function as an adult it does reflect in both your behavior and the way you look.\n\nYeah it's still down to the, what we teach people is emotional intelligence. It's, making informed decisions, but you need education to do that. And unfortunately we have a lot of fake teachers now. I remember I dropped out of college basically 'cause I wanted to become an accountant, but the teacher that was teaching it had never worked a day in their life as an accountant.\n\nAnd I think for me, I started questioning these organizations and institutions where they were expecting us to come and give our time to get certificates, et cetera. But the people that were teaching us. These subjects weren't actually qualified to be teaching these subjects and had no life experience in those roles.\n\nAnd so I think for me it was the hypocrisy of it all. Was that you got all these people teaching you to go into this job, they'd never done the job. How can he teach me to do something you've [00:14:00] never done? So education really does matter and, yeah, and I guess what I said earlier about the having people that don't abuse their power, I think a lot of people are given power and a lot of people misuse it.\n\nSo that's probably what I would say. Last few words about like hanging around this sort of shift like experience, like what's it feel like for a someone that doesn't know what it's like to hang. So if you've never been to Salvos or you've never worked with Orange Sky for me the social interaction is very important.\n\nIt is giving me a safe space in the community to talk about. My life and the things I'm wanting to do. And I guess, like I said, having pe like different people to touch base with and that have the experience, they can give me advice and, they can support, but empower me to also do the right things, and I think that's very important. And I, without having, yeah, without having that, support and empowerment. [00:15:00] I think I would be just going in the same cycles and the same loops. So it's nice to have someone to break the chain, so to speak. 'cause it does matter. You, I think people don't realise How important friends are? I feel like recently I've had to cut off a lot of my old friends because I want better for myself or I want better for my life. And Orange Sky and the Salvation Army have been a big help in me being able to be on the straight and narrow. It's given me somewhere safe to come.\n\nIt's given me a whole new social circle. So it's been good and it's yeah it's helped me a lot. It gives me somewhere safe to go and somewhere, supportive and be, they do a lot for the community, not just me. So it is nice. Anything we didn't touch on that you want to talk about or other things that you Not off the top of my head.\n\nOkay. I think that's it. Yeah. Thank you very much. Thank you. It was very nice. You did such a great [00:16:00] job. I'm just gonna take a little photo.\n",
  "themes": [],
  "themeIds": [
    "recDAx0xCvemAuzCE",
    "recaozpouxqIVIRzT",
    "recia6XsNmGAaNtWQ",
    "recq063kDvkeZ4Kou"
  ],
  "shifts": [
    "recsVCxQUtq7S86eP"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}