{
  "id": "recDBAdVOVkM6gHbh",
  "name": "Dena",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Kalgoorlie",
  "videoDraftLink": null,
  "summary": "The transcript features a conversation with Dena who is the Social Support Manager discussing their role at Bega and the importance of Bega's work in the community. Dena shares insights on the impact of Orange Sky in providing laundry services and support to the community. She highlights the importance of community connection, hygiene, and dignity. Dena envisions expanding Orange Sky to more towns, training staff, and involving volunteers to further support the community. She also praises the quick support and efficiency of Orange Sky's",
  "quotes": [
    "recmU3MURnLKZ501U",
    "recMrmM7O5RE8AlCi",
    "recT513ud2BZgizhh",
    "reccPv7nhe0gPa0cR",
    "recq4dGngtiv8xIF9",
    "recZdY2crYKjMmH6w",
    "recOf7xggJo7nQ5x3"
  ],
  "transcript": "all right this is pretty good i think clap my hand sync it up let people know we're here all right so you just talk to me don't worry about this this is pretty like oh actually i'm actually supposed to be sitting on this side have you done this a lot oh i used to do it more than i um more than i do now yeah but um yeah i used to travel around on it a fair bit but i try not to do it as much as possible yeah cool so if you just say your name and spell it for me that's a good start for us yep dina d-e-n-a cool and last name rundle r-u-n-d-l-e cool tell us a bit about yourself first who who are you okay so i'm the social support manager here um i've been here at bigger going on 14 years so i originally started back in the days as a cleaner here um and then i went into a position at the sewn up center as a coordinator and then i came up to social support and i've been here for two years what do you think of like living here i guess like and just explain what it's um playing a picture of what the cow yeah born and bred here um my father's a tour straight islander and my mother's a domestic worker and i mean i've been here for quite a while now two years ago so i've a white lady. Married, I've got seven sons, so I've had two marriages. Just, yeah, it's home. And it's how you make it, you know. It's cool. It's so cool. Tell us a little bit about why you think the work that Bega does is important for this community. What are the things that you see that Bega can help with, I guess? So, Bega is very important for our Indigenous mob out there, for their health, their social wellbeing, everything. We have counsellors here, we've got the medical centre, we have a lot of little programs. Most of a lot of our programs is about educating our mob out there. A lot of our mob fall through the gap. I suppose we're here to be a voice as well for our mob. Just to be a voice for our mob. Just to be a voice for our mob. Just to have that understanding where our mob come from, you know. Things have gone up, which we've noticed. A lot of stuff has gone up. So Aboriginal families here, it's not just mum and dad and two kids, it's a house full. So if you don't understand it, it makes it very harder for you. Yeah, I think it's really hard for people, especially from urban city places, to know what it feels and looks like. Yeah. What's like the, like when you go and actually get to hang out with our community, how does that feel for you in terms of what you can offer? Like, do you feel like you want to do more or do you feel like you're doing enough? What's that sort of process like for you as a local person? It feels like I want to do more. And as Clive explained, we've got to just like, for the future, just to... See where we can put people in that there, because we are growing. It's just like when you're out, you're having conversations, you're yarning, you know, it's not about just sitting behind your desk. It's about getting out there with the mob, having a yarn, you know, like just yarning about anything, I suppose, you know, like, yeah. So important. Like, I've only been here three days, but what I've seen is like people coming together is very... Very important. And it's never in isolation. It's the whole family. It's like kids running around. How do you best support those types of situations and environments where everyone kind of wants to hang out in the same place? So what we do, as you know, we support Church of Christ because we've got a lot of little programs. And as I said, our job is to educate our mob about AOD, you know, mental health, homeless. We've got a lot of homeless here. It's just the best time of getting with mob is sitting around in a group yarning, putting a barbecue on. It just brings the mob in and it's just, yeah, it's just getting out there in the big groups. Cool. That's awesome. It's about this far to come through. No, you're fine. If you just come through, it's all right. Walk on slow way. I know. It was almost like it was like creeping in. See what's going on. Amazing. So tell us a little bit about the first time you heard about Orange Sky, I guess. It'll be a good start. So Clive mentioned it to me like back in the days. And it was something that he was like really interested. He sent all the information, have a look and I was like, yeah, Clive, we need it here. Let's see. And then there was conversation. I think Clive reached out to him and everything. And then as Clive said, a lot of things sort of slowed down a bit with COVID and just things that happened. And then Clive got in contact and then just from there, we just got it going and it's just like, wow. So it was a very exciting day, the day that it was here. It was at Church of Christ. It's just, it's about, it's everything. You know, it's not just about washing the clothes. It's about, you know, it's about, you know, it's about washing the clothes. It's about, you know, it's about washing the clothes. It's about, you know, it's about making people feel in themselves like, you know, you're fresh, your blankets are washed and, you know, a lot of our mob don't have places to wash clothes. We have laundry mats here, but it costs money to put it in. I wish that we could, like the Orange Guy needs to be like every town. We do have a lot of, like Lea and Raya and all that, they all ring through us and say, hey, can I ask you a question? And we're like, yeah, yeah, yeah. And then they all ring through us and say, hey, can I ask you a question? And we're like, yeah, yeah, yeah. And then they go, oh, I'm from the Orange Guy, come up here, like, you know. But we've got to just put things in place. Who knows in the future, we could probably get some up there. You know, I've heard they've spoke about they've got like wash machines on little trailers, you know, and everything. But it's about getting out there, engaging with the mob and just while they're washing their clothes, have a yarn. And it could be some mob out there, you know, like they yarn and say, oh, I heard you've got NDIS team there, you know, I want to know a bit more information. And then they'll come back and say, hey, they want to know about NDIS and that's when the NDIS team will reach out. So I think it's so important to be out in the community. Tell us a bit about Phillip, I guess. I've been hanging with him for three days. He seems like a legend. Tell us a bit about him from your perspectives of Phillip. Phillip is unbelievable. Good worker. He's out there. And I think also what helps more with his job is because he's connected out there. Everyone knows him. You know, he's got a nickname. Yeah. You know, like Blackfellow, we've all got nicknames. So sometimes we forget to say the first name. We always say nickname. But he's out there, you know, and seeing, seeing issues out there. It could be something that we could be doing here, you know what I mean? And then he might raise it. I'll talk to Anna, his coordinator, and raise it. And then we can say, okay, so we've got this program over here. So Orange Sky could be out, Boulder Camp, and we could get this program. Because their job is to engage with the community as well. Putting a barbecue on while he's washing the clothes. And we could have other programs there, like interacting and yarning and just, yeah. I would probably do a bad job at this, so I'd love you to help me. Can you tell us about the three locations I've been to? So Church of Christ, Ningamaya, and Boulder Camp? And sort of, can you paint a picture of what that looks like? So when we first got Orange Sky, we was thinking, oh, some locations. So Phillip actually tried some other places where there wasn't sort of people coming in, sort of. So first off, we had to sort of find them right locations. So Church of Christ, as you can know yourself, it's a place where we need to be, to support. Boulder Camp, as you know, they've got no washing machines out there, you know, it could be like for their blankets and everything. Ningamaya is another place. And then we've got our tent and our laundry. And we've got our laundry. And we've got our laundry. And this is sort of what I'm talking about, where we're going to be. And then we've got our So them three places are so important there. I hope in the future, like my another little vision for Orange Sky is that because we have a homeless team here as well, and they actually support people going into houses, Department of Housing, and sort of like support if they get like breach and everything. It could be where there's a big family there, you know, like it could be like a chronic, something happens chronically in the family. So in the future, I would really love Orange Sky to be able to go to based at some of these houses to work along with the homeless team. And, you know, set up and wash their blankets and everything because some of our clients out there in their homes don't have wash machines or they can only afford the tiny ones. So that's in the future. What struck me, it's a very different context from when I go to Ships in the City. And like, fellas are sleeping in tents with big blankets, with mattresses. And this fella came up to me yesterday in Inga Morrow and said he'd been scratching all night. Yeah. What's like the reality, I guess, for some of the community in Orange? Yeah. Yeah. In Boulder and Inga Morrow, I guess, in terms of their belongings. Yeah. And why does Orange Sky, why is it helpful? So I'll just use an example. So there was a family that was in a house, just saying in a house, and the family through the house came through. So we, so then DCP actually got in contact because they support the family. They said, oh, we know you've got Orange Sky there. Because the email sort of like was, yeah. They want to chuck everything away and buy everything. And you know, unfortunately it costs money. Where the family didn't have enough to buy like new blankets and everything. So we had the Orange Sky through the doctor. We've got an environment team here, two blokes. So they would go out to the house and do a bit of education around scabies where, you know, you don't have to chuck your mattress out. You can have them in the sun for three or four hours if you want. If you wash your blankets. And that's where the Orange Sky will come in and wash all their blankets. And you know, things like that, yeah. But even if we do go to, in the future to some houses, the Orange Sky will be so important. Like, especially for some of that stuff, that skin rashes and everything, because, to wash their blankets. Yeah, I got that. That's so cool. Yeah. What's, what's, what's the, what's the way to go about it? Yeah. So we talk about this idea of friends at Orange Sky. So that's terminology for people we support, our friends on the street. And we just released a podcast, The F Word About Friends. What's like, I know it's very different context in terms of that terminology of friends and community and culture. But what does that word spark for you, I guess, in terms of what you do, what Orange Sky does and that connection that people have at these services? Like, is that a relatable terminology or would you use a different term for that? Yeah. I think it's a really good term for what's happening, I guess, in terms of that connection piece. Like, would you use a different terminology of like, is it more community? Is it like connections? Is it, what's actually happening, I guess? Community. And community and connections as well. Orange Sky, it's out there. Everyone knows about it. Like, it's just out there. But mostly from the community. And, yeah. Your connections. That's cool. And like, we always talk about conversation, right? Like, I've been around, there's been so many yarns spinning around. What's that, is that a meaningful part of what Orange Sky, like, happens at these shifts? Like, how important is it to sit down and have a place to have a conversation, I guess? Yeah. So, look, I actually do get a lot of phone calls, as I said, from other communities about the Orange Sky. But you just, oh. Yeah. It's just, you just, it's bigger. If that makes, yeah, it makes sense. It's bigger. But you get so much out of it. I just don't know how, I don't know how to explain it. But you know what I mean? Like, Orange Sky, it is. It's about people's dignity. It's about your hygiene, you name it, everything. If you've got that, you feel so good in yourself, you know? You know, I know what it's like. You know, I've been out bush for like a week. I mean, I don't know how to shower for like three days. And you're like, ah, I can't handle this here. It does. It just makes you feel like no good. Then you get grumpy and everything. But just to know, I think out there people know the certain places where they can go. If that made sense. It's awesome. Yeah, yeah. Last little question. I can see from your, like, personality and your approach, you're a big visionary, a big thinker. I am, yeah. What's your big vision, I guess, for the next five, ten years in this place? If you can, like, yeah. I just visualise that we could actually have an Orange Sky in every little town. You know, it might have to be, it could be, it all depends on the size of the town, I suppose. Oh, gosh, I could just say so much. But I'm a big visualised person. I'm a big visualised person for the future. You know, the world, I don't say society is changing. I say the world is changing. You know, ever since we had COVID, it changed a lot of people's living ways as well. Unfortunately, we couldn't even, like, isolate people. Do you know what I mean? Like, separate. We had to sort of work with the whole families. But that's, we didn't have Orange Sky at the time. But yeah, I'm a, I like to think of the future. Yeah. And I know that, like, we're growing. I just like, we could just do so much. So good. That's amazing. Was there anything else that you wanted to say or something we didn't catch or like anything? No, just... Or a message for Jude? No. Jude, she's unbelievable. She's an amazing lady. Just like, she gets straight to the point. And I love mob that get straight to the point, not beating around straight to the point. She's a great woman. She's very kind. She's always there. You know, she's a good person. She's a good person. She's a good person. And she's a good person. And she's a good person. And she's a good person. Yeah. around straight to the point. Very supportive. So I have noticed like I know the orange guy needed to get a bit of maintenance done one time with the battery and it was like I walked at the front there and it was just like bang the people was here to fix the battery and I'm like they're faster than the um what is it RAC mob they're faster than them but it's just like straight on it straight on very supportive. I hope especially um because we're growing I hope that we also we're going to be looking at and I think Judith's aware of this here looking at training up some other staff as well to manage the orange sky and hopefully down the track we can also look at some volunteers that can jump on like you know at Church of Christ like when Tracey was talking about Steve in there um Kai but you know it could be where they just go out to with Phillip support because your own mob is helping your own mob so that's the best thing about it yeah so good all right you're gonna take me for a bit of a tour yeah okay",
  "themes": [],
  "themeIds": [
    "recN9d9alUKLGWvTQ",
    "recig6i3YRiH3kULF",
    "recWUr2Gz1yEXXwCV",
    "recRrtv1ZcrWR4WeO",
    "recTXHfdNBPXgrn6D"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}