{
  "id": "recDkJde48FDbt0G4",
  "name": "Tom Bowyer ",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Newcastle",
  "videoDraftLink": null,
  "summary": "Tom Bowyer has been volunteering for six years at the Christchurch Cathedral community lunch program, where they provide meals for those in need. He was encouraged to volunteer by his mother, who is the Dean of the cathedral. Tom finds joy in giving back to the community and believes in the importance of instilling a sense of social justice and volunteering in young people. He highlights the impact of connecting with others through acts of service and the positive role schools and organizations like the rugby club play in supporting and encouraging",
  "quotes": [
    "recjcTVgvC0eji4Pw",
    "recj6UVyvfhpVYgZT",
    "recAtV1HL2GQl15GT",
    "recvFdK5NeTYE0n7d",
    "recavAYCynPEnAO4w"
  ],
  "transcript": "I've been doing this for six years. I just love it, travelling around, talking to people. Yeah, yeah. It's such a cool vibe. Cool man, tell us your name and spell it's good too, just in case. Yeah, so my name's Tom Bowyer. B-O-W-Y-E-R. Tom's spelled the normal way. Clicked in and that's probably why it's wigging out on me. Cool man, I'm just going to go around here a little bit so you're looking at me a little bit more. Yep. Um, so bad at like making this perfect. I swear I'm way more professional than this. Oh no, it's fine. It's perfectly, you know, I'm big on behind the scenes. Oh sick. So that sort of stuff. Behind the scenes is my favourite thing. Oh yeah. Right, so. Can our brother tell me your name, sorry, and spell it? My name's Tom Bowyer. It's spelled B-O-W-Y-E-R. Tom's spelled the usual way. Cool man, tell us where we are and what we're doing here. So we are at Christchurch Cathedral and we are doing community lunch. So yeah, so this is a program that was started around 40 years ago. And it's to help people who are doing it rough in the community get a decent meal. So we run it once a fortnight. It's in conjunction with the cathedral, which is across the road. And we have also help from normally the grammar school, Newcastle Grammar School, but also sometimes this week, the Newcastle Wanderers Rugby Club. Cool man. Why do you do it? The honest answer is my mum told me. So my mum is the Dean of the cathedral and during COVID she, when everything was shut down and when radiuses were happening, she said, you need to go over there and do it. And I did. And I just fell in love with it. I fell in love with being able to give back to the community. Giving back to the community has been one of the big things in my life. I've been always volunteering, always trying to help people. And this just sort of started in Iceland. That's cool man. What's the community like here in terms of like, what's it feel, can you explain what it feels like when everyone's here, I guess, and engaging and that kind of stuff? Yeah, it just feels so great. It's seeing people come back and, you know, sit down and have a nice meal and they're talking with each other. They're sharing their stories. You know, sometimes they'll talk to us and there's one guy who every week when we're closing up shop, he'll come over and have a natter about the nights to me, which is great. And yeah, and also for the volunteers as well, because a lot of the time we've got kids from the school coming. And so it's great to see the kids sort of both get a chance to, to interact outside of school and do some good work and realise that this is what, you know, volunteering actually looks like. And yeah. That's real cool. Orange Sky's out there, what do you reckon about them? Oh, they're great. Great bunch of folks and also doing really important work. You know, people have to have clean clothes since Orange Sky have started coming here. It's just, it's been like a missing piece. You know, something that we really, because we really want to do more. And being able to say we can give you food, we can give you clean clothes, we can give you a chance to sit down and talk with the people at Orange Sky. And that's just been great. Cool. What's this theme of connection conversation, laundry, food, and then there's this whole other space of like mental health housing. What's, is there a connection point there? Is there like different reasons for like, for different types of services? Like, what do you think the, like does there need to be a connection between those things? Or can they be separate in terms of life, I guess? I don't really know. It's above my pay grade really. I'm just a normal volunteer. I guess what do you feel is important about the things here, like washing, laundry, conversation, connection? Like why do you think that's important for these fellows? Yeah, I think it's all about providing a sense of community, providing a sense of safety as well. So we get people bringing their, some guests will bring their kids here. And on one level, it's a bit heartbreaking because you don't want to see kids grow up with that sort of hardship. But another level, I sort of feel sort of a bit warm about it and go, we are that safe place. We are the place where they can bring their kids and they can go, our kid can have a nice meal here and a nice chance to, you know, interact with people. Let's go there. Why do you keep coming back, I guess? Like what keeps you coming back here and doing stuff? Like do you get old sometimes? You're like, oh, I shouldn't have to do this. Or is it like something you look forward to? It is something I look forward to, yeah. It's, there's something else I say to the kids. So sometimes if we've got a little bit of space, I'll give them a talk about why I do it. And I always say I do it because my mum tells me to. It gives me a great sense of security. It gives me a sense of smugness when I'm talking to my friends and going, oh, I can't catch up with you this weekend. I'm doing community volunteering. And the third reason is if people like us don't do it, then no one else will. We are, there are other places in Newcastle, but there aren't enough. And we need to be there to be able to say we can provide food, we can provide laundry, we can provide shelter. We can do this. And I say to the kids as well, it's not like if you're working at a cafe or whatever and you call in sick and go, oh, sorry mate, you know, can't come in today. And you know, you can organise someone to fill in for your shift. We have however many kids we have. We've done it with two kids. We've done it with 20 kids. What do you reckon the kids get out of it? Like from a life skill perspective, why do you reckon it's an important or a good thing for them to be able to engage with as a school student? I think being, having that sense of volunteering, community volunteering instilled in you when you're young age. I'm a bit biased because I had it. And so I remember when I was in high school, I'd come home from school every Monday and my mum and I would do a run of Aldi and just pick up huge bulk packages of food and cordial and stuff and then take it home and make it all up into little hampers and then drive it out to families doing it rough in the community. And I think that sense of social justice, that sense of going, we need to do this. We need to give back to the community. You see a lot of people these days, kids and adults who just don't realise that and think, you know, try not to look at this sort of stuff and go, you know, think it's really nice, but they don't want to do it. And I go, you've got to do it. You've got to try. It's so good to have like an excuse to create a show. It's so good to have an excuse to create a different type of connection with people that you might not stop and talk to. And yeah, I wonder what that does for the broader societal stuff too, right? A lot of kids get that experience from their school rather than just learning to be awesome themselves. Yeah, yeah, yeah. And what's the school's connection, I guess? Does it actively support kids to do this? Does it kind of sit in the background or what's the school's vibe? Yeah, so the school's really supportive about it. So most weeks in school term we'll have at least one teacher, generally two teachers come. They will really bang the drum and tell the kids, you've got to do this. There are some kids who will come in every week of the term. There are some kids who will only come in when it's their turn to come in. There are some kids who will come in during the holidays. And yeah, and it is that sense of they realise how good it feels to give back. Give back to the community and yeah. And the schools, like I say, really support it. And it's the same with the rugby club as well. So the rugby club, it's a bit different because they only do it once every three months, but there's some who come every time the rugby club is in. They'll come and they'll come back and go, this was so good, I want to do it again. Sarad. Well done, well spoken.",
  "themes": [],
  "themeIds": [
    "recc4WAionAJ4Hjn1",
    "recDwF59ImJ3CHXCk",
    "rec3Z50W5biq5XOYm",
    "rec48jXNvkuzCYoWb",
    "recyo2tTWL96mo5D8"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}