{
  "id": "recDIFM9HvLxUAzh4",
  "name": "Kylie",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "The transcript includes a conversation with Kylie, who talks about her experiences and involvement with a laundry service called Iron Sky. Kylie mentions her volunteering, community involvement, and thoughts on supporting the homeless and mental health initiatives in the region. She highlights the importance of community support and resources for those in need.",
  "quotes": [
    "recYK4a3tIfAFq9kQ",
    "rec5HBI2rq8v4rEyl",
    "reckOjKfSx7OAgXlC",
    "rec5Man3pQARprPGh",
    "recPZnMhU57YXHMyn",
    "recQ37x30ALNLF4J2",
    "recDTYiLsklflLHRU",
    "recqU7oOjBlev9l5w",
    "recGPhijSd8e1dqh9",
    "recqoVH7g7fJwS9ez"
  ],
  "transcript": "hands and just maybe tell your name for me and spell it would be awesome okay so my name is kylie oh i better put the mic on you that's going to be helpful because if it's in my pocket it's going to be absolutely nice so you put you put down your shirt here so on the other side so put it yeah so this is the magnet goes on the shirt bit so that one yeah awesome and that can go down like you can hide it if that makes sense oh uh it doesn't have to be real close but i think that's but i think that's totally fun cool so yeah so your name and spell it be awesome my name is kylie k-y-o-i-e cool and kylie tell me a little bit about yourself um actually come from west city mountains area um olive about orange sky years ago i was actually out of backpackers in the middle of sydney um that's how i found out about the laundry service they have food vans down there usually around dinner time so go down and get a free feed and do me washing as well so good and how do you find yourself here um i've got family that are supposed to be here and since covered a lot of people have moved um yeah so much has happened a lot of business has also shut down so yeah just everyone's in recovery mode um especially this year if we can have another year without covert um hopefully there'll be more gigs and events and stuff on so people can get out again and um what do you what do you do most of the day sort of the last few years like what's your what's your like stuff that you got um if i can i volunteer i have offered these guys a couple of times also a couple of times a week um most people don't close it they're just like so i'd like another year ago if i don't close it um so i've got another project i'd like um an album if i could right now this was coming out and actually it's been like a very long year and uh irish investment company who's making kits for the military subjective extension Centre for Women inzeniu to the National Law Firm floss their vib vot kilobit wah Fortnite, slotastelins andantics on марiam 19 a couple of times a volunteer. Sometimes it just depends on who it is. Sometimes they can be like really stubborn, like today, but the washing machine's kind of out of action, so yeah. Cool, and what do you think about the Iron Sky service? Tell us a little bit about your experience with Iron Sky. They've always been nice, always been good, yeah. That's cool, and what do you like the most? Is it the conversation, the hanging out, the like, what's your most favorite part? Yeah, you can hang out, you can have a chat. Also here at the neighborhood center, same thing. They have a little lunch on, so come up here, put your washing on, go get some lunch, and by the time lunch is finished, clothes are done. So yeah, and I reckon they need to do so much more for the community. They're a really nice community center. They do get donations, they do get business grants, but it's only just helping out our community, so yeah. So true. I do what I can to donate. I'm only on a pension, so it's very little what I can donate, but still, it's something, and something's better than nothing, so. And what do you think the community should be able to do? How can they help more, I guess, to be able to support this stuff? Well, there has been a bit of a debate about it. There is a building here that's out of commission. I thought that they would have it for the homeless. I don't know if they did or not. So, just working with the homeless and trying to make sure that there's something for them. Try and make sure that there's a safe place to stay. I know. I know other places that have done it and it's only like for a day. You can only stay there for 24 hours But it's a step to recovery. It's a step to link to home Some people don't even know what link to home is because it's their first time homeless Yeah, just get like some kind of temporary service more available. Yeah So what's um, what's one thing you think that the community can do better when it comes to a general understanding of? People doing it tough in the region like is there things that people can do that's like All this money that's supposed to go into the mental health system Where is it? I mean attacks within three days Problems both of them include weapons I have had my mental health problems, but I've never had anything like that. I've never done anything like that And I just reckon we need more Just like more security measurements I mean, I've never done anything like that before Cool. That's awesome. Let's go",
  "themes": [],
  "themeIds": [
    "rec7Etho7sPL3lFpO",
    "recHIwKYRHSEhlYwM",
    "recFkwSkHdzamfnvE",
    "recHBmPUjoGk0gGWK",
    "rec9RX2hcmrhpa1GR"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}