{
  "id": "recEysGOySC7XZfaH",
  "name": " Greg Cooke",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/FAnzmwrFzfr",
  "summary": "Greg Cooke is a retired individual who started drawing 10 years ago. He enjoys traveling during winter and recently visited South Australia. He first heard about Orange Sky on TV and found it intriguing.",
  "quotes": [
    "recBz86zogZriz2z6",
    "recPmkLnKNXIlJCE9",
    "recfBohBYjRSePLEw"
  ],
  "transcript": "# Greg Cooke\n\n[00:00:00] \n\nAll right. It's rat testing. Testing 1, 2, 3. Can you hear me? Yeah, we're on. I can see you. Check one, check one, check one. See you moving up. Oh, wait. No. Screwed it up. I knew something was wrong.\n\nNo, again. Okay. That's better all. So just your full name and spell it out for me to start off. Full name? Yep. Greg Cook. C-G-R-E-G-C-O-O-K-E. Oh, see, I would've got it wrong. Mm yeah, that's right. Yeah. Alright, Greg, tell us a little bit about yourself first. What's a little bit about yourself that you find is exciting or the most easiest thing to say about yourself?\n\nExciting. Uh oh well. I'm retired, uh, retired probably about, ooh, 11 years ago and started drawing sky probably about near enough to 10 years ago. [00:01:00] Um, yeah. Uh, you are talking about the weather here. I don't enjoy the winters here. Yeah, so usually go away. Um, and uh, this year I've just come back from South Australia, did all the peninsulas, uh, which was pretty nice, but very, very dry.\n\nAnd I'll probably be here for another oh month or so, and then I'll probably try and head north, um, up north New South Wales, Queensland. Get out of the weather. Hmm. Awesome. Yeah. How, when, when was the first time you heard about Orange Sky? Uh,\n\nuh, it was. On tv. It was bizarre. You know, I, I was just sort of switched it on and, um, I think, uh, uh, Nick and Lucas were on there and they were talking about Orange Sky, and I said, oh, that sounds pretty good. And then they [00:02:00] said it was, um, they were recruiting in Hobart. So I went to a session here and I think I was, you know, I was one of the first, um, on one of the first shifts.\n\nUh, so went there was where, you know, Robin was there and a few others. And, um, so yeah, I thought it's pretty good, pretty good sort of setup. So that's why I decided to come here. Mm, that's job. Um, all these years later, you still pumped about it, your crew and stuff. Yeah. Yeah. Love it. Love it, love it. Um, yeah, the crew that we are with, we, you know, is just awesome.\n\nWe just really get on just super well and we probably have, you know, fairly disparate sort of, you know, uh, bunch of people. But yeah, we've got something in common, I suppose. Um, we've both got the same sense of humor, same sort of commitment, I suppose. We, we love it here. Um, yeah, he gets to know the [00:03:00] characters, uh.\n\nAnd it's an ever changing landscape here. You've got a lot of people who leave who you know who've left and you know, some have left and come back. Yeah, no, it's good. Tell us about, do you know us about this place and what it does and its history and stuff, or? Uh, not a great deal. I know that it was a sort of a, um, uh, well, Rus knows a fair bit more about it than me, but, uh, it's, uh, had various guises, you know, it was a mansion for a while, and then I think, uh, there was a mother and babies um, uh, place, which was over in the gray building over there.\n\nUm, but yeah, I dunno th the full history of it, but yeah, I think it's gone through a few changes and likely to go through a few more in the future. So don't really know the, the future of it here for us. Uh, but I suppose we'll just hang in there for as long as it takes [00:04:00] really. Mm-hmm. That's tough. Um, what do you think the, like, overall impact of this orange sky thing is?\n\nLike in terms of all of the things it does on different, like ways in which people interact with the van from volunteering to friends, doing washing to conversation, is there something that stands out for you as more important than others or, uh, yeah. Well, I, I think it's a conversation. Look, we, we have people who come here and just sit down and have a chat without doing any washing.\n\nSo I think that's a, you know, a bit of a mark of how important it's to some people. Um. But I suppose it's a bit diff bit of a different shift to others, uh, in that we're people's residents really. Uh, whereas a lot of other people actually have to travel to come to the van. Whereas here, um, they come often, they drop the washing off and then go back to their room and then come back to pick it up.\n\n[00:05:00] Um, but I think we are important to a lot of people, eh. Hmm, Hmm. Um, how have you seen it sort of shift and change over the amount of years you've been volunteering from, like, what it's like in Hobart to nationally? Do you feel that stuff as a volunteer, I guess? Um, well, I'm not sure. I dunno much about the national scene.\n\nI, apart from the newsletters I get. Um, but, uh, yeah, I, I suppose it follows a similar, similar sort of path. Um, yeah, I don't know. Don't really know. It's, it's interesting, like, yeah, so I think some people would like want to know and be fascinated. Some people are keen just to like do their thing, right, like on shift and yeah, I was talking with Robin and I think she's a bit more connected with like what's happening in headquarters and understanding what that sort of vibe is, whereas other people are just.\n\nPumps to do [00:06:00] their thing. Yeah. Well I think that's, that's, that's probably right. Um, I suppose Robin of necessity needs to know what's happening nationally. But yeah, I just turn up every Monday, have a few chats, you know, do a bit of washing. Yeah. Really enjoy it. What's your fascination with like traveling around and doing stuff?\n\nLike does that come from somewhere or is that just. Something that you are connected to or traveling around? What? Just yourself. Like what's, yeah, what's the fascination with like, leaving over all the time and traveling around? Uh, I, no, I've always done it. Um, like I've been back here for, well, uh, 25 to 30 years, but I've, you know, proof's lived in the Northern Territory and I've lived in Adelaide and Perth and yeah, I, I dunno, I just like traveling.\n\nUh, so, you know. Traveled in various ways, like did fairly long motorcycle journeys, um, and uh, and then got into [00:07:00] caravans. Now I've sort of got VV dub combi and we, we travel in that. Yeah. See Steve very mate. Yeah. No, I just, just, just love going different places really. And, and as well as getting outta the cold.\n\nYeah. Just have you got, um. Some favorite places that you've been? Um, yeah, probably Northern New South Wales. Um, and I suppose Cairns, because I know people up there, so we got up there fairly regularly. Uh, yeah. Um, we, well, the last trip we, when we went to South Australia, we were gonna continue on to, to wa but, um, we got to Australia and just spent too long there to actually get, get over and back in the, in the warmer weather.\n\nUm, because, you know, we want to get outta the south. As you know, me and my partner want to get outta the south, as you know, before it gets too cold. Mm-hmm. That's cool. [00:08:00] Um, anything else we didn't touch on that you reckon is important or about yourself or in sky? Uh, no, I don't think so. Nailed it. Yeah, pretty much.\n\nSo, yeah, just, yeah. Enjoy coming here every Monday with the crew. Um, yeah, that's about it. Awesome. Okay. Take a picture.\n",
  "themes": [],
  "themeIds": [
    "recTPWQ0cDrYsbLLZ",
    "reckD68DhJ6v5gJG1",
    "recWZLVIPuehJxCO8",
    "recm5sWuAQyxKgxfr"
  ],
  "shifts": [
    "recyMRTWqgsYHr8VP"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}