{
  "id": "rece36Yk191YwcIuL",
  "name": "Julie Jauncey",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Adelaide",
  "videoDraftLink": "https://share.descript.com/view/7qW2nxgBg17",
  "summary": "Julie Jaunty, a former nurse in her mid-fifties who suffered a stroke four years ago, discusses the challenges of losing function in one hand and the importance of services like laundry assistance due to her limited mobility. She highlights the difficulties faced during the last four years, particularly exacerbated by the Covid pandemic, but expresses gratitude for finding support at a local service center that offers meals and companionship.",
  "quotes": [
    "recTC321v80EqVQ0b",
    "rec8Ga2BNmYFWQ2Pr",
    "recvIPumhXUb8H7UV",
    "recKQAqypVS8ISpAg",
    "recYJF0TP33D6NlBL"
  ],
  "transcript": "# Julie Jaunty\n\n[00:00:00] \n\nOkay. Alright, so just your full name and spell it. Sorry, one more time. Yeah. Julie Jaunty. J-U-L-I-E, jaunty, J-A-U-N-C-E-Y. Tell us a tiny little about yourself first. I'm in my mid fifties. I used to do nursing. I gardener unexpectedly had a stroke four and a half years ago. Otherwise, I wouldn't be coming here today 'cause I've lost function in one hand.\n\nAnd even though I've got a washing machine, having this services invaluable because I can't take online or go up and down steps. So unlikely people are using this service. I really appreciate it. That's cool. Casper, what are you doing? What's what's the last few years been like? The last four years have been a bit crazy.\n\nEverything was blamed on Covid. I had literally my straight, literally when Covid happened, all the hospitals got closed down and services. So it's just been quite difficult accessing services. I've just had to work out different ways of getting things done that I had to, thankfully, because where I used to [00:01:00] work.\n\nI knew we used to get a lot of people up and moving, so I know you've just got to keep moving and grooving and yeah, that was really fortunate. Tell us tell us a bit about the, how you feel being at shift is what, like what sort of shift? Six shift. Oh. I come here on I've only really been coming here the last couple of months because I didn't know about it beforehand.\n\nI found it very helpful. They do a meal, it's like a little camaraderie with a few of the guys that seem to be fairly regular and nice. We've got different ladies that volunteer here, but they also seem to be in a roster. I've seen a few of them a couple of times, and it's just nice to know the washing is washed and dried and I've set for the week.\n\nSuch a simple thing, which for me, I can wash that. I cannot go up and downstairs or hang on my clothes line. So it's been like a massive life save. It's been very helpful. What's the connection like for you here? Like how.\n\nI am like, like I said, I've only been a few months, but everybody seems to [00:02:00] be unusually nice. I was, a bit hesitant. I'm thinking, oh, what sort of people gonna be here? But there's a lovely experience. You've got the regulars, so then you've got some obviously homeless people or people traveling around Australia, whatever.\n\nI'm, I have been surprised that there are people that are literally a holidaying and just i'm living rough for a few weeks so I can get to wherever use the service and that's brilliant. I didn't even know this service existed myself beforehand. That's cool. And what's the, what do you think the main takeaway for you is in terms of what orange Sky does as a whole?\n\nIs it, do you think it's more about the washing, the people connecting the services? I actually. See it's, I do appreciate the washing and especially the drying, but it's the actual, the way the ladies and I've mainly had ladies, we've got she got to, but they just treat you with so well, like you are like bonus friends.\n\nAnd it's just that comradery with some of the workers or volunteers and the the regular people. It's just, I'm really surprised by that. [00:03:00] So That's wonderful. That's good. What, how would you 'cause people struggle, I think to understand what homelessness is, what struggling is, what disadvantage is.\n\nYeah. How do you represent yourself? I guess in that big picture of things, I find myself unusually disadvantaged. I wouldn't have thought I'd be disadvantaged five years ago, but I had a straight four and a half years ago and you cannot access services and so that just made it very difficult. I know I can speak okay, but I walk quite weird and hand functions and what it used to be, so unlikely people.\n\nReally need this service or can access services, but everybody says, oh, wait to go on NOS or wait to. Those things take years and you've gotta get your washing done every week or two weeks. So it's really good to have that service in between. True. And what do you think about life as a whole in terms of the community?\n\nDo you see a lot of struggle or, yeah. I live from Elizabeth, which is like a disadvantaged suburbs supposedly, and I [00:04:00] do see a lot of like homelessness in parks and people going to food vans and all that sort of thing. But I'm. I've only got my advice point of view, but I just think there are a lot of, if people are hungry, especially you can always get food.\n\nBut getting washing done or home, like I know people that are living in cars or doing the couch surfing thing. I. I've got a friend who has only moved to the country. Two years ago she, her and her mom were in long term rental, 19 years. So they presumed it was like their house. They were given three months notice to move by the landlord and they just couldn't afford a place.\n\nSo they bought a dumpy house, middle of nowhere to to stay for roof over their heads. So unexpected people can be homeless. So true. What's it's always interesting to get your take on what this shift is like. So could you walk through how that, how it happened in terms of like A, how did you know about it and then B, what does it feel like?\n\nWhat's it like to be Okay. I heard about like paddle jumpers can paddle [00:05:00] jumpers, and then they, other people told me about the orange sky van, which I thought was very. Help, helpful. I didn't know about it beforehand. I don't use the internet or Facebook or all those sort of normal things 'cause of my funny hand.\n\nSo I was unaware. I'm quite sure that there's advertising, but I just wasn't aware of it. Cool. And what's it what sort of a normal shift look like for you? Normally people try to get here five o'clock for for when the sort of lineup with their washing and the van turns up when it turns up and people are quite happy then people.\n\nYeah, it just seems to be the routine. You get your spot, van turns up, gets something to eat, and then you come back and have a chat around the back of the van. It's mainly being a lady, so it's nice. That's cool. That's awesome. Is there anything that you've always wanted to talk about around Orange Sky yourself that we didn't talk about?\n\nI would like to know how you can advertise it to other people who wouldn't. Like I didn't know about the service point. Who wouldn't normally? [00:06:00] No. 'cause I wouldn't have, I've got a house I wouldn't have considered myself homeless. I wouldn't have known that I needed hands with washing or mainly hanging out.\n\nSo yeah, I don't know how you can actually inform other people. It's a great service. I've been told they go to different places on different days, but I don't quite know if everybody who needs a service knows about it. Seems to be a few regulars turn up, but not other people. Awesome. Such good feedback.\n\nNo worries. I'll I'll have to, yeah. I think the idea with this stuff is like your insight Yeah. And your knowledge Yeah. Is way more than anyone could ever Yeah. From Bruce Head office. Yeah. It's super helpful. Okay, great. Good to help. Thank you. I'm just gonna take.\n",
  "themes": [],
  "themeIds": [
    "recvp4CQ7rL8b9zBr",
    "recUuTlmoh55FXsJq",
    "recXGZRuZ58tYjDv6",
    "recBSDaQsPcLnaSoz"
  ],
  "shifts": [
    "recD94IKMO1jm0cfS"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "recHDNVOx53dumsgK",
    "recwUU5lk0puPxkl9"
  ],
  "storyCount": 2
}