{
  "id": "recEUJjCs4btgr7wM",
  "name": "Kellie Knight",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Rockhampton",
  "videoDraftLink": "https://share.descript.com/view/z605sEeU8Ef",
  "summary": "The transcript involves an interview with Kellie Knight discussing her life, volunteering for Orange Sky, and connecting with the community. She mentions her work, family, and how she got involved with Orange Sky through a friend.",
  "quotes": [
    "recXONVlbctB1f54b",
    "rectBvaRLK7ZExloA",
    "recDbJV5esoAoQPkz",
    "recS7Rmik57769Gcp",
    "recqxDbV1xAKlg9MP"
  ],
  "transcript": "# Kellie Knight\n\n[00:00:00] \n\nThis is pretty good. Okay. I'll cut my hands. That helps me. I forget to do that. Um, cool. So just your full name and then spell your full name for me. Full name is Kelly Knight. K-E-L-L-I-E-K-N-I-G-H-T. Do you know something pretty funny? My sister's name is Kelly Knight. Really? Yeah. Wow. And does she spell it the same?\n\nThat's the first time it's happened. K-E-L-L-I-E and she spells it the same. That's amazing. Yeah. She, she lives in Christchurch. Oh, in New Zealand. Um, she's 44. I'm 44. Yep. 1991. Okay. Getting, just blowing your mind, getting, getting weirder. Are we, let's ask some questions and see if there's any more things, because tell me, tell me a bit about yourself.\n\nOkay. Um, I'm a mother of three. [00:01:00] I work for, um, government and on my days off I like to volunteer for Orange Sky. So good. Um, tell me how, how did you first hear about Orange Sky? I'd heard about Orange Sky a while ago, and. Brian actually got me into it. So I know Brian through touch football and I was talking to him and he told me he volunteered and he said, why don't you come on down?\n\nSo I came on down and we started volunteering and I love it down here. I love meeting new people, I love helping the community and you know, people like Rebecca and her dog club, it's really lovely and you get to connect with people and put them in touch with other services and yeah, I think. Gets really important to connect with community.\n\nAnd so, you know, people who are homeless and who are really struggling, um, you know, have that ear or that person that they can talk to. And I love listening to [00:02:00] people hearing about their lives and, you know, we've got the salvos here and so they can go up to the SBOs and have a shower and connect with their services.\n\nAnd it's just a, it's just a great organization to be involved with. Um, and more doggie. Another talking. See, this is cool. It's classic. Yeah. Um, what's like, um, do you know much about like the area and about like, um, the level of disadvantage and stuff? Is that something to open and, yeah, so I've been in Rockhampton since 2000, so 25 years I've been here.\n\nSo we do have, I dunno, I swap. I, I don't know the percentage of homelessness that we have here, but there are definitely a lot of homeless. Um, so over at Kershaw Gardens we've got homeless bank as well. And so people are doing it tough and particularly this time of year it gets quite cold. Um, and so [00:03:00] if we can help people clean laundry and then they can go out for a shower as well, it just means that, um, it gives them that dignity and gives them.\n\nYou know, that head start for their day, if they need to go out and about, they've got clean washing, they've got a shower, they can get some food up at Salvos. And yeah, so it's a really important service that we offer here. I don't know of many other services that would offer clean laundry services. Mm, yeah.\n\nWhat's the, um, do you think about. The way in which the organization runs as well as the support it offers. Like I guess if you work for government, you've obviously got a lot of procedures and stuff that happens there. Yeah. Is that something that's noticeable at Orange Sky or is it pretty seamless?\n\nWhat's the difference between your work and Oh, my work, I guess? Yeah. It's pretty, um, so I work, yeah, obviously in a quite regimented [00:04:00] area of the government, so. To come here. It's, it's fantastic because yeah, there are obviously policies and procedures here that we follow as well, just to keep us safe and keep the members that come here safe as well, our friends that safe.\n\nUm, and so, but it's great because, um, it has that flexibility that we can put them into, um, contact with other services and we can sit and have a really casual conversation with them and, um, you know, find out about what's going on in their lives. Try to help them the best that we can. And is there like levels of the way in which Shine sky operates that are better than others from an operational perspective?\n\nLike is there things that you like more or less, like the way in which it operates or is that noticeable at all or? Um, I think it operates, it's, it's pretty seamless the way it operates because you've got the check-in facilities for us as volunteers. You've got the website, which is a fantastic website.\n\nIt's got lots of information. Um. And [00:05:00] then you've also got, um, I guess we're open for two hours. So you've got people that are coming within those hours, and then if they can't come on Friday, we've in touch with, um, like our services on a Wednesday as well. And VOS is open I think almost every day, so we can send them up there as well.\n\nSo, cool. Yeah, it's, it's run very efficiently for an organization that started, you know, 10 years ago by two fellas who probably had no experience in doing what were doing, had no experience. Like, it blows my mind that two 20 year olds who, you know at that age, they're normally out, you know, traveling or partying and they had the initiative to, to start up an organization with this vision.\n\nI think it's just fantastic and the fact that it's grown and still going 10 years later and. It's grown to where it is run fantastically. Um, and we've got, um, a few leaders that put everything together [00:06:00] behind the scenes to make it pretty effortless that we just turn up, log in, run the two hours, and then we can go about our day.\n\nSo yeah. There's a lot that goes on behind the scenes that obviously I'm not aware of. Um, do you have an idea of, I always think about orange sky as kinda like a triangle of things where it's like there's clothes and there's conversation. Yeah. Um, and then there's like connection. Yeah. What's one of, what of those things do you think stands out more for yourself in terms of the impact that IPI might have?\n\nI think connection for sure. Because if you think about the people that I guess are coming here. Have a lot of opportunities to connect with people. Um, so to just sit down, have a talk, have a cup of tea, cup of coffee, and just talk to them, I think that's more impactful. Uh, and just being empathetic and listening, not judging, um, that's probably the most important thing.\n\nI think that Orange Sky offers. We offer laundry services and then the places down in Brisbane and bigger [00:07:00] places off the showers and, but um, next is really important. I think we're all. Living in a community together. So you need to have that, um, connectedness of people. Um, our guys's grown a lot and there's remote stuff there, New Zealand, all these things.\n\nWhat's, yeah, do you have an idea or. Perception of what balance they should take over the next 10 years to get that ride of like growing, but staying connected to the volunteers and the friends. And is there a better way to do that, do you think, or? I think, um, the more that they can expand into the rural communities as well and into communities where they have high homelessness statistics, um, because I guess the further north or west or that you go into those remote communities.\n\nThese, these services, the services I guess that are offered in general probably do die off because there's volunteers aren't available, resources aren't [00:08:00] available, the funding may not be available, so the further they can expand, and then I guess if they have the ability to expand, then other services.\n\nMay also be able to come in as well. Mm-hmm. Um, so I think that would be really important if that vision for the next 10 years is, okay, well, where can we get to that we're not already looking at or not already engaged with, um, some of the indigenous communities up north. Mm-hmm. That would be amazing if they could go to those communities if they're not already there.\n\nCool. Yes, that's about it. Anything else that you wanted to make sure you said It's a great organization and I'm really happy to be a part of it and Yeah, it's, yeah, it's where they've come from to where they are. They should be very proud of their effort. That they're making. And then without the volunteers as well.\n\nSo all the people that continue to volunteer, like we, we keep getting people that wanna put their hand up and come and so to meet them and to help out. It's, yeah, it's a fantastic, um, organization to be part of. [00:09:00] Well done Boys for starting that and plenty of smoke. It's good that we've got that in the background.\n\nI'll send that.\n",
  "themes": [],
  "themeIds": [
    "rec6mtSPqh26h1Vgi",
    "recPvtim61D4OkC9o",
    "recefzkcZ7rdootrh",
    "rec2Lv17pAubeF0FO"
  ],
  "shifts": [
    "recCNOxNimkdXbQWq"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}