{
  "id": "recEqMGbypnLAETSQ",
  "name": "Georgie Ibbott",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/Paxf9SZ8bw0",
  "summary": "Georgie Ibbott, a Tasmanian native, discusses her involvement with Orange Sky, a volunteering opportunity she found online and joined easily. She speaks about her experiences doing laundry for patients at a hospital for the past year or so.",
  "quotes": [
    "rec7P59djBvGHvLtA",
    "recqqrPw1bPPxv5q4",
    "recgoMJ6VBe15wek2",
    "recD4lI1R8R3AfDyj"
  ],
  "transcript": "# Georgie Ibbott\n\n[00:00:00] \n\nGood. Yeah. Don't feel like it's like a test or anything going on. Okay. Good. Just talk to me. Don't worry about this thing that's there. Sure. Just your full name and spell it first. Actually with this, sorry. Do you mind if I give it a bit of a j Sure. Oh yeah. It's a wild thing. So you can go like that.\n\nOh, there you go. Oh, easy, sweet. All right. Cole, just your full name and spell it first. Georgie Ebit, G-E-O-R-G-I-E-I-B-B-O-T-T. Rad. Let's talk bit about yourself first. So I'm a Tasmanian born and bred. Worked and studied here my whole life, and think Tazzie is an awesome place to raise my family and to live and grow old.\n\nSo good. It's wicked weather at the moment. Yeah, it's pretty good, isn't it? Yeah. Rolling. How'd you feel about Orange Sky the first time? I was looking for a volunteering opportunity a few years ago, and I just did some Google searching [00:01:00] and orange sky came up and it was really easy to volunteer.\n\nSo I just jumped online and answered a few questions and then did the online induction and. Training modules and signed on. So it was just very straightforward. Whereas some of the other volunteering opportunities that I looked at were a bit tricky and seemed a bit complicated. Yeah. Tell us a bit about this shift and how, so we've been coming here to the Atch Hospital for maybe a year, maybe 18 months.\n\nAnd so we do laundry for the patients who are here, who are often staying here for a long time getting rehabilitated from different injuries and diseases and stuff. And the laundry that we do for them is for the people that don't have access to friends and family to do their own laundry. So most patients here would have people coming and going and checking on them and doing their laundry, but yeah, we wash for those that [00:02:00] don't.\n\nWhat's do you have much engagement with them? So they hang with them, or is it just no, unfortunately we don't, A lot of them aren't that mobile they don't come down and hang out with us, unfortunately. Sometimes we do or we see them if they're going for a walk with a occupational therapist or a physio or something and they'll come and say hi and thank you.\n\nBut no, we don't hang out like we would another shift. What what impact do you think it has on them in terms of. I think it's huge because otherwise they have to, would have to pay a pretty hefty price to get it done through the hospital and it's not very efficient. And a lot of people that come here are on low incomes and pensions, so yeah, having to pay top dollar to have your washing done would be a big yeah, take a big chunk outta their budget.\n\nIt's something I. Never even thought about that. If you're in hospital having your laundry done. It almost seems a bit weird. Which [00:03:00] is, yeah. Is, and what part of Orange sky do you think is one sort of element of it, of all the other elements around washing, showers, community and stuff, which ones resonate with you the most and why do you keep turning up, I also volunteer at a shift in North Hobart on a Wednesday. And my reason for volunteering is actually the connection with the friends that come along. I get a lot out of hearing their story and just being there to listen to them and, chat to them while they're having their laundry done.\n\nSo that's, I suppose the reason I do it. Coming here, obviously we don't get that interaction, but the staff that we interact with are really grateful. And whenever someone new walks by, curious people ask about it, and it's just really nice to be able to explain the orange sky story and what we do and how the shifts are different and at different locations.\n\nSo yeah, pretty cool. ICO skipped over 10 years of service. What's I always, I'm trying [00:04:00] to ask people this over the next 10 years, what do you think is important for onco to consider? Is it growing, is it staying the same? Is it like doing new things? What for you do you think would be most important?\n\nI think just focusing on what we do and what we do well. And that is just the base. Service for people in need, so doing the laundry and the support and the chat. With the friends that come along I think really important is valuing volunteers and making sure that all volunteers are welcome and it's really easy to volunteer here in Hobart.\n\nWe have issues with getting volunteers and getting people to hang around. So I think that needs to be our priority to make sure that we have enough volunteers because without. People like me, we can't do run shifts and we periodically have to cancel shifts and because of lack of volunteers. So it's really important.\n\nSuch, yeah, such an important part of it. [00:05:00] Cool. Is there anything you've always wanted to say about R Sky allowed the chance to, that you always want to, or to anyone interested in volunteering? Yeah. Get on board it's so much more fulfilling and more rewarding than I ever imagined. So I, yeah.\n\nJump in. See more volunteers. Yeah. Wouldn't that be good? Yeah. Yeah. All right. That's it.\n",
  "themes": [],
  "themeIds": [
    "recHm3qv4mPNReP4a",
    "recjbjSD3KHH9WdPG",
    "recXKggUn5qpbGNw0",
    "rech5uUR7XupQW8S5"
  ],
  "shifts": [
    "reciujrc8C65VYFX4"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}