{
  "id": "recGKnkEoH8wUP8nX",
  "name": "Kelly Benjamin",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "The transcript is a conversation between two individuals, Kelly Benjamin and an unnamed person, discussing their involvement with Orange Sky, a charity organization providing hygiene services to the homeless. Kelly talks about her personal background, her motivation to volunteer, the impact of volunteering, and the sense of community and friendship within Orange Sky. She also praises the organization for bringing people together and giving back to the community. Both Kelly and the other person express admiration for their fellow volunteer, AJ, and discuss the importance of empathy and helping",
  "quotes": [
    "recBFwTXvcCV00aFx",
    "recr0yoQOye7XOf4R",
    "recXsFWiBHa4HKEGv",
    "rec02as521lI4GuYF",
    "rechs50ycndweoF0e"
  ],
  "transcript": "So your name and spell it is first? My name and how to spell it? My name is Kelly Benjamin that's K-E-L-L-Y-B-E-N-J-A-M-I-N. Benjamin's a rad name. It is a good surname. I've actually just got married and my married surname is Kotevski but I'm finding it difficult to let go of Benjamin. What's Kotevski? Kotevski, yeah my husband's Macedonian. Macedonian, awesome. So they normally end in a ski. I love Macedonian. Yeah, good food. Yeah, that was so good. Well tell me a little bit about yourself first. Do you live around here? I actually do, I live up in Subiaco so about 10 minutes away from the shift at Moore Street. I've been with Orange Sky since covid so 2019-2020. I actually saw the boys do a presentation at my last job at Flight Centre. They came to one of our conferences and spoke about the Orange Sky journey. That was probably in 2018 and their message kind of stuck with me. I thought it was a great thing that they were doing like two young blokes, yeah just out of high school seeing a need in the community and I thought that was really nice. But at the time there were, I think there was only one shift in Perth at South Perth and just with working hours I couldn't make it. And then during covid I was looking for something to do to, I thought it was you know the world slowed down, now I've slowed down. It'll be nice to kind of give back to the community. I feel pretty blessed in my life. I moved over to Australia with my parents when I was 17 from South Africa. Not a privileged life in South Africa where we came from so coming here and you know experiencing a very first world country where you have everything. I thought it's yeah I want to do to give back. So reconnected with Orange Sky and at that time they were doing more shifts. So I was living down south of the river so I joined up to the Mandurah shift, decided there. And then when I moved in closer to the city I started up Moore Street and I've been here doing the Sunday shift every fortnight for yeah four years or so now. Yeah. Far out. And I was just down with AJ, he's dobbed you in. Well. What do you think about AJ in terms of like his journey and being able to be on shift with him? What's that like for you? Oh he's such a beautiful soul and quite like it's inspiring to see someone who's had so much adversity and he comes and he's smiling every day, making jokes and he's so passionate about helping others and you know just being a light. Like I don't think he even tries. He just yeah, he just comes and he's just a light. He's a light. He's a light. He's a light. He's a light. He's a light. I think of the people he comes and he just yeah brings everyone together like us volunteers and the friends everyone knows him. Everyone loves him so yeah his journey and his life is really inspiring yeah. That's cool. There's been a podcast recently for the F Word or Inspired Creators. Yeah I haven't watched it. I haven't listened to it yet. I've been waiting for a big drive because that's normally when I listen to a podcast. Okay. I think it was the first episode um how they said. More stories. their start how they started yeah so I actually want to get my husband that's why I've been waiting for a big drive because I want him to listen to it I leave him every Sunday and come here for half the day um and he's never you know been to shift or he doesn't really know the story so I'm keen to kind of share that with him it's great that they started the podcast yeah and it's like friends right what's what's your perception of friends that terminology both within Orange Sky but also like within your own personal life what does friendship mean to you um just being there for people like I guess I'm the kind of person that and my close Circle who I call my my close friends will I think attest to that um you know I'm the kind of person that if if someone's in need I just feel it in me to provide help and I think that's what friendship is like helping helping others um and being there for people that are in need and I think that's what friendship is being there for others they don't have you don't have to know them or but you know you can see when someone's in need and just having that empathy um yeah and and helping where you can that's cool um and this whole idea of volunteering what do you think the power of volunteering is not just for all the people you support for the general like world I guess say that again if volunteering like what why do you think it's a powerful um like tool or impact not just for people who are volunteering but also it um it tells the unseen that they are seen I think um I've seen our friends are in the city um like I was walking I was walking after dinner one Saturday night like all dressed up and I saw one of our friends um I won't say his name but he was getting tea and coffee at like 9 p.m on a Saturday night from another outreach provider and I saw him and I was like oh my God so and so um and it was just so and I was with my mates who didn't know him didn't know why the hell I was talking to this guy um in the middle of the city um who's completely different he's much older than me um and yeah you just get that connection and and then they know that they're seen because I I don't think they are and if someone's like on the fence and they're like I'm not sure about volunteering for a number of reasons what's what's your sort of how would you say how would you explain what the volunteering is like in our sky and why should they volunteer or give it a crack if someone's unsure about it um I would ask them their why like why did you why are you thinking about it like what what made it interesting to you and then you'll generally find out their reasoning behind it and then just like that's enough to say give it a go it'll be um I want to give back or um you know I feel blessed or this is how a lot of people this has happened to me um and you know I've come so far from that so People's why is pretty powerful and when they connect to that, I think that's kind of where it starts. So yeah, just connecting back to the why and having a conversation about it and what we do and the impacts. That's rad. Anything else you've always wanted to say about Orange Sky? Not really anything completely out of this world, but I love it. I love the team. I've been working with these guys, the same people for years. So it's like a family and it's great. It brings us together and it's really nice that we are able to give back to our community. So yeah, thank you to Orange Sky for that. Good grab. You're fucking so good at this.",
  "themes": [],
  "themeIds": [
    "recO87iB31KzSIZ9P",
    "rec8uHVw7PNb9hzOO",
    "rec9fCiXgl4Ty1j5s",
    "rec1kvO6Aj0guh4DM",
    "recQobVHndOfl4END"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}