{
  "id": "recgYmKVOzWIMDJGm",
  "name": "Danee Vanderwall",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "The transcript features a conversation where a volunteer for Orange Sky discusses their experience and role in the community. They talk about their connection with the people they serve, the challenges of asking for help, the sense of community in the area, the busyness of their shifts, and the appreciation and gratitude shown by those they help. The volunteer emphasizes the importance of building relationships and providing support without judgment.",
  "quotes": [
    "recyfRpmSQRE5K7Ay",
    "rec2jRXWrUl43h0oh",
    "recZYy8ON7c10pv2I",
    "recO93n4sEQNJZlKp",
    "recvi0pcYIQYTtMtc"
  ],
  "transcript": "Everybody else? I always forget. I'll say sorry to Chris here because I forget to clap my hands. It syncs the sound. And I always forget it. So, Chris, I'm sorry. I did it this time. Is that what that thing is for? Is that what that thing is that they use? Well, it records on this. Yeah. And so the sound. Oh, to go to that. To go to that. You have to, like, match it up. And it's semi-easy, but it's better if you've got someone to clap and someone that knows what they're doing. Yeah. Alright, this is a crispy frame. Yeah. Just your name and spell it would be awesome to kick us off. My full name? Yeah, and just look straight at me. So, Danny. D-A-N-E-E. Vanderwall. V-A-N-D-E-R-W-A-L. Right. Tell us a little bit about yourself first. About me? Yeah. And where do you come from and that kind of stuff. And that kind of stuff. I am a local. I actually live very close, quite close enough to this area here. This is my region. This is kind of my hometown area at the moment. I've been in this area for... 20 something years. I've lived up here on the coast. And I've lived in this Wyong area for about 20 years. Yeah, for about 20 years. I am a mother and a wife of two children. I now work in the industry of community services. I did some study a few years ago. I've done a complete career change. So, that's when I joined Orange Sky a fair few years ago. I'm a mental health support. I'm a mental health worker. So, I do that a few days a week. As well as leaving my Tuesdays free so I can work here with Orange Sky. I'm the team leader here of this team. And I'm also... Yeah, I've been volunteering I suppose here for four years. Nearly four years now with Orange Sky. Yeah. What do you love most about Orange Sky? What's great about it? I love my team. But I also love the people here. I mean it's always changing. It's always evolving. But we do have quite a few regulars that attend quite regularly. So I've got quite a good camaraderie and connection with a few of the locals here now. So they bring you back. I always look forward to seeing them every week or every fortnight. And what are you trying to get out of it? What do you take home from shifts and what does it do for you and Orange Sky? I think knowing that there are people out there that do struggle a hell of a lot more. You know. I think that's what opens your eyes to what people are going through. And you know the trials and tribulations of what they go through. And actually appreciating that these people are able to actually open up and willing to open up and connect with you. I love it. I love it. I love that they have that trust to be able to just open up and tell us about it and just to offload and we can be a set of shoulders and ears just for them to be able to unload a lot of their worries and things like that with no judgment. You know. We're just here just to listen and get along with them. And smile. And help them along. That's so cool. I try not to follow questions but sometimes I do. I used to do this all the time and now I don't. So maybe I should. Ah okay. So you're going to get back into it. I just never know when to listen to other people or whether to go where I go. This is an interesting question. Oh god. I might have to break this down myself. What have you learned about the world since you started volunteering? I'm guessing they mean what have you learned about the world since you started volunteering. I think the most important thing is that you're not alone. You're not alone. You're not alone. You're not alone. You're not alone. You're not alone. You're not alone. You're not alone. You're not alone. You're not alone. What have you learned about the broader, what's a new thing that you have learned about life after you started volunteering in Orange Square? What's something that stood out that you didn't have before you started volunteering in Orange Square? I'd say how hard it is for people to be able to actually ask for help. Sometimes you think people are having troubles and struggles and you just think well why don't they just ask or why don't they just leave? Why don't they change their situation? But it's not that easy. It's easy to say it to somebody but when you're in that situation it's so darn hard for them. So really it's about how hard it really is to be vulnerable and ask for help. That's a huge thing that I've actually, yeah. I'm going to finish these two questions and then I'm going to do my own. What's one word to describe your volunteering experience? One word. In one word. One word. One word. I'm glad they're editing this because I'm going to take a moment to think about one word. About volunteering. I don't know if I could use the word community. Community. Because I'm a part of it and they're around me. So I'd say community. Right. And what would you say to someone who's contemplating volunteering but not quite sure about doing it yet? Come along. Just come along and come and meet the crew. Go and meet wherever you are, wherever you're thinking of going. But especially here. Come along. Spend an hour with us. Come see what we're doing. I reckon that would change your mind, especially when you get to come and see all the team. What do you feel about the general sense of this area and people doing it? What's something that you feel personally, I guess, not so much what other people are saying? I know this is quite a bit of a low socioeconomic area. So I do know that it can be a bit hard around here. There's a lot of services around, but a lot of people are blind to them and they don't know. I'd say not until I was even here. You know, did I know about other services? So, yeah, it's people say, oh, it's a rough. It's got, you know, got a bit of a got a bit of a stigma to it. The area, Waiyong area, because there is a fair bit of housing around here as well. And being that low socioeconomic area and we've had, you know, there's been some serious incidences out here. But to be honest, that's anywhere and everywhere anyway. You know, I know housing in all different suburbs, even in the nice glossy suburbs. They're there too. So. You know, don't pick on the people here. There's my word community. It's a community. So people support each other here. I mean, there's always going to be people that don't get along, but it doesn't matter where you are. People don't get along anywhere and everywhere. Not everybody's meant to be friends. But it's a good community here. People have each other's backs here. And tell us like practically a bit about your role and what you kind of do. What's the shift like? We're busy. Today is very busy. This is one of the busier areas on the coast. I suppose being daytime, you know, especially those that aren't working. So they come and utilise our service. It varies. We can vary from four loads to today, which looks like we could be pushing 10 to 12 loads. So it can be really busy. But our team's fantastic. We've got good support with the neighbourhood centre here. And because they provide here at the service, the service that they provide here, it brings in a lot of people. So it's good to have that. So it's good to have a lot of different characters coming through, you know, getting to know some new people. There's new faces quite often. It's kind of a bit of a rolling area here. So it's constantly evolving with the people that are staying here that live rough here because we do have a fair few people that live rough here. And that's always, as I said, ever evolving too. So but I never feel I never I personally have never felt unsafe. But we also can be vigilant because some people do come in and some people are having a bad day. So you just got to be vigilant. Just keep your wits about you. But we've never really had any serious incidents or anything here. I'm quite comfortable here. I know most of the faces around here. So, you know, I don't I don't feel any any pressure problems, any stress. And I suppose this word friends that I use and band around a lot. What's that word mean to you in the context of Orange Sky? Friends mean to me means connection, making connection with people. So someone that you see, you might see them more regularly. So I suppose that's the way I put it is friends being connected to people. So just to these people that are around in the area and they've got someone that they can come and just talk to. No judgement. Come and have a laugh. Have a serious conversation. You can unload. And we're like a friend and a friendly face. I mean, we're twice as friendly. We're like a friend and a friendly face. What does the connection mean to you? All of us brothers and sisters cleare museums. We're really intoック- ㅎㅎ Some of the Horn efect is shown through their shirts. So I would much triggers workflow and hopefully you can handle that, but you can also build right- decía you can sometimes feel right and maybe feel bad. Yeah, absolutely. So like I yeah, I love all the politics around, like being a little alum that's got that haircut you stuff. You wanna take it out there. Not only is that there's also a lot of unnecessary going on here. from everybody. It's really lovely. You know, we don't come here for that. I don't come here for pats on the back. That's no biggie for me. But they are so lovely and so appreciative of us being here. You know, even if there's times where we're so busy we can't dry their clothes, say, and it's a wash they're happy with. You know what I mean? They're happy to go and take it and put it somewhere and hang it up to dry themselves. But there's always thanks. They're always so thankful. Everyone's so polite and lovely like that and courteous. All right. Boom. Well done. You didn't even stop once.",
  "themes": [],
  "themeIds": [
    "recLY0BuGJ3vddUKs",
    "rec8a6KXYTjQB0sBw",
    "reck8LVAG2rKn72Bg",
    "recJkmIAjJVBEUnEk",
    "recLhejOp8SsFNsbF"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}