{
  "id": "rechd7ryZ1wfeV03q",
  "name": "Samantha Breust",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "The transcript highlights a conversation about volunteering with Orange Sky, the importance of connection and friendship, the unique atmosphere created by Orange Sky for people experiencing homelessness, and the impact of small gestures of kindness. The speaker discusses how volunteering has been rewarding despite initial reservations and mentions the potential for Orange Sky to focus on sustainability and environmental impact moving forward. The conversation is interrupted by interactions with a man named Gerry, who shares his experience with Orange Sky.",
  "quotes": [
    "reciU5YSPLsiWwiWG",
    "rec8Thoh3scIk1gDz",
    "recY4zq5of88GFAXQ",
    "recwWV2fOeUUTy767",
    "rec12xWgwi7HlArQ4",
    "recCwv5i7w1cnIUIo",
    "recbTbPWVtdz1GSYU",
    "recwSLxGJsmByf6Av",
    "recMr1znMfHIMYkzW",
    "rec881U3sC1MKJKOO",
    "recXGptOCXMeU2R3H",
    "rec9n3xNbgSpF282s",
    "rec1hDBVe1p1YlMh2",
    "recJ0VA5DZEVOUjY9",
    "recLcYrdC0uEkjKjk"
  ],
  "transcript": "Why not? That's good. So if you just see your name and spell it, you just talk straight... Oh, actually, if you click that, like, here, if that makes sense? Oh, actually, click it the other way. Yeah. Put this inside. Yeah. Under your shirt. It doesn't mind. So put this on the outside. Yeah, that on the outside and that in your shirt. Gotcha. All right. Put that behind your shirt, so you're even hiding that thing. Right. So, I've got it. Yeah, boom. That's it. Ah, gotcha. Right. Have nothing. Good work. Good work. I look like I'm greenling. Full natural. Hide the tech. Yeah, full natural. Hide all the tech. Doesn't get any more natural than this. Yeah, yeah. Oh, my God. All right. First of all, just do your name and spell it, so we know what your name is and we can spell it. My name's Samantha Brust. B-R-E-U-S-T. Cool. Samantha, tell me a tiny bit about yourself, so people know who you are, I guess. So, I got involved in a... Oh, yeah. I got involved in Orange Sky when I was working for a company called Connect, and I was the general manager of that company, and we were looking for a social cause that we could link with. And literally, the reason was that our logo was orange, and so was Orange Sky. And QBE Insurance was the sponsor at the time, so we were also partnered with them, and it was a really good opportunity, and it was very popular. The Sudsy Challenge in particular went really well with Connect, but I started personally volunteering myself. And after I'd done a couple of things... I'd done a couple of weeks of volunteering, I said to my husband, you should come down. And he was like, oh, I don't know if it's my jam. I'm an allied health professional, and so I work in a space where helping people who've got vulnerabilities is pretty common in my world, but he's an engineer. And anyway, that's ended up being a match made in heaven, and we both volunteer every fortnight now and love that. And yeah, Nick does hoses and washing machines and stuff like that, and chats to everyone about rugby, and I just do the washing and folding part. So yeah, it's great. We love it. It's cool. And yeah, good yarn with AJ. What's it like working with AJ, who's experienced it, then come during sports bowling? Yeah, it's great. I mean, AJ is just awesome. He's a great human, and he's really helped, I guess, to create a connection where he knows people. A lot of the faces that we might not see all the time, he'll know from around the streets himself. And the fact that he was a friend back in the day, he's a friend of mine. He's a friend of mine. He's a friend of mine. He's a friend of mine. And he's a great guy. And that he's been able to really turn his whole life around, and he's done it through the dedication of volunteering. Orange Sky is only one of the organisations he volunteers for. He effectively makes a career of that now. And yeah, he's just a great guy, and someone that I might not normally have much of an opportunity to get to know. And that's one of the great things about Orange Sky that I really like, is that you're working with people from all sorts of different walks of life and things that they do. So yeah. That's so great. I mean, I think that's the best thing about Orange Sky. I mean, I think that's the best thing about Orange Sky. I think that's the best thing about Orange Sky. I think that's the best thing about Orange Sky. I think that's the best thing about Orange Sky. I think that's the best thing about Orange Sky. I think that's the best thing about Orange Sky. Or just like what I'm used to… But what's that mean to you, er as a person? Well, I think friendship, is, kind of, I guess just the, for a lot of people, blend into my personality. Interesting. Thank you. Well, sharing that experience with us on the motel room… fulfill us. Thank you. …I really enjoy that. Thank you! Sounds as though you want to come back and have a drink with me next time. True that. And if I do! I would love to entertain my two friends! I would love that! But for me, it's probably homey because I and Orange Sky have been putting in so much What's that mean to you in terms of like, not just what our Skype is, but what does friendship mean to you? And so how does that support you as well as a person? I think friendship is kind of the, I guess the base of what brings connection to humans. And I think no matter, maybe, you know, COVID kind of showed us as a population that, you know, friendship or connectivity with other humans is so vital to survival. And actually all the other trappings, you know, are almost inconsequential if you don't have social connections. So friendship, yeah, I'm very lucky that I have a friendship network that I know when times are tough will support me, but also people to enjoy fun times with. And actually you do see that on the streets as well. The friends really do engage with each other and support each other. And I think that's been my greatest learning through doing the volunteering, is that there's actually a really respectful code generally on the street. And I think that's a really good thing because you can see the streets between individuals, and they do look after each other. And I love how if you are a volunteer with Orange Sky, you're just embraced into that. So, you know, often in everyday life now, I'll come across people. I work in the, I worked in the city for a little while recently, and I now run a set of medical practices and we have a clinic in town. And, you know, so I'll be walking around and I'll see friends that I know from the weekend and they'll often not recognise me initially and they'll say, oh, you look really familiar. And I'll be like, yeah, I work for Orange Sky. And they're like, oh yeah, okay, yeah. So I love that it gives instant connectivity. It's really special. That connection piece has always been really strong. Like it's in the, like that sort of catchphrase is from the beginning. What's your perception as like, just sort of adding onto that, of how does Orange Sky, what's Orange Sky's part of that connection process as part of the broader ecosystem with homelessness or wellbeing or whatever? Yeah, I think it's such a safe space, Orange Sky. You know, it's one of the, there's no competition around it. It's basically, you know, even when you're working to get things that you need to survive, food and shelter, those sorts of things, I guess it sets up a little bit of a competition kind of feeling amongst people that can be a bit fractious. But Orange Sky doesn't have any of that. It's just really gorgeous that people can come, sit, relax. They have to wait. They have to be there to get their clothes back again. So it's the only service that is offered around here that has that kind of element where you have to be there for an extended period of time. And so as a result of that, the conversations can develop very naturally rather than when you're in a queue waiting for a commodity, it's a bit more difficult to have that natural conversation develop. So I think that connectivity is really sponsored by the way Orange Sky goes about its business. And I love that we see, yeah, I think it's so important to see the same people every two weeks when we volunteer every fortnight. And I love that it's the same people and they literally come and seek you out just to say hi, even if they're not having their washing done, which is cool. So great. Like volunteering is a quite a common occurrence, but Orange Sky has like a different form of volunteering in a way in which there's a lot of like interaction. Most of it is like talking and connecting and stuff. Some people might be on the fence around volunteering because of that interactive part. What would you say about people that might be on the fence because they're not sure about, you know, they're not sure about that connection piece or like what's been like advantageous for you in volunteering as part of it? Yeah, look, I mean, people are people. And I think that the example of Mick and I, and no doubt you'll meet Mick sometime soon, but you know, Mick's natural space is not in this kind of environment where you're speaking to people that you don't know about all sorts of things. Whereas I think that came a little more easily. That part was what drew me to that. But people have the same fundamental interests and desires. We all talk about whatever's interesting to us. We talk about movies, we talk about books, we talk about sport and we talk about life in general. And it's really, some of the really deep and connected conversations that I've had at Orange Sky have been, you know, out of nothing, just out of sitting next to someone and sharing a moment more than anything. And what I've always found really interesting about that is, I think, that's what I've always found really interesting about that is, how people really appreciate small things in life, even though they have nothing. And it really actually reminds me to have some gratitude sometimes because, you know, these people are often in extraordinarily difficult circumstances and that they still, you know, there's always pleases and thank yous and they're always so grateful for the tiny little bit we give, comparative to the hardship that they encounter. And I really love, I really love that part about it. That's what makes us come when it's raining and a bit miserable. I'm going to leverage your awesome yarns here and ramp it up a notch and ask you a more tough question maybe. So Orange Sky's coming to 10 years. What do you reckon Orange Sky's next trajectory is? Like, I think some charities get big and then they get dry and they just get more money but don't have as much impact. What do you think will help Orange Sky continue to have impact? Even though it's like an old hat in the game, I guess. Well, you know, this is a little bit left of centre, but, you know, in the position where at work, I'm looking for opportunities to be engaged with things that have an environmental, sustainable, that ESG component of running a small business, like I do, is actually really complex for companies. So I think linking together that kind of cause no harm to the world and only do good piece is a really big opportunity for Orange Sky. And when I think about it from a sponsorship or... Hey, Gerry, how are you? I'm fine, yeah. Look at Gerry's feet. Come here and have a look. This is Gerry. Hey, Gerry, what's going on? He's got the best beanie in the world on today and his head's probably lots warmer than mine. What's happening today, Gerry? You're waiting for your... You know what I'm like? It's raining. You're waiting for your clothes, aren't you? Yeah, of course. Gerry's load is in drying with Orange Sky at the moment. Oh, cool. Yeah, so Gerry's one of our regular visitors. This gentleman's recording some footage for Orange Sky. Orange Sky. Are you happy to be on Orange Sky video? You've got me regular. I guess the guy was in your shoes. Oh, were you a volunteer once? Yeah. Were you? For Orange Sky? Yeah. Yeah? Yeah. So Gerry regularly visits us. Yeah, I usually come... And it's always good for a chat, aren't you? I usually go to Goldmoor. Yeah. With AJ. Yeah. But now it's closed, so I come here. So Gerry and AJ go way back, don't you? Is Goswell's closed? Closed? Is Goswell's closed? So that's why you come back here? It's for the holidays. Oh, for the school holidays. Yeah, okay. Yeah, yeah. Okay. I get that. That's cool. Yeah. Do you reckon we could swap out and we could have a yarn... Of course. ...one-on-one? Absolutely. You happy to have a yarn with me? Yeah. Can we put the mic?",
  "themes": [],
  "themeIds": [
    "recqdjrzDvjvQtvaR",
    "recYHsBR2g1yEU1LK",
    "recRsFFrHwgHX8HUo",
    "recXGxqt3I24QT2RJ",
    "recTft6Ie4FAUBB0J"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}