{
  "id": "rechKr7Ra14mip1FT",
  "name": "Rikki Downman",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "The speaker has been working with Orange Sky for about six weeks after seeing a Facebook post about a need for volunteers. They emphasize the importance of the service in supporting the community, especially those facing stigma or challenges. Their role involves talking to and connecting with people, providing support and resources, and they feel rewarded by giving back to the community. They also mention the positive impact of building relationships with regular attendees and the importance of spreading awareness about Orange Sky to recruit more volunteers.",
  "quotes": [
    "rechBUzH6UbZ6cI5k",
    "recH7ocFxZ1VCjNhi",
    "recxv6PTI1bTyumgB",
    "recdLGaca1BqDsWwI",
    "recGmII5ekUdy7y6r",
    "reczu3UyyavX2YhCc",
    "rec6IljHTab8133Pe",
    "recRIZpH1FG3F0Sj8"
  ],
  "transcript": "Do you want to stay in the background or do you want to move? No, come on, out the way. Out the way, mate. No, no, right over there, Kai. I want to have a picture. Why can't I have a picture? You can in a minute, I reckon. We can do that. It's always about the kids. I'd rather you do it than me. I hate talking on camera. Just talk to me. Don't worry about the camera. All right, Rad, do you want Sunny's on or off? It's up to you. I'd rather him on. Is that annoying or does it look crap? I just think I'll squint and won't know where to look. I think it's fine. Yeah? Yeah, it's fine. Okay. Cool. So if you just say your name and spell it, that's good for me and the editor and all that stuff. Okay. So I'm going to give you a full name. Ricky Downman now. So it's R-I-double-K-I and then it's D-O-W-N-M-A-N. Cool. So I'm going to ask you the same question I just asked you. How long have you been working at Orange Sky and how did you first hear about it? Orange Sky probably for around six weeks or so, so I'm relatively new. I actually, I'd heard about them for a while. However, I did see a post on Facebook from a local counsellor saying that the service is at a point where they're desperately needing volunteers and that it would possibly be shut down if they didn't get some more volunteers for the service. And I thought, right, now's the time to jump on board. I don't want it to be shut down because I think it's a great service. So within a day or so, I'll be able to get some more volunteers. Okay. So within a day or so, I'd already signed up. So yeah, within a week I was here. Yep. Cool. What was the compulsion do you think and why do you think, like what's your philosophy and why it's important I guess for this community especially? I think the community desperately needs something like this. I think that there is a stigma about, you know, like coming to something like this, being in the community, you know, being in the community and being in the community and being in the community. And so there's a stigma about the fact that we are in the public eye and admitting that you might need a bit of help. However, I think with the help of the local like NDIS and council and things like that. Sorry. Blakey, can you sit over there? Quick. He's recording at the moment. I'll come and take a photo in a minute. Quick, quick, sorry. Yeah, that's fine. Yeah. So I think that the, you know, it's a bit of a... Yeah. I think that the, you know, we've had some meetings since I've been on board with the local NDIS and they're talking about bringing their clients down themselves just to, I guess, so they don't feel so ashamed or that they're not coming by themselves, you know. Totally. What's the area like, I suppose, in general? Like do you feel... Do people talk about people struggling with their clients? Yeah. Yeah. Do you feel like there's a lot of people struggling around here often? Is it something that's kind of... Yeah. ...public eye and thought about a lot? I do think like there is, I know that there's a lot of housing, you know, community housing and stuff around here. So there is a few, I'm not sure on the stats, but there is probably quite a few unemployed and people from different backgrounds. And like I said, quite a bit of housing in this area. But I think that's a lot of people. Yeah. Yeah. So I definitely think there's a community of people that would utilise it. It just needs to be promoted maybe a little bit more or... Yeah. What's the... What do you think the most important part of the service is? Do you think there's a specific part? Is it washing, conversations, connection? Yeah. Or is it like a combination of all the pieces? Well, I mean, one of the reasons why I joined is I feel like I have a bit of a knack for just... I have a bit of a knack for talking to people. You know, like I feel like I can talk to anyone from different backgrounds. So I feel like for me, that was going to be the easiest part is just to get people in. You know, like if I can tell you a quick story, there was a gentleman who was walking along this path just last week and you could see that he was sort of... He kept looking over, but he didn't really want to come over. And I feel like if it wasn't for me walking up to him, just asking how his day was, how he's going, within a few minutes he was here having a feed because there's another service provider here providing like a bit of a breakfast. So he had something to eat. We had a chat. He was telling me about how he's living out of one of the toilets and that he's living in a house. Yeah. And he was just desperate for some food. And I think the conversation itself was good for him because he just wanted someone to chat to. He got some information about local services he can use or utilise. He actually had a toothache at the time and he was like, you know, how do I deal with this? And, you know, we referred him to the hospital and, you know, it was just a... It was... It was... It was just that... Just that... Him walking past and me approaching him. Yeah. I don't believe if I hadn't have gone up to him, then he wouldn't have come over here. So, yeah. What do you think happens over time as friends continue to come? Like, do you feel like there might be a change the more often they come and the more connected they are? Like, is there an impact in that way as well? Like, the longer they come, the more... Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. As friends, the longer they come, the better they can possibly feel or their general sense of wellbeing can possibly increase. Yeah, absolutely. I mean I haven't been here long enough to know those sorts of things and what the long term impacts are, but I can see that just having conversations with people and providing that service for people, it's helping them out. Yeah. heard stories of some of the other volunteers here that were struggling and just wanted to give back so now they're volunteering so it's sort of that you know cycle that yeah. Yeah so interesting what's the best part of your sort of experience in this whole thing like as certain parts that you like more than others and are there things that you take away from every shift feeling a particular way? I just feel like I'm giving back a little bit to the community and at a time when they desperately needed it and now I feel like it's I've taken on board the I need to now search for more volunteers myself and I've already started the conversations with a lot of people who weren't even aware of what Orange Sky was or what they did and I've just had that conversation just this afternoon with someone somebody at the my son's school you know and they're like well what is Orange Sky why are you wearing that t-shirt you know like the brightest person walking around the school so yeah it's just that in itself getting the word out there it's been great yeah. Awesome and what's do you have a style in which you engage people with Orange Sky and tell them why it's awesome like is there something that you say that's in relation to why they should volunteer like if someone else. I just like I said I just love having chats with people you know so if nothing else you know some people don't even want to get anything washed but they're walking past and I just love how you going how you been you know what's what are you up to today you know I just love that interaction and for someone who is also a mother who's been through the same things as me and I just feel like that's just a part of life. And I don't often you know you you suck doing mum duties at home and not having that adult conversation it's good to get out and have a chat to people. Cool I reckon that's it yeah unless you had anything else specific. No no I'm good I think I've spoken enough did I.",
  "themes": [],
  "themeIds": [
    "recdYNhblqR9Wluer",
    "rec8uHVw7PNb9hzOO",
    "recEbTcCEXaT5Kxdn",
    "recjgpaw1uAxtFKzN",
    "recIWJCkrxYZY7hJz"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}