{
  "id": "recIwmfsVusxt64It",
  "name": "Morage Hendry",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Bundaburg",
  "videoDraftLink": "https://share.descript.com/view/lOG2ppfqo2W",
  "summary": "Morag Hendry discusses her move to the Bundy area, voluntary work at Orange Bike, and how she heard about the organization through the media and a friend. She values meeting new people and helping others.",
  "quotes": [
    "recvRUkOF5iGf3EHg",
    "recRtNwlgiytNcOmM",
    "recC2is9tuVu6vRKu",
    "recJFVe2xxJBCiINZ"
  ],
  "transcript": "# Morage Hendry\n\n[00:00:00] \n\nAll right. We've got recording, we've got sound. Got something going on. Mm-hmm. I think, yep. Got my leg. Okay. This is great. Alright, now. Oh geez. I wasn't paying very good attention though. There we go. That's good. Might need another drink. Okay. Yep. Um, first of all, we just do your name, your full name, and spell it.\n\nOkay. You just talk to me, this things just, yeah. Okay. I'm Morag Hendry. Um, M-O-R-A-G-H-E-N-D-R-Y. Yeah. Tell us a tiny bit about yourself. Myself. Yeah. Um, I've just moved to the area, the whole Bundy area in about eight months ago. Um, did a whole sea change, sea change from down in the Locky Valley down there in Gatton, Rosewood area.\n\nAnd, um, absolutely love it up here. So yeah, just living, [00:01:00] doing my thing and doing voluntary work at other, other places as well. So. Cool. Yeah, just enjoying life now. Awesome. Yeah. And how did you first hear about Orange Bike? Oh, just through the media, I think just in general. And then when I got up here, um, Emily, who you were just talking to, is a friend of my daughter's.\n\nAnd we just happened to mention that I was interested in doing some voluntary stuff and she let us know all about it. Cool. Yeah. What was, what stood out for, for, for a reason, why you chose to I think just being able to meet. Other people. So especially being new to the area and just, yeah, and just being able to help other people.\n\nYou know, like I was, I've always wanted to try and do something and now that I have the perfect opportunity to do it so I can fit it into my life and I wanna just do stuff. Yeah. Are there certain things that stand out from volunteering that you enjoy more than others? Um, or respect? Uh, I think, not [00:02:00] specifically.\n\nI think just, um. The diversity of people like knowing, not knowing who's gonna, who's gonna be coming up next and getting to know them, where they're from, you know, and yeah, that sort of thing. I. Yeah. Has anything sort of shifted in your thinking after work, after volunteering here for a bit or like, no, not really.\n\nIf, if anything, it'll be for the better. Mm-hmm. Yeah. Yeah. I'm glad that I do it and, um, kind of miss when I'm not on roster, so. Yeah. No, it's just fun and you know, I'm getting, I said I'm getting to meet a lot of lovely people and the like, same, same like-minded people as well, so yeah. So, no, it's, um, that's cool.\n\nIt's nice. Yep. Um. What about, you're new to the area, what's your initial thoughts around things that relate to people doing it tough or people going okay? Like what's your general vibe? Um, I think, I think there's, [00:03:00] there's definitely that, um, significant difference between the lower income and the, the higher income people.\n\nUm. And you see that there are a lot of people doing it tough that don't even, don't let on that they're doing, doing things tough either. Mm-hmm. A lot of people hide a lot of stuff. Um, but I think it's, it's, it's like a lot of, you know, a lot of the same towns like Bundaberg, I, I related a lot to Ipswich where I, the area that I come from and it, it's just seems to be.\n\nLike the same kind of thing. You know, there's, there are a lot of homeless people wherever you go. Mm-hmm. Um, but everyone copes in their own way. And I think that everyone has choices to do what they want to do. And if that's how they are, you know, and if they don't wanna do that, well find a way out or, you know, try and help, you know, and it's, and it's good that we can be here to help them Yeah.\n\nTo do that. You know, if, if they wanna look for somewhere else, you just [00:04:00] never know what someone just might say. Something specific to someone and it might just trigger something and go, oh yeah, I can do that. You know, and get them off the street or do something you just don't know. And being new to Orange Sky, how did you find like the onboarding and all the Yeah, it was great.\n\nAll online stuff is, is easy to do. Yeah, no, it was great and I had a lot of help. Everyone's really helpful. Just wouldn't be able to do it without all them. And I. From hearing about Orange sky. Yeah. Talking to people about it, actually doing it. Yeah. Is there any like difference or things that surprised you, or is it exactly as people say It is?\n\nYeah, I think, um, it's probably about what I, what I thought. Um, I think I am surprised and I'm glad actually that it, it's actually more, there are more like policies and procedures and rules, and it is, it is officially. Something that everyone has to abide by. It's not just, oh yeah, we are just gonna [00:05:00] volunteer and come and do someone's laundry.\n\nIt's not like that at all. You know, we have our own rules to protect ourselves and the friends. Um, it is, it is a proper, it is a proper run organization, you know? It is, it is good to know that you've got that support, you know, as a proper business, basically. I think that helps. Keeps you safe. That's cool.\n\nMm-hmm. Um, rad. Anything else we didn't get to touch on that you wanted to talk about or? Oh, I don't think so. I just like to just say my bit about how great it is to be able to have the opportunity to do this. You know, I just love, love being able to, you know, like, yeah, it's good. I just enjoy it. Awesome.\n\nAll right. All right. I'm gonna take a little photo. No, you can't do that.\n",
  "themes": [],
  "themeIds": [
    "recIKNblV8wZdXm0d",
    "rec2inyZ8tRF6IvbD",
    "recOaoHQjsa98ptmy",
    "recyb26yDjAsqBlbW"
  ],
  "shifts": [
    "rec7Rp0dprgIjD1sI"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}