{
  "id": "recIp8lQPrmjqauII",
  "name": "Drew Nicholls ",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Melbourne",
  "videoDraftLink": "https://share.descript.com/view/e5txuzcLn0X",
  "summary": "Drew Nichols is the operations manager at Foothills Community Care, residing in the eastern suburbs of Melbourne with a passion for community and inclusivity. He highlights the importance of the community meal night as a way to foster connection and equality among individuals. Nichols emphasizes the value of dignity in their initiatives to create a sense of belonging and unity.",
  "quotes": [
    "rec826W4mv7n4ITKm",
    "recXIbZ67uawO7Vh0",
    "recKZMf3efvRoRK15",
    "recF8QWwPYFOlH9Qg",
    "recR8SVtAAj4cyFbf"
  ],
  "transcript": "Drew Nichols - SP - Foothills\n\n===\n\n[00:00:00]\n\nSpeaker 8: Right. Looking good. Doing mic test.\n\nSpeaker 9: 1, 2, 1, 2. Yeah, I think we're good. Hello? Hello? The wind is coming through.\n\nSpeaker 8: Yeah, I can, I can steal the wind there. The\n\nSpeaker 9: rain on the plane falls mainly in Spain or the other way round.\n\nSpeaker 8: Tell us, you just have to tell us your name and spell it again. Sorry. Beautiful. You can talk to me, you don't have to talk to that.\n\nAwesome.\n\nSpeaker 9: Drew Nichols, DRW Nichols. I am the, uh, operations manager at Foothills Community Care.\n\nSpeaker 8: Cool. Rus, tell me a tiny bit about yourself.\n\nSpeaker 9: Yeah, so I'm the operations manager, so I, no, so I, I live in the hills. Uh, I've lived in and around the eastern suburbs of Melbourne. It's a beautiful part of the world to be, um, I've got a real heart for, for community and for people finding their place.\n\nAnd so particularly the community meal night, there's nothing better than someone finding their place at the table with cutlery on one side and salt and pepper and flowers. It's a really beautiful thing. Uh, it's that great equalizer. Once you sit around the table, you find community, uh, and everyone's the same.\n\nSpeaker 8: That's [00:01:00] amazing. What's this soaring sky community thing? What, like how does that match together and does it match together? Yeah,\n\nSpeaker 9: so part of that table, it's all that dignity. And so a big, a big thing of what we want to do is dignity. Uh, and so something like orange sky, uh, is a, is a, is a great service for some of our folks who, uh.\n\nThat is not a, a lived experience for them. They're not able to access clean clothes, and when you don't have clean clothes, you don't feel very good. You get really stinky. Uh, we've got some people who, um, uh, need to be applying for jobs as well. So when you don't have good clothes, you feel stinky, you feel pretty rubbish about yourself.\n\nSo Orange Sky's a great service and it means that people can access, uh, fresh, clean clothes and it just, you know, it has amazing boost to their mental health and general wellbeing.\n\nSpeaker 8: Something about this place, philosophy, values, safety. What it's, what, what do you think that provides A safe place where people feel like that's, they want to all do that.\n\nYep. You know what I mean? I don't see any behavior that is like, um, sort of [00:02:00] going outta the, the mold or causing any trouble. Yep. Where does that come from and how does that get built?\n\nSpeaker 9: Yeah, so I think a big thing for us is, you know, we, we, this mill here is in the Furniture Gallery village and the village is, it's off Berwood Highway.\n\nNot many people go through it. It, it kind of comes from a real sense for me around the local community and care for community. You know, when you know your neighbor, when you know their friend, you take care of them. And so I think a similar thing is translated here. We're in a smaller community, but people really care for one another.\n\nAnd when you get to see the lived experiences, you hear the stories for, for some of our folks, they hear similar stories from one another. And I think when you combine stories, people together and food, there's this beautiful fermentation of, of community care and it can be people at their best,\n\nSpeaker 8: so Right.\n\nUm, this whole idea of conversation, so the lens itself more to me, that term [00:03:00] story, how does stories. Continue to build what you have here and what, what do you think should happen with those stories over time? Yeah. Like, and how does that continue to support the longevity and the future of this place?\n\nSpeaker 9: So stories are really powerful.\n\nStories are a reminder of past, they're a reminder of emotion and feeling and experience. But quite often that those experiences are the foundation for what the future looks like. So I think about people that live in boarding houses. Hearing their perspective and ongoingly hearing their perspective is a really important thing because it's a reminder of how people in the community live who are much worse off than me.\n\nAnd whether it's boarding houses or people that sleep in tents in the forests, or people who are sleeping in cars, we, they have lots of those people. Uh, we can't forget those stories. We need to keep hearing those stories, uh, because they remind us and, and really encourage us of the importance of this sort of thing.\n\nUh, because there's lots of [00:04:00] complex reasons why people don't have secure housing. Uh, but bigger than that, what we can do is we can provide a place of safety and that one piece of safety, that one bit of, uh, listening to story, uh, can have ripple effects that go well and truly beyond just one community meal night.\n\nThey allow us to, uh, think bigger ongoing, what we can do to make a difference.\n\nSpeaker 8: Um, those stories, how do. Ripple out to people that at the moment don't really care or don't have access to knowing what's actually happening. For people that are struggling, is there a chance to, I dunno if it's changing people's minds or even just touching a few more people.\n\nMm. Is there a better way to do that? Like, do you have to force feed naturally? What's the way in which you do that in a way that's like you have here, right? Like a natural. Experience organic.\n\nSpeaker 9: I think it's a bit of everything. I think, you know, our world is so fast paced now. Social media is, is running at [00:05:00] lightning pace.\n\nI think it's a few different things. I, I think it's, it, it is certainly around messaging in a really tight, short space, getting the powerful message out there, whether that's social media or whether that's in some other form. I think it's that. But I, I, I think more than that, I, I, I, I think it's, it's the long.\n\nA difficult discipline driver, just continuing to say the same thing again and again and again. Uh, and that's can be challenging and you get a bit frustrated. Uh, but I think, you know, it's, it's seems like connecting with your local ministers. It's, you know, it's politicians, it's department heads, it's other agencies that we work with who should have a footprint here.\n\nThey say they do, but they don't. Uh, so it's, it's, it's the long hard stuff where you just have to keep, uh, advocating for people. Hmm. Uh, at a corporate level, at a government level, at a support level. Uh, because if you don't do that, the, the story just gets lost and life just moves on.\n\nSpeaker 8: And last question.\n\nYou're doing such a good job. Um, I do a lot with [00:06:00] young people, especially young people that have, um, too much contact with this system of youth justice and those areas is, do you see young people here? And then also what do.\n\nWhat's, what's that opportunity to capture those kids that maybe like, it's not cool to come here? Or like, what's that maybe here?\n\nSpeaker 9: So, yeah. Yeah. Great question. So I think going back to the ideas of community, I think I've been a young person, uh, I know what it's like not to fit in. Uh, and so I think, you know, particular I'm thinking about young men particularly.\n\nYou need mob, you need people that, that where you have a sense of identity and a sense of security that comes from that. That's missing in a lot of young men, particularly girls as well. That sense of a, your story within a bigger story, that stuff is missing. So I think something like a meal night here, we can't do all of that.\n\nBut if you can get a young person engaged [00:07:00] developmentally with older people, with people who might be different from you, but have an interest in you and show an interest in you, that over time can begin to make a difference. So I think there's lots of things that we can be doing better to engage the younger people.\n\nUm, but I'd be really, really keen to see what else we can do because I fully appreciate people need purpose. People need a place to call home. People need a place where they see themselves within a bigger story and places where that doesn't happen, that can lead down a really difficult path.\n\nSpeaker 8: Geez, jeez, dude.",
  "themes": [],
  "themeIds": [
    "recB0Cj60j2dBZD7f",
    "recKDoa07XZA9aV8r",
    "recnWHj4uWuKKgXbQ",
    "recNUGvk4YFSj3wIJ"
  ],
  "shifts": [
    "recMnBRiSmrELgnVe"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "recDInWOmILrUQnEV",
    "recKkLMb6xh5D0GBM"
  ],
  "storyCount": 2
}