{
  "id": "reciHo7sw94NrBGjq",
  "name": "AJ Bailey",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "AJ shares his journey from being a street person to becoming a team leader at Iron Sky. He emphasizes the importance of giving back to the community and the impact of the organization in providing essential services like showers and clean clothes to those in need. AJ also highlights the power of friendship and support in mental health, and advocates for more support and resources for homeless individuals in Perth. He encourages continued support for Iron Sky's services and mentions the positive impact it has on people's lives. Kelly is suggested as another",
  "quotes": [
    "recJdVbHEwc5GgzHU",
    "recdvrV5Zc5mHPgaa",
    "rec2Us000leNuBmAw",
    "recFgov0MoR39XgVP",
    "recGlwVrT8z3wfHOh",
    "rec1YT6XcTKZkEw4u"
  ],
  "transcript": "A mic test, does it work? Yeah it works. Okay, see? I can feel it. Um, let's see if this works too. It's not too bad. Righto brother, you looking me? Yeah. Tell me your name, and you spell it for me, it'd be great. My name's AJ. It's basically A-J. Bailey, B-A-I-L-L-I-E. Cool man. Tell us a little bit about yourself AJ. Um, about nine years ago I was down in St. Pat's as a street person. And I was staying at St. Pat's and I used Iron Sky for two weeks. And I loved it, I loved the service. So I basically asked Helen, the team leader at the time, can I join the team? And she said yes. And I wrote my way up to team leader. Today. Today? Yeah. And I was general volunteer, assistant team leader, and team leader. But I do two shifts. I do one shift here on Sunday, and I do another shift at Gosnell's on Wednesday. With the shower truck, Carla. What's, um, tell us about your job? Tell us, I don't know where to start. Tell us where, how you heard about Iron Sky when you were doing it right. Well, basically on the streets, word by mouth. Yeah. They normally come down, people talk, um, where it goes around and yeah. It's great. What's your, like, do you have a particular story you like to tell around your journey to homelessness? Or what's your... Well... Basically... I came out of prison. Um, I ended up with a, well, my lady, my late partner, she passed away from cancer. Um, liver, cirrhosis of liver. And I was on the streets in Northridge. And I went to Rua, and they got me into accommodation down St Pat's. And, yeah. I've been there for about two, two years. What's it feel like to go from using it to being a supporter of Iron Sky? I love it. I love giving it back to the community. Yeah. Like, I love it down here because everyone knows me and I know them. Yeah. What's it feel like to know people who are still doing it tough and you sort of in this role here? How's that feel to you and your relationships with people? Well, it's pretty good. People come up to me and say, hey, Jay, I'm looking for accommodation and I check on, um, I don't know if you know an app called ArcCity. I use that quite a lot. Last year, I saved somebody's life because he was on the street. Um, he wanted to commit suicide. Jump off a building in Perth City. And I was... And some strange reason, he came straight up to me and I gave him help. I talked to him. I rang up the EMBOs and they were getting help in a mental hospital. What do you think the power of Impact of Iron Sky is as a person who... It's pretty good. You're like, I see people's faces with a big smile on their face. Um, they did have a shower down here. But, yeah, when they come down with their dirty clothes, they're nice. They love us doing their job. So, I've got a... I had one friend down here. His jumper was pretty wet. So he asked me, can I put in a dryer? So I did put in a dryer. And I guarantee he'll be smiling as soon as he gets his warm jumper. Because of this fella. And yeah, I love it. I love doing this, um, position. I'm not a, um, bad boss. I'm a good person in charge. My team knows what they're doing. All I do is just sit, stand back and... Last year I had a couple living in the car. And the lady got in the car. And the lady, Kirsty, she came up to me. A friend. I haven't seen her for... For ages. And she says, AJ, I'm staying in the car with my fella. Can we do a washing? And I said, yeah, yeah, true. So I was. So once we'd done their washing, three days. They loved it. Yeah. Wow. What's, um, we talk about this idea of friends. There's a podcast now called At The Aquas. It's called Orange Sky Deep. It's called, um, about friends and friendship. What do you think of that word friends when it comes to your own friends and Orange Sky? Yeah. I feel, um, well, I've got friends. And then I've got friends down here. Well, I've got two different sorts. Like, I've got friends, like, um, bad side. And I've got friends down here. So, yeah. I keep that stuff away from Orange Sky. Because it... What do you think the power of friendship is? Like, what do your friends that are close to you do for you in terms of your mental health and support? Well, they, like, check on me. They're saying if I'm okay. Like, last couple of weeks ago, I had passed a first aid certificate. And ever since then, we've got a friend that always has a heart attack down here. So I'm the one that helps. So, yeah. And, um, if you don't know me, I'm a friend of the friends. And, um, I'm a friend of the friends. So I've got a friend that's a friend of the friends. And I'm a friend of the friends. And I've got a friend that's a friend of the friends. And I've got a friend that's a friend of the friends. So I'm the one that rings up the EMBOs saying, are you okay, check on him, wait for the EMBOs to come down, and, yeah. Wow. That's so good, mate. Um, how do you... What do you think should happen in the city of Perth around supporting people who think this is more... Should it be more in-sky, more furthest? You know, I think it would be better if the people in Perth were more supportive, and more, you know, more... You know, I think there's a lot of good things around the world. So, yeah. So, yeah. So, yeah. You know, I think the, um, I think the first aid certificate is how you have to go about it. It's how you have to go about it. I reckon Basil should pull his finger out his arse, spend money on accommodation for the homeless. And I want to see our own sky like bandit, like more washing machines and more drives. If this thing happens then we can have two more washing machines instead of one. Because every week I have between eight to ten friends come down. I don't like knocking them back. What about people that support our own sky, why do you reckon they should keep supporting our own sky? What's the... What's the power of donating and supporting? Because it's... Our own sky is a really good service. We put clean clothes, showers, we supply showers. Like when I do shift at Gosnell's, people come in and have a shower, they come out with a big smile on their face saying, oh yeah I'm clean. And to me it feels... I feel good inside. Yeah. Because I know what it's like because I've been on the street myself and I see both sides of the fence. Yeah. Yeah, that's super important and quite unique as well I think in terms of what we do. Yeah. Cool man. Is there anything else you wanted to say to our own sky or people around our own sky? No. No? You all good? We're all good. I'm going to try and... Who else should I get to talk? Kelly. Kelly. Kelly. Kelly. Kelly.",
  "themes": [],
  "themeIds": [
    "recWOFXGT7AOxtyg3",
    "recT1Mj0cEgrO88pR",
    "recaPFUvrRJkWIXXw",
    "rec1HuZDKq8ptTPox",
    "recgmQoD5KJb7ZwYJ"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}