{
  "id": "reciBO7J7IyQdN3JU",
  "name": "Chris Dwyer",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Newcastle",
  "videoDraftLink": null,
  "summary": "Chris Dwyer learned about Orange Sky through the media and was drawn to its charity work. He joined as a volunteer, finding the experience positive and rewarding. He highlighted the importance of connecting with people during laundry services and engaging in meaningful conversations. Chris encouraged others to volunteer, emphasizing the value of lending a helping hand to those in need.",
  "quotes": [
    "recLV03KY9jYqiUvC",
    "reci5rtWVdTcaK7Zs",
    "recehJZnm9yvGhIRF",
    "recWZBTtxoIRpx4oM",
    "recp9RsP4gOw7FPsN",
    "recY0X1BFbxLB0jOO"
  ],
  "transcript": "Cool, Bradley, just talk to me. Alright. So go, just your full name and spell it first up. My name's Chris Dwyer, CHRS, Christopher, DWYER. Cool, man. Tell us how you first heard about Orange Sky. I heard about Orange Sky through just normal media. So general media, I probably saw it on television generally. Didn't know anybody who worked for Orange Sky, but got interested in the organisation only because it's not really aligned with any larger organisation, particularly any religious organisation, that do do great work in the charity sector. But really, I was drawn to Orange Sky, yeah, just through the work that the two guys started up in Brisbane and it sounded like a good match for me. Cool, man. What were you doing before, or what are you doing now, or what were you doing before? What were you doing kind of when you first started? So I'm a just full-time public servant with a young family. I found I had a lot of downtime that I was putting toward my family and work. I found gaps in that that I thought, oh, well, okay, I've got a bit of spare time. How can I use that, not on myself or my family? They come first. They're not going to be the first for the community at large. Cool, man. How did you find the first bit and what's been the trajectory for you? My initial introduction to Orange Sky was really positive. There was a very good onboarding process. It was COVID. It was online. But that still worked very well for me. And then even more positive when I met the team here at the Cross Church Cathedral Newcastle service. We're very opening support. Very opening supporting and very experienced. So, yeah, it's only been a really good experience for me. Yeah. Cool, man. How do you find the connection part of it? There's the washing, but there's also conversation and connection for people. What's that element like for you? So, good question, Ben. Operationally, it's pretty simple. You do people's washing. You dry it and then you fold it and get it away. Really challenging for me is that discussion and conversations you have with friends. They're from all walks of life. All different life experiences, different ages. Mostly men, I must say. But the challenge for me is knowing how to mould conversations to get the best out of what we do. But also knowing what not to say. I think there's a bit of magic in knowing when to pull back and not asking too many incisive questions that can not upset but steer our friends. Seeコーラ find out I work for Orange Sky, people's eyes light up. There's a good general knowledge about Orange Sky's work which surprised me in my circle of friends and acquaintances and work. A lot of people ask how to get involved. A lot of people don't realise that additional layer that you've just mentioned of the importance of the conversations with our friends. It's not just washing clothes. People are generally really very interested in the concept behind Orange Sky, how it began. A lot of people also are interested in the actual demand and understanding are there really homeless people out there? Do they need this service? To which the answer obviously is yes and it's increasing. That piques a lot of my friends interest in the conversation. I think that's a really good example of how we can get involved. I think that's a really good example of how we can get involved. I think that's a really good example of how we can get involved. I think that's a really good example of how we can get involved. A lot of my friends are just protected from that layer of society that needs our assistance and the increasing assistance. Cool. Hey, this is weird but I'm just going to take a photo because the sun's just doing something awesome and whenever it does that it always goes away and I think, geez, why didn't I just take a photo before? Cool, mate. Last question. If someone's on the fence, not sure about volunteering, maybe it's because they're not sure about hanging out with people, expressing homelessness, maybe it's the washing shirt, what would you say to them about taking a step to volunteer ownership? Take a step. It's all about experience. First step is probably the hardest ones. Even if you are concerned about either side of that, come for a look at a service. Ask a friend who you know is doing it, just come along for a trial or come along and see what we do. See how easy it actually is. The time spent can vary but that's part of volunteering. Highly recommend it to anybody thinking about giving their time and knowledge to other people who are less fortunate than ours. It's rewarding in itself. You don't have to be a special person to do it. You just have to be a normal, high-thinking person out there to help. Somebody that, you know, we could be in their shoes, could have been in their shoes, can be in the future. Looking out for others. Well done, man.",
  "themes": [],
  "themeIds": [
    "reckmkYS0pnXxRTSE",
    "rec3TQsybcqnzltkg",
    "recYdxCxIjzWFgif6",
    "recHJdzGV4epuzOCk",
    "recInnyhqbIl4dRLh"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}