{
  "id": "recJ5I4oQDd2FrBsQ",
  "name": "Muhammad Patel",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "Muhammad Patel, a volunteer for helping the homeless, discusses how he got involved in the initiative, his personal background, and the importance of friendship and collaboration in the work. He reflects on the misconceptions about homelessness and the rewarding nature of his efforts despite challenges in balancing work and commitments. He hopes to expand the project in the future to provide more support and resources for those in need.",
  "quotes": [
    "rec70077FTeh9NtGi",
    "recrn3hYbQovlqzYe",
    "recKdVMgrPWB5K04d",
    "recoNNAhfX5leQRCK",
    "rec76ZgBFnA4wv1Dt",
    "recngkGs5Fd0l3PR6",
    "recGjzwVJv33FIlm3",
    "recydGiT0TSezOq4j",
    "recN86NKzI8cDWer8",
    "reclDWCi1lIfwk52n",
    "recqYkDdpcoSxluIr"
  ],
  "transcript": "This pursuit to perfection does. Yeah, yeah, yeah, yeah, yeah. Cool, brother. Just tell me your name and spell it. It would be awesome. Sure. Okay, yeah. My name is Muhammad Patel. M-U-H-A-M-M-A-D. Patel, P-A-T-E-L. What's a rad, like, atmosphere with, like, the trains and the, like, seagulls and... Is there? Yeah, I guess so. Tell us a little bit about you first, brother. What's your little story in a minute? Or two minutes. Where do I start? I'm 36. Been doing this for, like, 10 years now. We used to operate both in Perth City and in, well, obviously in Frio, but now we just operate in Frio. I live, you know, about 20 to 30 minutes away from here. I live near Thornley. Wasn't born in Australia. Born in Zambia. It's about it, really. Oh. Yeah. So, tell us a little bit about how this started, I guess. Like, what was the impetus to why? Yeah, so, it started, we started in Perth City first up, in, back in, whatever, 10 years from, like, now, which was, what are we, in 2024, so 2014-ish. But the original founder, I'm not the original founder, the original founder, a guy called Wade, and he used to live, we all grew up in the same area. He also grew up in Thornley, since we were young, like, we used to play soccer together. Anyway, he popped up on my Facebook one day, just, like, handing out food to people in the city, and then, I'd say it was, like, December 2013-ish, I saw that, if I'm not mistaken. And then, March 2024 is when the first time I... I went out and started to get involved. I wasn't meant to, like, be involved, like, long-term at all. I was fully expecting that I'd just do it, like, once a month, once every two months. And I had no expectation of, like, what I would actually see out there. In fact, I had no idea about the situation of homeless people in general. And, you know, I just... I just... I just... I just... I just... I just... I just... I started, and, yeah, it was, like, just severely eye-opening. And then, just, yeah, I started going every week. Like, I couldn't... I couldn't just help myself. Great. Yeah. What do you think it is that connected you to this whole experience and wanting to give back? Was there something in your personal life, or was it just a, like, a luck-type thing? What do you think it was? I was probably at an age... I was at an age where I was... I was at a lot of, like... Probably, like, a shift in my personality, would you say? You know, you get to an age where you're, like, there's only so much, you know, partying you can do. Yeah. And then you've got to grow up, and then you kind of do. And then you think to yourself, well, what can I actually do, and why is the world the way it is? And then, yeah, just that was the pathway that I took. And I think I'm Muslim, right? So there's not... There's not... There's not a lot of Muslim outlets to express ourselves in this fashion. And so it was quite fortuitous that I saw Abu Baydah popping up at the time that he did, and I was able to get involved when I was able to. What do you... What keeps you coming back, and are there things that happen here with people experiencing homelessness? So is this, like, the impetus, or is it, like, hanging with other friends? What's the... A bit of both. Like, I think we've been doing it for so long now that, like, we've both become friends with the homeless people. Um, and then ourselves, we've actually become good friends as well. Um, so it's a bit of both. So, yeah. It's a good way to hang out. Orange Sky has just released a podcast, it's about friends, too. Sorry, who did? Orange Sky. Oh, yep. Yeah. So, um, it all started with two friends, Nicola and Luca. Yeah, yeah, okay, yeah. And, um, the… The way in which they represent the people with forensic homelessness they work with is friends. Yeah. And, yeah, there's just this really interesting, you know, way of thinking about what's going on, and... And then the, um, the... The thing that's really interesting about that is that we're all here at a different time. We're all here. So... and yeah, there's just this really interesting, like, powerful idea of friendship more generally. What do you think the power is of friendship, not just in, like, supporting people, but in your own life and how it supports you? I mean, it's... That's your support network, right? So... And it's... What's the word? It's not transactional. So, regardless of where you are in your life, that friendship, if it's a, you know, real friendship, they'll always be there to support you. So, yeah. That's cool, man. Is there hopes and dreams for this thing? Is it growing? Is it the same? Is it just KC? What do you want to do? So, Frio, we've probably grown. Frio started after the city, but we've probably grown it more just because I think the time in which we do it and we're significantly more established. There is dreams of, you know, getting it larger. I hope I'm able to commit and have the funding to do all of that, but I think time will tell. It's a fine balance between, you know, work, family, life commitments, and then also organising and getting everything done for this. So, yeah. I mean, hopefully one day we can have our own kitchen and places for people to actually stay. Cool, man. What do you think the power of partnerships and collaboration is in putting people doing a task? It's everything. I think both from the infrastructure and services perspective, but also for the people on the street itself. Collaboration is just, I guess, another word for support. And that's what, like, when you have friendships, you have your community, these are the pillars of that. And last question. Do you... What's the sentiment and feeling you get when you talk with close friends or people in the community about what you do? Is there a general curiosity, fear, acceptance? Is there a general thing? Um... Yeah, it's... There's almost... There's a few different, like, I guess, aspects or, like, views on this, which is, one, you're doing a good job. Keep it up. Two, you know, they, they, as in the homeless people, have enough support. They should be able to pull themselves up by their own bootstraps and keep on going or get on with their lives. Get better or whatever it is, which is obviously flawed. And then the third one is almost like... How do I frame this? It's like you're feeding seagulls. If you keep feeding them, they'll keep coming back. Which is, honestly, like, some of the feedback that we've got from... Like... Word for word to, like, some of their rangers, some of their councillors. So, yeah. So that's the three views on the subject. Yeah. Yeah, yeah. Yeah, yeah, totally. It's, yeah. It's unfortunate. I mean, look, truth be told, in my own... With the arrogance of youth, that's maybe... that I held as well you know we live in the lucky country and you've got every single piece of infrastructure and services available to you why can't you get yourself up but once you actually start interacting you're like wow this is I was such an idiot and this this issue is so much more nuanced than I could ever imagine sure I'm much better",
  "themes": [],
  "themeIds": [
    "recyZe8sz3e02F1Xe",
    "recOtXmcMKFwfGbIU",
    "recyNLuyreSXLU648",
    "recpDU2TTdwsZiDby",
    "recyExvPrwAVNwrCp"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}