{
  "id": "recJWCeeayLOiiTbB",
  "name": "Kevin Vos",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Kalgoorlie",
  "videoDraftLink": null,
  "summary": "Two individuals, Kevin and Veronica Voss, share their journey of meeting at 15 in an institution, experiencing torture, reconnecting after 40 years, and embarking on a mission with God to help others. They highlight their work in chaplaincy, missionary efforts, and community support in Kalgoorlie, Western Australia. They emphasize the importance of providing holistic care, unity among churches and agencies, and the impact of basic amenities like washing facilities on restoring dignity. They stress the significance of",
  "quotes": [
    "recKu5L8miCL6aqHv",
    "rec07yFRXBDYKI86i",
    "recQgRxzrKiskobq3",
    "rec5JkxmKmfm3tgjz",
    "rec6Ufm9eR4NGA3cv",
    "recMnKRlj33U9bsNo"
  ],
  "transcript": "I got set free brother, I tell you what, it's a good feeling mate. Now God wings it for us. Oh yeah, we rely on God a bit mate. Cool, so what you can do with these, it's kind of fun, is like, it sort of does this. That's better, I'll set it to the gil. Oh yeah, see it's easy when you know how, ain't it mate? I was gonna say, I felt a little bit of a little fluffy, fluffy thing in your face, that's good mate. Yeah, and the sound actually works really well in your sternum. And it looks like, yeah it looks like a special little reward or something mate. A little DJI of that. Oh wait, that's it. Cool, well I think the best thing to do is you go say your full name and spell it for me, just so I've got that. Yeah, Kevin Voss, V-O-S, K-E-V-I-N is Kevin and Voss is V-O-S. And Veronica Voss, V-E-R-O-N-I-C-A and Voss, V-O-S. Who wants to kick us off with a little bit about you both I guess? Go for it sister. Okay. So literally, we met when we were 15 and in an institution, in a welfare institution. And we got pretty badly tortured in that institution in Western Australia here. And we got pretty badly tortured in that institution in Western Australia here. And then we didn't see each other for 40 years. So we both like did a Moses journey, you know we call it. And I went to live on the east coast and Kevin stayed here in Western Australia. And then I came back in 2020 and Kevin was still alive, thank goodness. Because I didn't know whether he'd be alive or dead. Just alive. A few people didn't make it that were in the institution with us. So then God started us on a journey of, we already knew God, but God started us on a journey of travelling and he said take Jesus to the streets. So we've survived a lot of things, suffered from a lot of depression and PTSD. And now we're walking the streets with Jesus. We're doing chaplaincy. Praise God. We've been in Kalgoorlie for a couple of months after our African trip, doing missionary work. And now we're at M25. It's like the hub of the community where all agencies come together. And there's God in it as well, you know. That's really important to us that it's holistic. So it's body, soul and spirit, you know. People need food for their body. They also need spiritual food. And they get services like washing and showering and clothes and the food and whatever services they need. They're here and we love that. We love that about this. Can you paint a picture of where we are I guess? What is this place we're at and what's happening at the moment I guess? Well we're 600 kilometres roughly thereabouts from Perth East in the gold fields. It's a big mining hub. There's a big pit over there. It's one of the biggest pits in the world. Gold pits. And I think they've been pulling gold out of there probably for nearly 100 years. Yeah, there's 14 different tribes. In the gold fields. Yeah, there's 14 tribes in the gold fields area. Actually is it 14 tribes? This hub too. Yeah, this hub. Around this hub, yeah. Yeah, so around this hub. And yeah, it's a very community based area. And yeah, what we've found since we've been here is that the churches have been pulling together. And it's really becoming a really good community spirit. And yeah, this place here. Which is attached to the church there behind us. Church of Christ. Have put this centre together. And now there's all churches getting involved in it. And well we just feel the peace and the love in this place. It's a place for people to come and rest. Especially the people out there that live on the fringes of the town. And we're just so gracious. Yeah. Yeah. Yeah. And we're just so grateful to God that he's pointed us in the right direction to come here. And to be able to serve. So it's a really good community feeling here. And all different people sort of like come here. It becomes just one blood, one place for everybody just to enjoy each other's company. Share testimony. And also to realise that God will meet you where you're at, no matter where you're at. And that God will meet you there. And the good thing is a lot about this place as well is there's no judgement here. No condemnation. And that's the beautiful thing I like. I myself and my wife, we lived on the streets in our time before. And we always felt like that we got judged. There was judgement there. So anyway, that's a bit about this place. And yeah, we're just so glad to be part of it. And so gracious that God opened doors and brought us here. So yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. I think central to that is, this is the first place, we've travelled around a bit, went to Geraldton first, came here, that this is the first place we've seen like a really concerted effort, a concerted unity, like between churches and agencies, like in town. And we're just doing a chaplaincy course at the moment that they started up in Kalgoorlie, which we graduate in at the end of October. But... It's compartmental with this and being out on the streets. We're seeing people out on the streets that we're meeting here. So there's a real united front. And, man, every, like, all these facilities in this block alone that people can come in and have every, you know, literally, besides a house, everything that they need, without a donation tin at the gate is, like, so powerful. Every place, every regional area should have something like this because this homelessness and everything that's happening here is happening, we've seen it in other regional areas, that there's no reason why this can't happen in other places. Tell us a little bit about this thing behind us here and were you here when it came and what's been the impact of it? I think this has been, the whole centre, this centre's been going for about two years. I'm not sure how long the washing machine, cyclist has been here, but I think that all, like, came together. So there's three washing machines and three industrial drawers and Phillip doesn't stop. There's, people have their own bags, their names on them, they put their washing in and it gets dried. They can shower while all that's happening, have breakfast and then come back. I actually saw it in North Queensland as well during cyclone seasons. So to have it here, we're... to have it here, they've got a washing machine where they are, or a dryer or... yeah, it's fantastic, it's really fantastic. Because they have a change of clothes that they can pick up, so they get their, have a shower, they get their clothes washed and dried and they can pick up their clothes from before that they've got stored in a storeroom inside there, so that they've got the clothes that they take off, they can get washed on the day and then they've got a change of clothes there that they can get into. So they've always got a spare set of clothes in there and that must do it. be a really good security and just knowing that they can have a clean set of clothes when they come in here for them that must be a nice thing for them because being out there in the elements obviously doesn't really make you feel spiritually good I suppose. And they can walk away here being fed, warm belly, filled belly and have a nice change of clothes and be showered. But it's like one of those basic forms of dignity isn't it? Yeah, well that's right. To be clean and have clean clothes. If you've got that all the time you take it for granted but for someone who hasn't got any of it to come here and be able to be clean, have clean clothes, change the clothes, it's powerful as a human being to have dignity in that. It's huge isn't it? Yeah, I've been in the street there and had a fractured soul and all the rest that goes on with it. And then when you're filthy as well it's really hard to believe that you can actually get yourself out of that pit. So just to be tidy and spiritually filled up with love and care. Makes you feel filthy on the inside doesn't it? Well of course it does, yeah. So definitely they can feel like they're living again and that somebody cares for them when they walk away from here. That's for sure. One last question. So Orange Sky started by two young fellas just with an idea to wash clothes but it turned into this idea. So if you think about the relationship and connection part really like here around friendship and connection. Yeah. When you think about those words of friendship and connection what comes to mind in terms of what's happening here I guess ? Friendship and connection, well again with friendship and connection it feels like actually feel that you're human and that you're wanted. That somebody cares and that you do matter. Because I like it. You know, with obviously being homeless and all out in the elements, there's always a reason behind that. And with that goes like emptiness, not feeling like that you're really worthy. And, you know, when you can come to a place like this and feel like that there's a community and you just don't have to look too far to see the community, one blood and, you know, don't worry about what colour skin we are. God, let us all equal, you know, and for people to be able to rest, a bit of basketball, clean clothes, have a shower, have a feed and just connect with each other. And you know what, without any, it's unconditional, unconditional love and friendship. And I think that that really matters because I know what it feels like to just feel lost in life and not really feel like that you're connected to anybody. So it's a power. It's a powerful thing for people just to be able to feel like that they matter and that somebody does care. And, you know, God's always there for you. But, you know, to come and have that interaction with people, it's a really good situation for yourself as far as when you walk away that you can just take with you that somebody does care and get on with the rest of your day type thing. So I think it's a powerful thing to have friendship and connection, unconditional with no judgment, you know, especially. So that's my point of view. So when we think of community, community is like communicate, you know, just basic communication between people. You know, kids can come here and play. Mums and dads communicating with each other and building friendships here. When people come in here, there's no you're that tribe or you're that tribe. I know that there's some things that go on in the community with that. But in here, it's a safe environment where people can just come together. And we we take those who have washing machines to take it for granted, you know, that we've got to throw the washing on today, throw the washing on tomorrow. But really in the community, what does that say if you can't share it with someone else? So everybody comes here as a community communicating and friendships. Here is basic kindness, isn't it? Basic kindness to just show someone that they're good. Yeah. Because when you're on the street, like full time and a long time, we find when we go on the street and even here, when's the last time you had a hug? When's the last time someone shook your hand and said, how are you today? You know, we're talking about washing machines, but the whole lot goes together. Dignity, friendship, community, relationship and basic humanitarian kindness and friendship. Yeah. That's it. It all goes together. You can't really have one without the other. And God's for us. I don't know if you're Christian or not, but for us, God is in it all. Because we as especially as teenagers, we felt invisible. We didn't have someone coming past us going, what do you need today? Simple as that. What do you need today? What can we do today or even sit there and listen to you? So we really get the environment here. We don't know all the people, but we get the environment. We're good. We're good. You know, we're going to sit down, we're going to do this, we're going to be in a place where you can sit and talk and need something, you know? It's gold for me, brother. It's gold. I tell you what, just a handshake, a smile, a nod of the head, eye contact, a hug. Spiritual connection, brother, whatever it takes, mate. Like God will just use us for whatever he wants. It's like the congenuity, you know, to be in the vessel just to smile, acknowledge, acknowledgement. It can be everything. Someone can have a terrible day, mate, you don't know what they're going to be doing or what they're planning on doing. what they plan on doing, but a smile, a handshake, a hug, can change their whole pattern on that day, mate. People forget that they're human. They don't know that. If your heart's not working, you're just running on empty and there's nothing, then yep, you're searching out what can I eat, where can I sleep under a cover, but that's not being human. Human is being in community, in communication, and a holistic approach. So that people don't feel like they're invisible. Yeah, I think it's a bit contagious sometimes too when you do have a bit of a connection with whoever it may be and then you've got that smile and a little bit of pick me up where you feel like, wow, that made me feel good. When they go out of here, I think that at least some of those people will take that out with them as well into the community. And maybe their day wasn't looking so bright when they came here, but they've left with a bit of a different attitude about someone just unkind to them. They're not as well-conditionally said hello, smiled or whatever, hugged, and they go back out and then their day can be changed from that. So seeds, take the seeds out there and spread them around and maybe they'll get watered. So yeah, we're just so grateful that God sent us in this direction and so grateful for this place and to see all these beautiful people here sitting out in the sun and everybody's resting. It doesn't solve every problem, but I'm telling you. It's a good feeling. Communication and friendship in this place resolves something. It's an issue of the heart. And you've got to start with that. Yeah. There's definitely movement in the camp, Ben, that's for sure, brother. I tell you what, mate. We've only been here, what, four weeks? Well, been in Kalgoorlie two months, but here three or four weeks. Yeah, this is our fourth time, I think. But we can just see that God's got something moving here. And we're glad that we'll be part of it. And it's like a big puzzle around Kalgoorlie. There's just a lot of people doing things in the background. Even with this interview with yourself, it's a lot of people. And it's just bringing the puzzle together. And we believe there's going to be some powerful stuff happening in Kalgoorlie spiritually. And hopefully what you do here, when you take it out there, it'll go to other places. Yeah. There's money in every community to do this. There's money in every community to do this. And, yeah, hopefully it'll catch. Not just like the washing machines are central to people being clean and having clean clothes and being a part of humanity, that they mean something, that they matter, that so many regional areas, and not just here, Queensland, it doesn't matter where you go, there's a regional area that needs this. Washing machines and dryers are a part of it. If you feel clean on the outside, it doesn't solve all your problems, but I'm telling you now, it cleans something up on the inside. Definitely. Very good. I'm just going to take a couple more pickies. Well done, though. Happy with that, brother? That was amazing.",
  "themes": [],
  "themeIds": [
    "recXZtluO7iTrEdhC",
    "rec4d7xkO5OVVA1D9",
    "recMhbNiNd60WQY7x",
    "rec2aysLAFlO4WvAE",
    "recGl2hNSYULRC6N1"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}