{
  "id": "recJA28fNgY0L0wmf",
  "name": "Tracy McCartney",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Kalgoorlie",
  "videoDraftLink": null,
  "summary": "The transcript discusses an interview with Tracey McCartney at a community service center in Kalgoorlie. Tracey talks about providing essential services like showers and laundry facilities to homeless individuals and families. The center serves as a safe and welcoming space, particularly for children from different communities. The interview also highlights the importance of collaboration and the positive impact of services like clean clothes and showers on the community. Tracey expresses hopes for expanding and upgrading facilities to meet the growing need. The interview mentions the valuable contribution of",
  "quotes": [
    "recLKDoyA9D164Kyy",
    "recZSOgzYTimKPPww",
    "recMrGpA6L6VQTK4X",
    "reccDtf1yRldF0QBC",
    "rec6KPhzASjQqt7HT"
  ],
  "transcript": "Test is this one. So this one, kind of you hide this behind your shirt and then this clips on the front to hold it. Oh, it's like magnetic. Yeah. You can put it around like your sternum kind of, or like, so hide it all the way down so you don't get it. Right there? Yeah. Yeah? Alright, just make sure that, that I've got it 50-50. Great. I've cut my hand. That's helpful. Cool. And just say your name and spell it. Spell the whole name? Yeah. Tracey McCartney, TRS. Yeah. And then your A-C-E-Y, M, small C, big C, A-R-T-N-E-Y. And yeah, you took for me, it's like a yarn. Good. Pretty close. Cool. Tell us about yourself, I suppose, first. Like, maybe how long you've been here, like, a little bit about like, yeah, how, what got you here, that kind of thing. Yeah. Yeah. Yeah. So I've been in Kalgoorlie for a long time and I was the secretary at the Church of Christ for about 20 years. And when we moved location, we moved to Kalgoorlie. To the new location at Lane Street, we had some people coming in asking for a cup of tea and so I made them a cup of tea. And then that, there was a shower in the toilet area that they went to the toilet. They took a shower. So they had a shower. Then I thought I'll get some fresh clothes. I'll get a towel. And so things just kind of snowballed to what we've got today. Yeah. Awesome. It was amazing, Ms. Graham, as well. Thank you. Oh, thanks. So what's, I suppose, what happened this morning and like what's the vibe and experience like for people that haven't been? So we, it's interesting hearing from the perspective of somebody coming in because for us it's just our daily, you know, we kind of don't appreciate in a sense what we have here. That is quite special. But, yeah, people know that we open at 8 o'clock. People are waiting outside. They usually wake up from sleeping. Most of them are homeless. So they will wake up at daybreak from where they've been sleeping on the street and be ready to come here for a shower and breakfast. And like today we had lunch. She's every Tuesday. Normally on a Tuesday the Centrelink lady comes as well for them to see. We have free haircuts once a month. So there's different services here. But I think a big part of it is it's a safe space. It's a safe place where people feel comfortable to come and sit and relax and, yes, get the services available, but just to be in this space and know that it's their, you know, yeah, their space. So cool. What's the idea of collaboration you think in terms of what's happening here at OCAP? Is that support? Oh, huge. Huge. And it's been my desire to see, you know, to see you don't want to go it alone. You know, we can do so much when we work together. So we've got, you know, we've got the shower trucks and we've got Orange Sky, the washing, just coming together to provide such a service for the people. You know, it's, yeah, makes sense to me to work together. And like I came here and, you know, it was just on the whole time, like it's laundry everywhere, people everywhere. Yeah. Can you explain what that's like for people, I guess, like in the city sometimes we have shifts or that. Do you think that's what it is? Like what's that feel like for you in terms of the busy and important things? Oh, it just, you just recognise when I hear the statistics that come back from Phillip from the washing and the amount of showers that we do as well, because you're kind of just busy on the ground with people coming and going and that. And you don't really appreciate the actual numbers. But when you sit back and look at those, particularly when you, because we've got to keep stats, of course, you know, when you look at it over a six month period, how many loads of washing done, how many, you know, it's quite phenomenal. But it's sad in one sense that that service is so needed. But on the other hand, that's, you know, it's a lot of work. But on the other hand, that service can be provided is awesome because, you know, you think back to prior to that. And there wasn't anywhere that people could just, you know, if you go to laundromat, of course, it's going to cost a bit of money. And it's also getting there with your stuff. Whereas here they can come, have a shower, just do that single load of washing of the clothes that they had on ready for the next day. So, it's that cycle of things. Yeah. Yeah. A lot different to the household laundry that you normally do. You know, you've just got to put yourself in the shoes of people who are living differently like that. Yeah. And sometimes it's really hard to personalise what's happening, especially from an individual. And sometimes it's even hard to get a photo taken. Yeah. Can you tell us about the lady that was given the privilege not to come and get a photo? Yeah. Yeah. Yeah. So, she lives in… And what's her name? Her name's Cecily. Yeah. Lovely Cecily that… And that's, you know, I don't term this as my work. This is, you know, the place I come to meet with my friends. You know, that's what it's for me about building relationships with people. And, yeah, Cecily's been coming pretty much since we began. And she lives out in the lands. And she's a very, very good friend. And she's a very, very good friend. And I think that's what's so amazing about her. Yeah. And I think that's what's so amazing about her. Yeah. And I think that's what's so amazing about her. And I think that's what's so amazing about her. But a lot of the people that come through M25 here are people that come in from communities. They come in for different sorts of reasons and then they end up staying sometimes for longer periods or shorter, depends on what the situation is. So, Cecily's been here for a while. So, her and her partner and her sister-in-law, they will come in every day. yeah and she loves to be able to get the washing done here or she's staying out at Ningamiah so the washing truck also goes to Ningamiah and she'll access it there as well so yeah she's um she's a regular and if she would have spoken she would have told you how much she appreciates the service for sure yeah yeah she's great yeah what you doing? and the kids I guess yeah so there's kids here they seem to love hanging out here they seem to like have a really strong affinity with yourself and stuff and we got to make sure that you're a bit closer to the young kids and tell them a little bit about their experience and yeah who they are uh some of them we've known like since our babies since they you know since they come along so it for me it's like you know a bit more than it's like I was saying before it's not like work it's a bit more like family um yeah so the kids are just they just love being able to come and feel comfortable to hang out in this space and to have their shower to get their washing done have fresh clothes on I love to have their nice fresh clothes put back you know and dress up and everything they yeah yeah they love the services that they can access here and yeah it's a joy to have them around and to you know yeah it does it just adds it just all about family that's what we are here kids and all and the like if the kids haven't gone playing basketball or like come back around to the camera and stuff he said that are they um are they um brothers and sisters did you say oh they're cousins yeah but they um are they um brothers and sisters did you say oh they're cousins yeah but they um what happened oh oh yeah I see okay thanks Niall you all right thank you Niall give it a clean up um for um not for the camera but for you Niall um an accident about a year and a half ago and his mum and his nana passed away in the accident and he had quite bad spine injuries and things like that. So I was friends with his grandma for a long time that she passed and his mum and so now he stays with the little girls family in town but yeah and then we've got him into the boarding school in Coolgardie so he can go there and that's why he's keen to get back to community for the holiday family and that but he's had yeah quite traumatic. How could you explain that on camera? Yeah how could you explain the situation maybe for some young people in the community who get the access with police services? Yeah because you don't want to kind of be sharing their you know Yeah maybe just kids in general like what are some of the challenges I guess? Yeah well they you know we have some kids that will come in and and have their um get their clean clothes and have their shower and get ready before and have breakfast before they get off to school so then they feel good to go into the school environment which is which is nice to be able to to work with that as well which is really cool um you know and some of the kids are sleeping rough with the family you know on the on the streets and that which which does happen and to yeah for them to be able to come in and access the services we've got here and for this to be a bit like a home point for them you know with the toys and the things that we have and yeah playing some sports and we also have um kite school which they come on a Monday and Tuesday and they come in and play on Tuesday and they'll set up their little kites as kids kids in town enrolled in school um so they are Nana Jarrah-Lans from that and yeah they all used to be here so these kids could sit at do some school activities and continue schooling if they're in town even though yeah being away from school and community which is a which is a plus and it just adds to that whole you know yeah and what's your what's your concept of I guess clean clothes and the kind of guy thing like what what do you think was the first yeah yeah oh just I was just blown away because when I read up about it and you know the people that started it and just see how young they were and and having and and be having that kind of thought you know like from such being so young but thinking like that was just yeah I was quite impressed but it's just um yeah such a yeah such a jaw dropped all those years and and just showed me how both uh people like hanging around almost I mean I had no idea what it's like what you do you have to wash your clothes right like you have to have a shop people start wondering how much facial you can do and and um they talked about it a lot and you know you're you had seen medicines your términus with your hundreds of them taking your many many rounds of transfusion treatments and you know it's it's totally extra coverage generally said you know it's good to be clean but at the same time I learned the bits so I'm really excited that I was back on the day when I got shot a couple of weeks before coming out here because of this digital transition and doing individual research I just was feeling really good about it I've. for washing their blankets so then they've got clean fresh blankets to sleep in which is the whole circle for them with clean clothes clean blankets it's um helping health wise and everything sores and stuff like that you know it's the whole um yeah it's the circle that it's helping with here which is huge plus I've had feedback you know people have um doctors at the hospital and nurses have said you know since these services have been introduced that they see people coming in getting treated are are cleaner to you know and that's not just from a point of view it's from a point of view how good it is for that for the person you know to be able to have that service yeah yeah yeah um yeah friends I like that it's so much more personal and that's what I you know then then like them or the people or yeah that kind of thing yeah kind of creates distance and that but yeah for me it's yeah yeah it's got to be that um connection I feel yeah and I feel that's important and you know um yeah I'm here for you yeah I'm not looking down on you because you need a washing truck I'm not you know looking down on you because you you're you have to live the way you're living um it's like phenomenal um oh folks group right um um please help me to um now so um guys during yourrations um you have that place to provide that service for the young um just to keep everything safe ah um yeah I mean my um um my um um um because of where we're placed, Kalgoorlie, in being on the edge of the desert and all the lands, the communities, the Ngunnajarra lands and the, I'm probably saying these wrong, Ngunnajarra communities. So, yeah, we'd probably get a lot of different folk to say more in the urban environment, which we're very fortunate. It's great. We get to cross paths with a lot of people that some other towns or that wouldn't, and I count that as a real blessing that we get to engage with them and to learn from them. And, yeah, yeah, it's really, yeah, a lot of pluses. Cool. And last bit is, like, what's your sort of hope and dream for what this becomes? But also, I guess, outcomes for the community in general? What's going to happen for the next five to ten years? Oh, that's so huge looking ahead. I try and make it through day to day. And in all honesty, I didn't see that we'd be here, like, a couple of years ago. So it's sort of like, you know, just, yeah. So, I mean, we'd love to see a, and we know that Orange Sky have the pods, the permanent pods instead of the mobile channels. So, yeah, I think that's going to be a big plus. And I think that's going to be a big plus. Being able to have something like that on site would be amazing. And moving forward with things like that, because we don't see that the need is going to lessen any. It's only going to grow. That's what we've seen. And so, yeah, looking ahead to having, upgrading, I could say, facilities and services. Yeah, yeah, it'd be a huge plus. Because we're wearing out. Oh, my God. Oh, and tell us a little bit about the fellow that's working with them. Oh, Philip. Oh, he's amazing. Yeah. We've been really fortunate. The first, the person who started, Stuart, that started on the truck and then Philip, when he left, we're like, oh, no, because he's such a part of, like I say, the family here, you know. But then Philip came on board and he's just amazing. Just amazing. Yeah. Just the way he engages with the people that he's serving and the way he's doing it. And how, yeah, he's just, yeah, he's just part of the family. It's not like he's just over there on the washing truck. He's, you know, amongst it with us, with everything that's happening. Yeah, good. It's really good. Very good. Was there anything else from your perspective you wanted to capture or that's something for you that you wanted on the floor? No, no. I mean, it's just the value of the service. Yeah. Just the Orange Sky service. And it was wonderful, you know, when Judy and the others came out to visit us and it was great for them to actually see, you know, how the service is utilised and stuff. I don't think they've been since we've been in here, actually. So, come. Yeah, it's just so valuable. Yeah. It's so valuable. Very good. Great. Great work. Thank you.",
  "themes": [],
  "themeIds": [
    "rec3hIp7g7rYBgFkn",
    "recGQl9p38HnT4Asc",
    "recopzkZU4lzt9Whj",
    "recT9KJvSs0fHFRLS",
    "rec9vXMT5hsdOH84s"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}