{
  "id": "recJ4nxRaOVDZLCnC",
  "name": "Nici Toll",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Gladstone",
  "videoDraftLink": "https://share.descript.com/view/iaERkjfwZPo",
  "summary": "Nici Toll, a casual youth worker with PCYC, shares about her passion for helping people and working with youth. She runs activities at a local skate park to engage with kids who may not have the best home life. Additionally, she hosts a free community barbecue for vulnerable people in Glads.",
  "quotes": [
    "recDZhCY7IhuztNT9",
    "recZcynARH6c8coao",
    "recLoE1He7BCaB105",
    "recZ5qTSIxM9D69xb",
    "recjmWGglYwoBPZdE"
  ],
  "transcript": "# Nici Toll\n\n[00:00:00] \n\n**Speaker 5:** Little interview, so yeah, righto. Don't \n\n**Speaker 6:** worry. Aboutt worry about this thing. Just worry about me. Yep. Looking pretty good. Okay. So first of all, just your full name and spell it for me. \n\n**Speaker 5:** Nikki Toll, so NICI toll T double L. \n\n**Speaker 6:** Cool. Tell us a bit about yourself first. \n\n**Speaker 5:** Oh, what do you wanna know?\n\n**Speaker 6:** Whatever you think is important for your story. \n\n**Speaker 5:** I don't know, 33 years old. My passions are helping people and working with youth. I like to get down to the beach when I can to travel a bit. Bit of a Lego kid at heart too. Love to be a Lego. Yeah. \n\n**Speaker 6:** Amazing. What's the stuff you do with young kids?\n\n**Speaker 5:** So at the moment I'm actually a casual youth worker with PCYC. Cool. So they have a youth dropping center about twice a week plus every second Saturday. So just some games just engage with them feed them toast, feed them sausages. Yeah, just basically, the, it's at the skate park in town some of the kids come down there and they don't [00:01:00] really have the best home life, so they come down and cause trouble at the skate park.\n\nSo we just engage with them and. Give them an extra space and yeah. So Cool. \n\n**Speaker 6:** What's the stuff you're doing here this morning? \n\n**Speaker 5:** Yep. So on a Wednesday we do a free community barbecue for our vulnerable people in Gladstone. So every week from nine till about 12 30, 1 o'clock, I do bacon, egg burgers, and then I do sausages.\n\nI have free tea and coffee, available some water. Sometimes I have soft drinks available. Yeah, we just have a good chat, good group. They come down. Just have a chat and yeah, just hang out. Yeah. And then on a Tuesday from nine till about 10 30 1130, I have what we call a chappy chat. So just, I have tea, coffee available and the table with some games and just available for a chat so people can just come down, hang out.\n\n**Speaker 6:** Sounds awesome. Yeah. What's what's this power of conversation, you think? Why do that stuff? \n\n**Speaker 5:** I think so. I was a school [00:02:00] chaplain. And what got me into school chaplain was I was one of those kids and I just needed someone to listen to me. And not always to fix it, just to hear you. So I think that helps a lot of people.\n\nLike they don't always want someone to fix the problem, they just want someone to hear them. And that's a lot of our community members, they just wanna come down and get it off their chest and go on their merry way. Yeah, \n\n**Speaker 6:** it's fascinating. I was only thinking about this today. I do a bit of work with kids in Youth justice.\n\nYeah. This idea of having at least one person you can connect with what do you see as some of these things that move young kids from being a bit unsure and maybe getting into trouble to like. More positive pursuits, do you think? What are some of the, I think just start \n\n**Speaker 5:** with just building the relationship, just knowing that they've got someone there.\n\nThat's probably the biggest start. Yeah, just knowing they have someone there. Just showing them the way I guess. I probably would've turned out a lot worse, to be honest, if I didn't have a [00:03:00] chaplain in my life or certain people. Yeah. \n\n**Speaker 6:** What do you think about the orange sky thing?\n\n**Speaker 5:** Yeah, I think this is really cool and I have a great relationship with most of them. I think it's awesome. I've had to use 'em a few times too, if something's happened with the washing machine at home, bring the washing down and, but it's not even just about the washing, it's just they awesome ladies.\n\nEven the guys, come down, have a great chat. Yeah, I think it's a great opportunity. \n\n**Speaker 6:** And what do you think it does for people who use the service like a lot? What do you think that. Connection and conversation and washing in one thing. Yeah. What does that mean? \n\n**Speaker 5:** For most of 'em, it's the same with the barbecue.\n\nSo with the washing, you see it, I see it. Most of 'em, it's their social outing for the week. They come down, do their washing because if you go to the laundromat, not only do you have to pay, but you sit there and wait, you're doing nothing. So here you've got the ladies, you've got the guys come down, have a chart.\n\nHave a laugh, pick on each other, have a bit of banter. And there's some people down here that I've seen use these guys from the start and they were, in their [00:04:00] shell now they love coming down here. Have a chart and yeah, it's good. \n\n**Speaker 6:** That's cool. You're, excuse me, Nikki, can I please take a tea?\n\nBagg home? \n\n**Speaker 5:** Yes, \n\n**Speaker 6:** thank you. \n\n**Speaker 5:** You over right. \n\n**Speaker 6:** What. Some, do you have almost some idea of what you want to do in terms of, do you want things to grow and do more things? Do you want things to safely stay for yourself? What are some of your sort of dreams or stuff you wanna do with community at the moment?\n\nI \n\n**Speaker 5:** probably haven't really thought too much about it. I just want to keep doing what I'm doing and engaging with the community the way I am. I only just got the job with the PCYC, so I was I was doing nothing and then I. I volunteered with these guys about two years ago. I think I first came into these guys and I was just like rebuilding everything back up, like my confidence and everything, and finally got there to go for this casual job.\n\nAnd yeah. So I think just doing what I'm doing basically, and just little bits. \n\n**Speaker 6:** That's cool. [00:05:00] What was if you don't mind talking about it, what were some of the things that were, you are rebuilding from? What's this? What do you \n\n**Speaker 5:** so I did a bit of time in Rocky Mental Health Hospital.\n\nSo actually I ended up there from my chaplain job. So I got burnt a little bit and I was a lot of anxiety and depression and just when I came out I was a hermit. Even when I I came to these guys for help and. S some of them knew me from the community and they were like, they knew that I, like to volunteer and stuff.\n\nAnd they were like, oh\n\n**Speaker 6:** see ya. See ya. Have a good day. Enjoy.\n\n**Speaker 5:** She's deaf and yeah, so when I came out and came and saw these guys, they knew, knew me, so they were like, oh, do you wanna volunteer? And so I started volunteering with them, but it was very only when I felt like it, if I was having a rough week, I wouldn't get outta bed. I wouldn't come in.\n\nSo the first probably 12 months with them might only be like every couple of weeks. So I spent probably 12 months trying to get back on my feet and these guys helped immensely. And then, yeah, I finally [00:06:00] got there and then I got confident probably about six months ago and was like, all right, now I just wanna the right job to come along and I'll, I think I'm right to every enter the workforce.\n\nSo like this whole time I've just been working on, like my anxiety and doing the barbecue has helped that heap. \n\n**Speaker 6:** Yeah. So cool. What there's so many people that are struggling with different things and Yeah. I was only talking to someone yesterday about their daughter who is mostly stuck in bed and Yeah.\n\nGet out and stuff. What's what were the things that you think got you to this point to the working and employment again? \n\n**Speaker 5:** I think, 'cause I know that it brings me joy. Like what? That's why I volunteer because I know that what it gives me. So that's how I broke down because when I was chaplain in, I was working and I was under way too much pressure.\n\nI was doing way too many hours. There was too much going on and I was not doing any volunteering anymore 'cause I [00:07:00] didn't have the time. So I was losing my passion and drive for everything. Whereas now I found that again. So it's like I, like now I wake up in the morning and I want to come here. \n\n**Speaker 6:** Yeah.\n\nThat's so cool. And what's have you got other sort of circles around you that you feel that support you at the moment or is this your support or how's that? These \n\n**Speaker 5:** guys are a big support 'cause they're a church as well, so I've got like the whole church family. But yeah, I do have like other little circles of support that have helped me through the whole thing.\n\nYeah. \n\n**Speaker 6:** Cool. And what's what's one thing I will hope that you have. Just for the community, for this stuff. If you got hopes for what, like gladskin can be in the future in terms of supporting people. Oh, \n\n**Speaker 5:** just improvement in everything. I know that's a big ask, but, it's so sad.\n\nThere's, we have so many, I know it's everywhere, but we have so many people living outta their cars. Camping in tents down at the river, just couch surfing. It's so [00:08:00] bad. I just, yeah. Like I said, I know it's a big ask, but yeah, I do hope that something happens soon because there's a lot, and a lot of the people that come down here, this is their only feed sometimes for days, so yeah.\n\n**Speaker 6:** Wow. So much to do. \n\n**Speaker 5:** Yep. \n\n**Speaker 6:** Amazing. All right. I'm just gonna take a quick photo.\n",
  "themes": [],
  "themeIds": [
    "recpMi3lL6L91knSx",
    "rec9UkVgvhk1PNgZH",
    "recmtTXmHhatHGmIq",
    "reccyZPOF98AvIJeD"
  ],
  "shifts": [
    "recztH9xwFE3kdcK4"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}