{
  "id": "recJuQvyZsyd7yiXV",
  "name": "Kay Peterson",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/UZsjyXFzZMu",
  "summary": "Transcript summary: Paul Kane and Kay Peterson discuss their retired lives in Hobart, their volunteer work with Orange Scott, and their appreciation for the social aspect of the organization. They both find fulfillment in helping others less fortunate and engaging in meaningful conversations with people.",
  "quotes": [
    "recAiELpo7CIaqoNf",
    "recuFBAqSRRU52bOW",
    "reco6FLzWuvchNIWb",
    "rec8r38aND3G1fEMG"
  ],
  "transcript": "# Paul Kayne & Kay Peterson\n\n[00:00:00] \n\nAlright. This is excellent. Cool. Are you ready? No. Okay. So do you just have to do your full name and spell it for me first one by one. My name is Paul Kane. KA Paul, KANE. Yeah. And my name is Kay Peterson. K-A-Y-E-P-E-T-E-R-S-O-N. So tell me a little bit about yourself first. I am a retired old lady, a dotting aunt mother of two dogs, born and bred in Hobart, still here.\n\nYeah, ex-teacher, ex librarian. That'll do amazing. What about yourself? I'm a retired technician, electronics technician. I moved to Hobart about eight years ago. I do a lot of bush walking and and things in the bush here. That's about it. How'd you first hear about Orange [00:01:00] Scott? I went looking for volunteer organizations.\n\n'cause I've obviously been retired. It's nice to be able to if you've had a lucky life, like I'd probably count myself as having it's nice to be able to. Do something for people that aren't having such a lucky life. Cool. Yeah. And yourself? Had you heard about Orangeburg? I heard about it oh, 10 years ago when the boys first started out in Queensland, and I thought it was such a great idea.\n\nAnd now that I'm retired, I've got a bit of time and I miss the social aspect, especially being a teacher. When you stop, you miss. Miss that contact. So it's nice to have conversations with everyday people. That's cool. Seems like a really cool vibe here with with the service provider.\n\nWhat's how do you feel about that partnership and how that works? I think that they're highly supportive. Yeah, it's a it's a good relationship between us and them. They keep an eye on us. Just in case things go wrong out [00:02:00] here. No, I think they've been pretty good. Yeah.\n\nYeah. Yeah. And the team that we work, with's always really lovely too. Like I was a bit apprehensive starting 'cause I'm fairly new, but you just made me feel welcome and there's great rules and good support yeah, it's fabulous. And what was that like starting, what was the process you had to go through to.\n\nGet to your first, it was quite a lot of online information that you had to weed through lots of OC health and safety, which is important, but a passed, and I'm here. They gave me the hat. And what keeps you guys coming back to shifts? What's the main thing that excites you to keep coming back?\n\nI think you build up a relationship with some of the people obviously here. Not so much today because it seems to have changed over. But I enjoy the company of the of everyone on the shift. We got, we've had been very lucky. We've always had lovely people. It's good. What sort of conversations do you have with your [00:03:00] family and friends about Orange sky and volunteering and stuff?\n\nDo people get it or? Interesting my family's been really supportive of it and they knew that I'd do something and I'm glad it's not involving food 'cause I'm not good with food. I can, better with the washing. Some of my friends were a bit surprised. I. They, they wouldn't put themselves in this position they thought, but it's perfect for me.\n\nI like having conversations with interesting people. So perfect for that, isn't it? Absolutely. Yeah. What do you reckon the, from your own perspective, the most important part of it is? Is the washing connecting with people? Is it volunteer stuff? What's. What stands out as the most important part of the year?\n\nI know, I think I think it makes such a genuine difference to people's lives. It's nice to hand over clean clothes, clean, warm clothes to someone that's that, that hasn't got access to, to, washing machines and all the rest of [00:04:00] it. Yeah I think it's a really good little niche in the, in, in this sort of organization.\n\nYeah. Yeah. You can't be, I just think of that night when you jump into bed after you've washed your own sheets, there's nothing better than that feeling. And to be able to share, to give that to someone who can't do it for themselves is great. Yeah. I'd say it makes a big difference to people's minds.\n\nWhen they get nice when they get all their clothes back. Yeah. Because, so sometimes they're a little bit, some of the lights are a little bit ju I'm sure they're glad they're clean afterwards. Yeah. That's cool. Anything that we didn't touch on that you feel is like a cool part of Orange Sky or got any feedback from Nick and Lucas?\n\nOr you wanna talk? Rubbish about general, or I was just so impressed with the the process and the professionalism of it all. It's just amazing. Yeah. Yeah. Yeah, I think so. No, nothing. It's just [00:05:00] sometimes the new system was very trying for a little while, but, once I timed out, it's fine. It's good.\n\nYeah. Systems are always varied. Implement and yeah. Yeah. I think they're getting close to 3000 volunteers at across Australia. Wow. Yeah. Yeah. Yeah, some pretty, that was one of the reasons I bounced because it's getting way too big and important for me. Yeah. I'll go back to doing this stuff.\n\nYeah. Good. Cool. Just.\n",
  "themes": [],
  "themeIds": [
    "recFLxo4gkSjVCyFM",
    "recM2S0mtCV7MmXVS",
    "recrVwF3tMOyWmwM9",
    "recDK4cedyUGYd09Z"
  ],
  "shifts": [
    "recndj288JQOS3Zv3"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}