{
  "id": "recjhSb0sjbw5rxlw",
  "name": "Luke Watkins",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "The speaker discusses their experience volunteering with Orange Sky, how they first found out about the organization through their mom, their connection to the community in Mackay, the impact of Orange Sky in providing not just practical help but also meaningful conversations and connections, and how volunteering has made them feel happy and has helped them grow. They encourage others to consider volunteering and highlight the rewarding experience it offers.",
  "quotes": [
    "recE8wsCOFpxEyI46",
    "recCufjWzkrNdb9kR",
    "recnbMl0cryScsWYz",
    "rec72Es5dD58A16Rn",
    "rec5Z3UcHUNBehj4n",
    "recGZaJ7smdMYFZNe",
    "recgfPF4BtvRZ0iWd",
    "recM5DaES8xhxCq7a",
    "recU4GXAokjviV3rR",
    "reczJ43FvLmBOfMwT",
    "recLaJzkw5SK1IJM3",
    "rechV6clExmIk5iye"
  ],
  "transcript": "Alright, recording on one of them, recording on the other. I don't know why I make this so hard on myself. Um, actually, what I'll do, I'll make sure you're crispy sharp, because I haven't done that. Oh, that's crispy as I reckon. Alright, now Orp and Lou want to leave you there. That's alright, I'll come back. Okay. Just need to make sure I'm not, um, I'm reading my notes. Otherwise, Kate will do it. Recording, recording, we're rocking. Is the sitting here okay? Yeah, mate, that's all good. Being a one-person band sucks sometimes. Alright, I'd rather just say your name and spell it for me. It'd be awesome. Luke Watkins, oh, yeah, sorry, mate. Nah, it's sweet. Luke Watkins, L-U-K-E-W-A-T-K-I-N-S. Cool. And, um, just like tips, I don't know if you need tips, but, um, it's awesome, like, if I ask you a question, if you repeat the first part of that question. Okay. So, like, if I say what you have for breakfast, you'll say, for breakfast, I can. Okay, yep. And, like, it just helps with, like, the editing and recording and stuff. Yeah. Yeah, it's super, super helpful. Uh, cool. So, tell us a little bit about your experience. Yeah. So, tell us a little bit about, um, how you first found out about Orange Sky. I first found out about Orange Sky, it was actually through my mum. Um, so she does some work over at the church, um, and she deals with some affected people, uh, in the area, and they all pretty much had good things to say about, um, what you guys do here, what happens here. Um, so, yeah, I decided I'd come over. I'd turned 18 years old, so I'd tried to sign up before then, but you have to be 18 years old to do it. So, when I was 18, came over, gave it a shot, and loved it. So, I've moved around a few different shifts, and just being able to talk to people, and they call it volunteering, I've, I love it. So, um, and yeah, just, just get a help them out however that you can, whether that's giving some advice, or just, you know, doing their laundry for them, or if they just want to have a chat, it's, it's awesome. So cool. Um, tell us a little bit about, like, Mackay, I guess. Like, what's, what's Mackay feel like to you as a, as a Mackay resident? For me, Mackay is actually my second home. So, I was born over in the States. And we moved over here when I was two years old. So, I, this is pretty much most of what I remember. Um, but yeah, this is, this has been home. It's been awesome to me. Um, I only have good things to say about the place. Um, and I love, yeah, working here. I'm going to uni here at the moment. Um, and just, yeah, it's been, just trying to, yeah, give back to the community that's already given so much to me. So, yeah. So cool. And you talked a little bit about, like, conversation. What's it mean to sort of sit down and, you know, talk about it? What's it mean to sit down and go out of your way to come and, and speak to someone who, like, I suppose appreciates and, and is here for that? Like, how does that feel for you? And what sort of, what sort of conversations sort of come up, I guess? Yeah, well, it doesn't feel like going out of my way at all. Um, just feels like you're having a chat to a mate. Um, and the things we talk about, it can be anything. It can be real serious conversations if they're, you know, struggling or having some hard stuff going on. But most of the time, it's just general conversation. They just want to know. They just want to be treated like a friend, like a normal person. They're more than happy to do that. They're great people to talk to. Everyone has their own story. Um, and it, it makes me feel awesome to, you know, make them feel heard, um, and genuinely, you know, enjoy and listen to their stories. So, yeah, it makes me feel really good. And what about yourself? Like, um, outside of Orange Sky, what's, what's your current life and what are you, what are you doing at the moment? So, I'm currently studying engineering full time. Um, but I'm also working at Hay Point, which is a coal terminal. And then also at an engineering workshop in town. Um, and then doing some study sessions through the uni and then also tutoring on the side of that. So, yeah, keeping pretty busy. Wow. Um, done. Far out. Yeah. Um, and do you, I suppose, was there a close connection with this idea of home lessons before you started or was it something that was quite, um, abstract and not very close to you as a, as a person or as? Um, in Mackay, it wasn't something I was too exposed to. Every now and then I used to always go fishing. Um, and sometimes down along Pioneer River, you would see, um, some people camping out and sleeping there. Um, but it never really went beyond that here in Mackay. It was over in the States that I saw it most, cause we would go over every year to visit family. Um, and going to Phoenix, Arizona, you'd see a lot of it. So we'd always make a point of bringing some bread around and some sandwiches and whatnot whenever we went anywhere. Um, and just dropping it off to people and trying to talk to them, basically what you guys are doing here. Um, and I loved it. It was great. So yeah, and I'd realised how much people lit up, not just when you gave them food, but when you actually talked to them, treated them as you would anyone else. It, yeah, it, it felt good even back then. So. On that point, like, um, Orange Sky provides a service. Um, it also provides a connection. Um, there's a lot of vehicles out there. There's a lot of vehicles, I guess, around Australia and New Zealand at the moment. What, like bringing all that together, what do you think, um, is the impact of Orange Sky? Like what do you think in general is the impact of Orange Sky? Oh, it's huge. Um, look, it does help. Like the immediately obvious stuff is people get clean clothes, people get some food, people get some water and people get access to any help they need. Like they'll, you know, get told where they can find help for a specific problem they're having. Um, and then they'll just want to talk to us about some general stuff. Um, and yeah, the, the biggest thing for me though is just them being heard, them being talked to, them being treated like just anyone else. Um, and I think, I guess I haven't really specifically asked people how it's changed them and I'm probably not in the best position to say this is how it's helped them. Um, but yeah, I just, yeah, I'm not, not completely sure on that one. I like to think it helps them in just about every aspect. Um, but yeah. Yeah. Cool. Is there, is there any particular like person or story that you've heard since you've been here that stands out for you in terms of like a conversation or a friend or a situation that's happened before? Yeah, you get, you get quite a few stories. Um, and a lot of people are, it's a lot of them, it's not through any of their own doing. Those are the ones that really hit home the most for me, I guess. Um, specific ones, I guess, could be a little bit of a, you know, a little bit of a, you know, some of my friends, they, they're friends. Um, but the ones, I guess, could be about domestic violence or something like that, where they literally have had no, no fault at all. Like it's never their fault, but they've had absolutely nothing to do with it and they've just had to flee, you know, with their kids or something like that and living out of a car, those, those are stories that really, yeah, really run at home for me. Um, and I mean, you do hear, if you do ask the right questions, you get plenty of stories about every different type of situation. Um, but yeah, just for me personally, that's, those are the stories that I think about. most of the time so yeah. That's cool. And what sort of, how do you sort of feel each time you sort of leave a shift, like is there something in which you feel like growth or knowledge or connection like is there a certain feeling or emotion that stands out most when you leave? Yeah, I guess the biggest feeling for me when it's time to leave is I don't want to leave. But yeah, with work and everything I do have to. So yeah, but coming away from it I don't think there's ever been a time where I'm not smiling as I'm walking back to my car on my motorbike. It's always made me feel happy above all else. Sometimes a little bit concerned, you know, if someone's told you some things that you can see they're really struggling with then a bit concerned but every time I come out of it, yeah, basically happy knowing that you've, you know, whether they've said it or not, you can tell they're just having a good day afterwards. They're happy to be heard, happy to get fed and happy to, you know, have their clothes washed and yeah, every time I come out of it it's just definitely growth, absolutely. Just understanding how other people live because I've always been very fortunate. Parents who are well off and together and, you know, never have had any issues that are known to me at least. So yeah, growth I guess would be growth and happy. Those are the two biggest ones I'd say. Cool. And last question, if someone's thinking about volunteering at Iron Sky, like sort of on the fence what would you say to them that would maybe get them out of their lives? Swing by. Come around, have a chat to anyone here and even if you don't mention that you want to start volunteering you could just be, do it a bit secretly, come in and just act like anyone else. See how they treat you, see how it goes, see how it makes you feel and that's how you can make other people feel basically. So yeah, come down, have a chat to us and if you want to let us know that you're thinking about volunteering we'll run you through everything, what's involved and yeah, there's no, there's no age limit, well there is, but anything above 18, yeah. We get a lot of retired people here working but by all means I'm 19 and yeah, love it. There's nothing stopping the young kids from doing it either. Amazing. Yeah. Well done, that's it. Sweet as. Happy days. Cheers to that mate. So cool mate.",
  "themes": [],
  "themeIds": [
    "recBGQKVcGtCMkmTZ",
    "rec5hPnyl8myNDGRJ",
    "recvSUfp5qXjskpjN",
    "reca7CG80b8dyDujX",
    "rectHtP5ti1B4cecZ"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}