{
  "id": "recKCiQyGx61o4XRY",
  "name": "Shaun Thomas Rogers",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Canberra",
  "videoDraftLink": "https://share.descript.com/view/ZRU830sYrNC",
  "summary": "Shaun Rodgers discusses his background in radio and community services in an interview, highlighting his journey from radio to community work during the pandemic.",
  "quotes": [
    "recdRwoFBIt9J5cNf",
    "recus7UkBHOFFCVDa",
    "recpwJ2GtZRgdNduv"
  ],
  "transcript": "Shaun Rodgers\n===\n\n[00:00:00] \n\nSound mainly, but it's almost like a backup camera in case this one wigs out as well. Ah, okay. Oh, nice. That's cool. It's, it's my own little, um, safety. I tend to start things up a lot, so, ah, that, come ahead. That's a good clap. Okay. All right, bro. Just say your full name and spell it first. That's, yeah. So. Uh, Sean Thomas Rogers.\n\nUm, S-H-A-U-N-T-H-O-M-A-S-R-O-G-E-R-S. Amazing. Alright, brothers, tell me a little bit about yourself first. Um, so I started in, um, I, I started in radio. I was gonna do radio. Presenting things like that. Uh, and then I did a course in it and I thought it was, I wasn't patient with all the editing, all that kind of stuff.\n\nUm, so in [00:01:00] another area I was interested in was doing community services, so went and did a course in that. And then, um, after that course, when I moved here from Victoria, I was doing the courses here. Um, I went. Uh, here to do, um, work experience and stuff like that. Cool. Um, but I got employed first and then did the work experience, which was lucky.\n\n'cause it was during covid not many people were offering work experience, so I thought, oh, I'll look for a job and then do the work experience there. And that seemed to work. Yeah. What's, um, what drew you to this type of work? Um, oh, I better, you're right. Yeah. Hello. What's her name? Is she here today? Saba?\n\nUm, she's not here. But what kind, what support you need for sister for assistance? So worries at all. Uh, I can do a 25 for you. That's okay. Um, it's better than nothing here. [00:02:00] Yeah. Um, so today, but um, would you be able to, if you need further, just book an appointment. Oh yeah, that'd be great. Um, just get the front to write it down, uh, your member number down and I'll add it later.\n\nThat's all. Cool. Thank you. Okay, here's this. Gosh, everything's happening. Yeah, it's all good. There we go. All right. Uh, cool. Um, yeah, tell tell me what Drew drew you to this type of work. Um, I, well, I did a lot of volunteering while I was at school, and then, um, I really liked it and I. Thought, oh, you know, if I could live volunteering, I would do that, but you can't obviously go get paid.\n\nMm-hmm. So I guess it came from that kind of thing, so, yeah. That's cool. Yeah. Um, how much the sort of engagement have with Onco? Uh, well it was organized. Oh, so engaged. Yeah. So, um, it was organized I think before [00:03:00] me. Um, but they, yeah, we worked together really well, so, um. You know, if they need charging or they need to put water to drain everything and stuff like that.\n\nMm. And yeah, we often have a chat or when they've got new volunteers, they come and introduce 'em. We do a bit of a tour, um, yeah. And they know a little bit about our services and, and we know a bit about their, so it's, um, no, it's really good. I like the collaborative, 'cause the sector's quite like separated in all different kinds of organizations, so.\n\nIt's nice to have a bit of a collaborative thing going, which is great. Yeah. Right. What's, um, what's the, how many different services do you have here and, and what, what are they? Uh, so we do, so we have the pantry, which is, um, we help with food support so people can, um. Get a lot of groceries very cheaply.\n\nUm, so there's that part of it, [00:04:00] and that just prevents 'em from getting into crisis. And then we have people who are in crisis. They can't afford to get food. Um, they might have other things that they need, so like they, with energy, uh, like energy support, um, they might need to be connected to a whole range of different services.\n\nUm, and need phone charging, a shower, all sorts of things like that. So we do, we do a very practical role and we can also help 'em with food for free as well. So. There's a, a few different kinds of support that we do. Cool. There we go. Oh, hello. Thank you very much. Uh, I'll write that down. So, uh, uh, thank you.\n\nThat's brilliant. Thanks. Thanks very much. Okay. Um, what's the like. Okay. What do you find to be, um, some of the more [00:05:00] impactful, um, services here in terms of like, um, how people are coming in and what you're hearing from people in terms of what the service does for them? Um, we, we get a lot of people who come in, they might have a whole range of problems and then just being able to immediately help 'em with food.\n\nUm, usually they feel a lot better. And then, um, we might have some other things that we're helping 'em with that might take a little longer, like, um, or just get them, um, more information. So the, I think the practical part of it is one of the most important things. 'cause we can sort of take the stress of one or two problems straight away and then they, they can work on the other things as well.\n\nYeah. So. That's the one of the best things. And if they're homeless too, having a shower, um, that's just with hot water and, and things [00:06:00] is like the best, you know? What, um, what role do you think just the connection and conversation has in supporting people more than even like, um, yeah, more than just the food and the showers and stuff.\n\nWhat is that connection do for people, I guess? Oh, um, yeah, really good. Like we get, um, people in here, for example, who. Don't often get to chat to people in their own lives. Um, and so they, they come here and, and they get to know the volunteers and they get to chat with them and, and myself as well. Um, and it's just nice they can come somewhere that's, um.\n\nYou know, they can come somewhere and have a bit of social interaction and things like that. Um, so there's, there's quite a few people who do that. And there's people who also too just need to talk about some of the things they're struggling with and be able to tell [00:07:00] somebody, another person and not just bow little inside.\n\nYeah, yeah. Yeah. That's awesome. So it's, it's, it's great. Yeah. It's. Um, my camera's.\n",
  "themes": [],
  "themeIds": [
    "recn0f5qGMrbl9vWY",
    "recXpI1Dmtymi49XL",
    "recmRJgjKikV25MoC",
    "recivlIRDT7QmykAN"
  ],
  "shifts": [
    "recEyI3nzqyjNhIQH"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}