{
  "id": "recl8Oz1InmYrQK1b",
  "name": "Elaine Everett",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "Elaine Everett found out about Orange Sky through her family's involvement in volunteering. She values the connection with people and helping them feel cared for. She emphasizes the importance of friendship in mental health and homelessness. Elaine encourages others to volunteer at Orange Sky due to the rewarding connections and organized structure of the organization.",
  "quotes": [
    "rec71hqNefii1b5C5",
    "recRhwIrP5eoyxzIw",
    "recPK9P6E2T1GEcC7",
    "recw1J3EcQIZKu5lm",
    "recFQbPy3DkzG8xIU",
    "recO6uttx2RiQmyBL"
  ],
  "transcript": "I think this sounds good. You're looking straight at me. Yep. Cole, this is awesome. Just do your name and spell it. It would be great. Okay. Elaine Everett. E-L-A-I-N-E. Everett. E-V-E-R-E-T-T. Awesome. Tell us a little bit about how you found out about Orange Square. I think I sort of had seen them on and off quite a few years ago. And then about four years ago, pre-COVID, I volunteered, but I was doing the Perth shifts. And then I moved over to the eastern states. And then we've come back and put my name down for the Perth shifts. But they needed someone down here. It's closer to where we live, so it's perfect. What stood out for you? Well, my family are big volunteers. And my auntie lived over here at the time. And she was volunteering with homeless people in the city and feeding. And she was feeding people with a shop front down near Bayswater. And I thought I'd like to do something like that. And I'd seen Orange Sky, and I thought this was a really good service. What stands out for you, I guess, from coming down to shift every day? What's the thing that makes it special? What makes it special is just connecting with people. And helping them feel like they're part of society. And feeling normal. I think it's really hard for people on the streets to feel like anybody cares about them. And providing this service makes them feel cared for. That's cool. So there's some visible homelessness, there's hidden homelessness, there's all different types. What do you see, I suppose, coming to shift? That's a really interesting point. So here we see regulars, occasionally you see people you don't know who've come from the city maybe. Or even people who aren't homeless but not doing anything. Not doing so well even if they've got somewhere to live. But outside of the shift, if you walk around these streets or even in Perth when I was there, you see people who don't access these services. So you know that way beyond what we provide, there are people there who don't access. Whether they don't know how to or they don't have the confidence to. And I think that's still really sad. There's a cohort of people out there who don't access our services. Like for instance, there's a gent behind us who hasn't come out of his tent all morning. And he's not coming back. Even though he knows we're here. And we don't know why. There might be some element of mental health there. We don't know. But yeah, there's a cohort of people who don't come here. What do you feel like the sentiment in Perth in general of homelessness is? Is there support? Is there care? What's the general public perception? I don't know generally. I mean you can generalise. The people that I speak to are sympathetic. You know, who know that there are issues there. I don't know why people are on the street. People don't choose to be on the street. I mean some people do. But it's still not a great place to be. And I'm sure there's an element of people who think it's not their fault. And they can't do anything about it. Or choose not to do anything about it. Or like to blame the people. But I don't know what the sentiment is. I just know what it is amongst my friends and the people we associate with. There was recently a podcast. Yeah, yeah. It was a topic of friends. What's that word mean to you in relation to Orange Sky? Friends? Yeah. So friends to me in Orange Sky are the people I work with. They're the people who access our services. The other services that we work with as well. Like the people who provide food here. They're all friends. And I guess so that we don't make people feel like they're different. Everyone's the same when you come here. On the topic of friends. On the topic of friendship. I listened to something recently. It was talking about like health outcomes and mental health outcomes and the importance of friendship. Yes. Yes. How do you see friendship in your life? Support you and your mental health, your life in general? Yeah, yeah. Good point. I mean mental health is one of the biggest issues for homelessness. And for me personally. I know that having a... Not a large number. Not a large group of friends. But good connection with people is really important for mental health. And it can be very grounding. And I think when you come here you can see that the homeless people in this community look after each other. And that's their friendship. And they come here and you build connections with people. So you know people that come here. And you remember their names. And you say hello. And they appreciate that you remember them. And you can have conversations. And remember things about them. You know that are important to them. What keeps you coming back to Orange Sky and liking on that thing? What would you sort of suggest if people are considering volunteering but don't want to take the lead? Well first of all I'd like to say that more the merrier. So you know it is a commitment. And it's not an onerous commitment. You know half a day out of your week is nothing. And it's not a big deal. It's just a way to help people. But the friendships really like I really enjoy coming here. My husband we volunteer together. And it's something we really enjoy. And we I love the conversations we have with people. Some of them are quirky. And that's quite enjoyable. And we have a bit of a joke with some of them. And you build those relationships where you can have a bit of fun. Yeah I guess if you want to volunteer and you enjoy connecting with people. That's certainly the volunteering organisation you want to work with. Because it's really organised as well. So everything is pretty slick. Cool. Nice little grab there on the slickness. We'll use that. Yeah. We like being slick. Alright I reckon unless there's something else you wanted to cover that wasn't covered then. No you've done well. Good job Ben. Oh thank you. That's another good one.",
  "themes": [],
  "themeIds": [
    "recKMvpxzKSxNdSvC",
    "recHBmPUjoGk0gGWK",
    "recA8NrAKeMyBcF1V",
    "recpv9K3Iz5AI50jz",
    "recvYbMWogyffOaKl"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}