{
  "id": "recMdnBOqapEBXNGH",
  "name": " Graham  Williams",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/5L91xwNSkkH",
  "summary": "Margot and Grahame discuss their volunteer work with Orange Sky, a mobile laundry and shower service for homeless individuals. Grahame shares his experience of working with the organization for four and a half years while Margot talks about her reasons for joining. They mention the diverse backgrounds of the people they help, including those transitioning from jail and dealing with substance abuse issues.",
  "quotes": [
    "recKRXcp30CcSTvdA",
    "recYG3iXWBaECkf5a",
    "recjGyaSPmh1FT77X",
    "recMmlwZCXonVg15Q",
    "recWtS4nkpuJRUU40",
    "recmozWSwshs0SvbU",
    "rec3JFuktIXF6Xegh"
  ],
  "transcript": "# Margot and Grahame\n\n[00:00:00] \n\nClap my hands pretty good. Okay, so we're gonna do a little one, two. So your first, or your full name and spell it out for me would be great. Margot, M-A-R-G-O-T, surname Scales, S-C-A-L-E-S. Amazing. And Graham, G-R-A-H-A-M-E Williams. W-I-L-L-I-A-M-S. So good. Graham, why don't you kick us off with how do you usually introduce yourself?\n\nWe'll talk about yourself for who are you at the start point? Wow. Okay. So I retired quite some years ago after a semi-retirement phrase phase. Decided I wanted to do some volunteer work and I saw the advertisement for Orange Sky. I thought, yeah, that sounds exactly what would suit me. And that was four and a [00:01:00] half years ago, and Margo and I went, arrived at about the same time, and it's a very tight unit.\n\nOur group on a Monday morning shift is a very close knit group. And we like it here. We haven't, I've not done, oh yes, I've done a couple of shifts at other locations, but this is our regular Monday morning gig. And the people are always interesting here. Most of them are in some stage of transition.\n\nSometimes they come here directly from jail because on, or they need an address, and this is often the case. Others come here with a variety of drug and alcohol problems. Some of them move on when they recover and are ready to move on. But many of them stay for very many years. Long time. Yeah.\n\nCool. Good start. Margo, what's about yourself? I didn't retire as early as Graham. I retired at 75. [00:02:00] And prior to retiring. I thought I, I wasn't ready to sit at home and I had watched the orange sky start and get established and had followed it, and I thought, I need to put something in place for when I retire and when did the training found that the Monday shift would be the most suitable for me because I worked at Parliament Tuesday, Wednesday, and Thursdays.\n\nSo that's how it started and I got lumped with those three guys and nothing will separate the four of us now. It's a wonderful group. Yeah. And if I can just interrupt and say that she's in fact the problem child in the shift, I'll be right. No. We're a tight group. We go out to lunch once a month and today's lunch day.\n\n[00:03:00] And enjoy the people that are here. And yeah, so that's my lot. Awesome. What's what does Orange Sky mean to you as a central idea or impact? Is it more one thing than the other or is it many things or is it something very simple? What's, what is orange sky to you? Wow. I think orange sky's the many faceted.\n\nThing. It's more than an entity. It is an entity, but it's, it has a lot of benefits for the people, the friends who come. But it's also, it can be and is for us very enjoyable in the process of assisting people doing their washing and drying, but also assisting them sometimes in a little bit of.\n\nJust listening to them. Yeah. And a bit of humor and yeah, a bit of humor, which they probably don't get sitting in their rooms. Yeah. Yeah. It's an outside [00:04:00] reliable contact for the people here who regularly do their washing. I think the regulars who wash do genuinely enjoy seeing us. Definitely are pleased to see us enjoy being with us and.\n\nYeah. Yeah. What about Hobart as a whole in terms of an orange Sky's place in the city? Do you think it has a place and people know it, or what's it's very interesting when I tell people who don't know that I do volunteer work of any kind, they say, what do you do? And I say, oh, I work for Orange Sky.\n\nAnd they blank over. Yeah. That's inevitable with, so the name doesn't have easy recognition here, but as soon as you say we're in a van and we have two washers, and Oh yeah, I've heard about them. Yeah. So they know the concept. They know that we are here. Not the brand name. Just not the Yeah. The name itself is not easily identifiable in the community.\n\nYeah. Yeah. It's sad. It's so interesting. It's very [00:05:00] common. Across Australia though. Yeah, it is. Which I find is strange. Yeah. Because I, I got to know them first as orange sky, not as the van with the washers and dryers. Yeah. If you think about all the charities around Australia it's really hard to Oh, yeah.\n\nAlmost pinpoint to them, right? Yeah. People know Salvation Army and, but I think there's 60,000 charities in Australia. Wow. It's quite a, it's quite a mam of thing. It's interesting that I heard a stat the other day that orange sky now has the second highest touch point of people experiencing homelessness in Australia.\n\nSo the actual the amount of people using the service is in comparison to other homelessness charities very big. Yeah, I, that could be, because it is conducted on a. A laid back basis. Whereas if you went to an organization [00:06:00] that deals with homeless you're confronted with rules, regulations.\n\nWhereas here it's a bit more formal with say, yeah, salvation Army. Yeah. If you are getting housing from 'em. This is, as s Margo said, it's a lot more laid back. Yeah. It's very casual. You just, clothes washing and drying. It's, they're more comfortable with it. Yeah. It doesn't require anything on their part of No.\n\nApart from a bit of chitchat and some, yeah. Banter and that's about it. And as we were saying before, because we're on premises for the people who live here, they. Often don't tend as a group. They don't come and chat for long periods and then go, because they drop it, they go back to their room and then they come and pick it up after it's dried sort of thing.\n\nBut we do get people stopping in for a chat. We've got a regular half a dozen or so that will sit the whole shift. Some of them don't even wash. They might come down on [00:07:00] Thursday and wash. When we are here on a Monday as well. Yeah. And they'll just come and sit and chat. And there are others that have been through, got their own place made, Adrian in particular.\n\nYeah. Come back. They come back and see us. And particularly when it's school holidays, when he's got his children, he loves bringing his kids back to, to talk to us so yeah. There's a bit of repeat business. Yeah. Not so much business, but repeat. Friends who've been here have left and don't come back to do their washing, but they come back to see us and chat with us.\n\nAnd that's always really nice, isn't it? Oh yeah. We like that a lot. Yeah. Yeah. It shows that we're, they're still mindful of us as people, even though they don't necessarily associate us with orange sky. There's some really tough customers here with extremely tough backgrounds. But they're genuinely pleased to see us.\n\nYeah. [00:08:00] And in fact, we are pleased to see them. Really. Yeah. Yeah. Yeah. In all the years, probably only had two occasions when I've felt just a tad vulnerable, and then I've looked around at who was there, and a couple of the friends that live here. I thought, I'll go and stand near you because you'll look after me.\n\nAnd they would, yeah. That's awesome. What, do you have any sort of thoughts ever on what you hope Orange Sky is in say, 10 or 20 years? Is there this idea that will be awesome for them to be international and massive and huge? Or do you think it's much better to stay small enough to stay.\n\nLike connected and close to volunteers and friends. From a Tasmania perspective, I don't know that can get much bigger if we've only got one van. It is my understanding the van's out seven days a week and sometimes twice a day. So from a [00:09:00] Tasmania perspective, unless there's another man, it can't get any bigger.\n\nBut I find it very encouraging that they're now in New Zealand and. They must help an awful lot of people. I suppose the only way it could expand in Tasmania is if we had a second and or third van in the north and northwest of the state. Yeah, because this one just covers the Hobart area, whereas it's only half the state's population that are here.\n\nThe other half are in the north of the state, and I'm sure the same. People, the same friends that we have here would be replicated, yeah. In similar dimensions in the north of the state. That could be an expansion idea for here, but back to your question about do, how do I see it huge and international?\n\nIt's possible. I don't want it to get too big. I'm not sure that I would want that. I like it as a national, although it is in New Zealand. Am I right? Yeah. [00:10:00] Yeah. No, I think I like it as it is. Yeah. Yeah. Awesome. Well done.\n",
  "themes": [],
  "themeIds": [
    "recoMztJRxSBSDZTg",
    "recN0mEXSEgl0J3G3",
    "rec1mNy9qrcDOaHoZ",
    "recahUOBoBH7IupZ2"
  ],
  "shifts": [
    "recyMRTWqgsYHr8VP"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}