{
  "id": "recminxNfVYnibRUk",
  "name": "Min",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "The transcript discusses volunteers at an organization assisting the homeless with laundry services and showers. The volunteers talk about their experiences, the importance of friendship and non-judgmental support, and the impact of their work on the community. The conversation also includes interactions with homeless individuals accessing the services and conversations among volunteers.",
  "quotes": [
    "rec1wbeWpMXH3lg7I",
    "rec5KRpwdl4OvRKMh",
    "reck022l9jOdNHpXV",
    "recNvs32k2gNOXSwi",
    "recJgPrR8i2JUChJq",
    "recDm3DNJVRsjmSjm",
    "recHQsVdoqpN3wJhL",
    "recxnAf3KuncyYeJy"
  ],
  "transcript": "Oh, yeah. We'll just chop and change anyway. Yeah. Hey, how are you? Hello. How's it going? Track pants? Oh, track pants are for gentlemen at the front. Oh, yeah, just at the front desk and in the computer room. Where the computers are in the big room at the front, there's some boxes with clothes. Shall I take? Yeah. Let me show you where they are. I remember meeting you last time. Okay, let's find your clothes. Okay. Hello, my name's Rita, R-I-T-A, and I'm a team leader and service coordinator for Trambi here in Perth. So just the track pants. And we're pretty busy at the moment, so I keep going a bit. This way. I think it's just in here. Yeah, we've been here for about seven years. First with the van, which has always been very, very busy. Then Trambi, Uniting WA, our service provider here, actually did a big renovation of the premises, and we're now able to actually use the... the internal laundry, which is fantastic. So very busy most of the time. I hope you don't mind, but I just got to keep doing things. Hey, Santina. There you go. Pretty good. Let me see. Hey, baby Wangle. Do you need anything for the showers? Hey. Put some of your stuff here. Hey. Oh, good. Yeah. They're all to be dried, still. Can I put these outside? I don't think so because it's... I guess it's probably too wet. ...it's raining a bit, isn't it? Yeah. Okay, we've got Melissa and Lux is going in the dryer. Cool. Okay, that's good. So this is Min over here. Hi. M-I-N. Yes, nice and short. So we started about 35 minutes ago and we basically have a pretty full afternoon again, but that's great. The difference here for Trambi is that we're doing the shift with two people because of the area restrictions. There's not that much space in here, but it works perfect. And we have a wash list as well. So people can, at the beginning when they come in at the reception of the center here, put their name down. So that works really well because it just gets too busy for us otherwise. So that's good. Tell us a bit more about Trambi. Like, is it the most Trambi? Yeah, Trambi is the most Trambi. Trambi is the most Trambi. Trambi is a, this is the Trambi hub. It's a complete service for the homeless. It provides Centrelink, street doctors, short back and sides. We are here five days a week, as I said, and we hope to be here every day of the week because we've got plenty of volunteers. So that's good. Hello. Did you get a towel? I was sitting in the angle. Do you want to be in it? I don't know. You can. You're allowed to. You're allowed to be. Why do you keep coming back to volunteer? What's the story about you? I think it's fantastic to give something back to people who are less fortunate than we are. I go home to a warm house. And I'm like, I'm going to do this. And these people here, these are really people who need all the help they can get. There's most people here that come to Trambi are rough sleepers. And it's winter. It's cold. It's just, yeah, we need to do something, don't we, to help. What's the, we talk about the word friends a lot. What does that word mean to you in terms of what you do on this tour? I don't know. I don't know. These people really mean something to us. Hello. What's your name? Hi. How are you? Good. Hello. How are you? They become friends. They, they in the beginning, maybe only acquaintances and they come in and out occasionally. But we really building up some rapport with them. And we've got some amazing stories where people finally after months and months, you know, do get some temporary accommodation. Yeah. And then move to better things. But we also have had some very sad situations where people unfortunately take their own lives. And that's been pretty traumatic. But we've got great support here. And, you know, that is unfortunately part of homelessness, isn't it? It's really, really sad. So, you know, hearing happy stories is, it's just amazing. Only last week, it was just fantastic. We, we've had a homeless person here. And fortunately, he found work again after many, many months. And it's now doing fly in, fly out. It's living in a share house. And he ended up on television because he was helping his landlord in the backyard doing some maintenance. And they were actually replacing a sewer system or something like that. And unfortunately, he got stuck in this big hole. So, it was all over Channel 7. We had, you know, the helicopter above. And I straightaway knew it was, it was him because he lives now in the area where I live. And he told me where he was. And I just had this feeling that it was him. But everything was fine. And he came in a few days later to actually tell me what had happened and to also again thank us for that. And thank us for what we've been doing for him over the, over the past month. So, that was just, that was just really lovely. Really nice. Yeah. Okay. I need to get this. What do you think it takes to be an Orange Sky volunteer? Is it a special skill or what is it? No. I think you need to be open-minded. Don't, what do you think, Min? What does it need to be an Orange Sky? Hello, I'm Remley. I'm pretty good. Hello. How are you? Pretty good. Well, pretty much. We can have a look a little bit later if we can still fit you in. Yeah. But. Yeah. I've got to wash it. Yeah. Yeah. What's the time now? I want a bra. What about tomorrow? Are you here tomorrow? Yeah. Yeah. Come on. Yeah. If you come early. Yeah. Then, you know, get. I definitely will. Yeah. Yeah. Get your name on the list at 7. All right. And then we can do it definitely. All right. Cool. Well, I'll check in. See you. But are you having food as well now? Because we can check. Oh, I've got a really good idea. Okay. Can you find the one on that? One. Okay. Now, next, we have our little list again. So, we're doing good. Min. Yes. Teresa not here. She's not here. No. She's not here. Yeah. She's not here. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Hey, Teresa not here. No. No. No, Teresa and no Christo. Oh. Okay. Not yet. Not yet. Okay. Okay. So, then we can do. Yes. Okay. Okay. Yes. Okay. Okey-dokey. Still orange sky liquid. We just decanted a bit. Okay. That's fine. Okay. Oh, just those ones? Just a pair of my knees. We should be able to fit those in. Are they yours? We can put them in here and then we can check if you can put it in with somebody else. Okay. Okay. What was that? David Jones. David Jones? Yeah. Okay. I'll check if I can put it in with Matt. Normally we never wash together, of course. We only, if the friends agree, and I know David Jones knows Matt. He's a friend of mine. He's a friend of mine. He's a friend of mine. He's a friend of mine. I think that's his name. Apparently. But we know him as such. Hi. That's really funny. Yeah. Call him DJ. Matt. Amy, when did you start volunteering? I have lived and worked in the city and I just saw, I guess, timelessness was on the, you know, rapidly increasing and I just wanted to do something to help. And Orange Sky really helped me. Yeah. And Orange Sky really resonated to me. I looked up various organisations, looked at Orange Sky's website. I thought it was very informative, really like the mission, the founders. That's just seemed really progressive. And it wasn't because it's not affiliated with any, you know, religion or politics. So I'm bored. And I guess my own sake as well, like I'm in the corporate world. It's not, you know, fulfilling. I help businesses. But it's just nice to be able to help people. So yeah, I'm loving it. It's very, it's fun as well. I didn't think, I didn't know what to expect, but I love it. And yeah, I just want to do, I just want to keep doing it. Yeah. I love meeting everyone. What's it been like? How long has it been, sorry? So this is my second shift. And I guess every day, Rita's been a fantastic trainer. And it's really, and it's really, yeah. I'm glad you're here. And it's really inspiring to see Rita's connection and relationship with, you know, the staff here, but also the friends. And yeah, I've personally loved meeting everyone. It's very humbling, you know, and putting my own, I guess, ego aside and just realizing this can happen to anyone as well. So. So I'm ready to find you. Oh yeah, yeah, of course, of course. Yeah, no worries. It'll be cool. Yeah. Awesome. So good. So, yeah, you told me that this podcast was just released for the F word, friends. Okay. How do you relate to that word as opposed to like in terms of what you do here and then your, like, friend as well, your own friend? Yeah, that's a great question. So what does friends mean? I guess equal to me. That's the first thing that comes to mind. What else? Sorry, I can't think off the top of my head. What does like friendship to you, what does it mean to friends? Right. Okay. Would be no judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. No judgment. Just care for each other, respect each other, and as cliche as it sounds, treat each other how you like to be treated. And, you know, when they're in a difficult place that I like to help them and when I'm in a difficult place, I'll feel like, you know, they can help me as well. You sound like an amazing Orange Sky ambassador from, like, but you're known as being awesome, right? What would you say to other people who are thinking about volunteering but are not sure of themselves? I would say just give it a go. I guess even if you just wanted to do one shift, there's no, you know, need to commit. You can just see how it goes and, yeah, there's no pressure. You can, it's flexible in terms of, you know, the dates and your, how often you do it as well. So there's just no harm in giving it a go. So, yeah. How do you find the conversations and hanging out with your friends and stuff? What's your, how does that feel to have someone say, you know, I'm going to do this, you know, I'm going to do that. How do you find that? How does that feel to have someone say, you know, I'm going to do that? How does that feel to have someone say, you know, I'm going to do that? Hey, how are you? Just really interesting. It's just really interesting and it's just nice to have really frank conversations and I guess there's no, it's not, it's no small talk. You just kind of get into it and it's just like, yeah, no filter. Love it. Yeah. I'm not trying to be all, you know, professional or anything like that. You just, who you are and it's refreshing. Are you guys crack on? Yeah, yeah, that's true. Oh gosh. I reckon about eight, 10. Yeah. You don't need toiletries? There's a lot. I actually do more washing here than I do at home. No, you're good. My partner said I could learn a thing or two here. We've got, we've got a friend from Orange Island here. Yeah, keep hustling away. Sure. Doing a little documentary on volunteering here. You're right. Waiting for a shower. Yeah. Okay. And you've got the door open. Yeah. And you've got the door open. Yeah. And you've got the door open. Yeah. And you've got the door open. And you've got the door open. Yeah. And you've got the door open. Yeah. And you've got the door open. Yeah, okay. And you've got the toiletries here. This is Ben. Matthew. Oh, I miss Matthew. Matthew. Do you want to be in it? Or not? No, you don't have to. No, I don't know. My dish is not, it's not good. I'll interview the... He tells me all his secrets, but you know. Oh, come on. Is it, has it got power? Yeah. Yeah. It's good, isn't it? It's good. Okay. So tell me, you have not been watching a soccer then? Well, okay. Well, if you're, when you're in the shower... The Euro. You're going to leave your... Yeah. Did you watch the Euro? Do you want to leave that here and I can watch it for you? The Euro soccer? With France and Belgium and Italy. Yeah. It's too late. It's midnight. I was really, really early. Well, look at my eyes. I was up all night watching Holland, my country. And we won. Yeah. Oh, really? We're in the semis now against England. That's going to be... We beat Turkey. Oh. Oh, my God. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry. Don't worry.",
  "themes": [],
  "themeIds": [
    "recyPSeCEhGfQlXSz",
    "recyQHArT5s0YWxTg",
    "recHCPuerMwiGdE7E",
    "recsJK67JDHMnVTAQ",
    "recXpkVJOuB14psYO"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}