{
  "id": "recNR1RB5OL8xuWKi",
  "name": "ZERO",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/E94ZlksJxeP",
  "summary": "Zero, a musician and artist who studied psychology, shares his experience of living on the streets for the past two years, tenting and staying in shelters and hostels. He praises the help provided by Orange Sky, a service that offers practical assistance like laundry facilities to those experiencing homelessness. Zero emphasizes the importance of community connection and access to facilities for people in similar situations.",
  "quotes": [
    "recYuqGcNCC3c2y7w",
    "reczAyQSImSHEgLG0",
    "rec5aoXF2KPAi1dxh",
    "rec21Pru5OE14vF9M",
    "recu1S6jbX3ENgonG"
  ],
  "transcript": "# Zero\n\n[00:00:00] \n\nAlright, just clap my hands. Cool. So you're just looking at me. Don't worry about this thing. So just tell me your name, or name or whatever, and spell it first. Okay. Zero ZE. O Cool.\n\nI'm a musician. I'm an artist. I studied psychology at university. I live on the streets. I've been, yeah, I've been staying in tents. I've been staying at shelter and in hostels for the past two years. It's an adventure.\n\nOrange Sky's great. They're really helpful because just the practical things whilst your houseless, like trying to do your laundry can be a challenge. So the fact that you guys come out to the locations.\n\nNear day space and near the Uniting Church. That's where people get free food. For those who don't know, it's really helpful. It's really helpful just being able to do your laundry whilst you're doing everything else in the day. It's just, it's one more thing that we don't have to worry about. So it's appreciated and volunteers and connection and communication and stuff.\n\n[00:01:00] If isolation is like the struggle of modern society, then connection to communities, the antidote.\n\nI think it's practical. It's practical, more so than anything. It's awesome. Also it speaks to what people that are living on the streets need in a wider sense is access to facilities . There's two types of facilities that would benefit from having community access to the first is necessary.\n\nUtilities like kitchen, shower, laundry. 'cause there aren't spaces where you can just go to do those necessary living function things for free. And the second, third space that would be amazing to see more so in the community is free spaces just to be and to build community from, for example a clothing exchange, like free clothing exchange, a place with couches, with a kitchen, with a lounge, just to hang out during the daytime.\n\nA place where there's a free bookshelf, a place that [00:02:00] encourages free trade. 'cause if you can facilitate an environment where people can help people, that's the best way to solve things. Most people are generous especially people that are in difficult situations. You'll see a lot of compassion because it's valued and we know how far, like a little help goes when things are rough. So if we could have spaces that are built around that mentality of give a little, get a little, a free space with facilities, that's what would really help in this situation. Built specifically, not so much around the idea of charity.\n\nAround community, around free trade, around art, around sharing knowledge and just helping each other.\n\nSo a great example of this that we need to see more of is street to stage. So I dunno if you know what that is. No. So street to stage is, it's run the past two years. The first was at Simple Sider and the second was.\n\nYouth arc. And so it was an opportunity for [00:03:00] people that had experienced houselessness or were currently experiencing houselessness to get up and play music or do poetry on stage. And that was so awesome 'cause it was bringing together people and sharing stories around a shared passion for music, which was so cool.\n\nAnd the energy was great. Oh, by the way, this is another point. The term homelessness. Is inaccurate. It should be houselessness because anybody who's in the situation understands the difference between a house and a home. House, four walls home, that feeling of love, and you can have that sense of home with you if you have community wherever you are, and if you have connection to the earth and to yourself, that's home.\n\nA house, just a place, so nobody can actually judge another being to say that they are homeless because that is something that we determine for ourselves. So I would say that I'm houseless. I don't have a house, but I am home wherever I go. I think that's important that we should change the language around that to better reflect the [00:04:00] situation as opposed to.\n\nAnd reduce the stigma a little bit. We're all people of this planet, who is anyone to say that anyone is homeless? Are we not still just beings altogether? There's no difference. It's no difference.\n\nRight now, in order to get access to those things for free people in this situation need to access them. At specific places at specific times, which can be a little bit inconvenient if you've got like a busy schedule or if you have work or all of those different things.\n\nSo it'd be great to have more free access hubs and also third spaces. To relax because in a heavily capitalistic society, there's emphasis on doing in all places. There's always a function, there's always an economic exchange. Whereas if we had places where it was accepted just to be and to exist. We could facilitate connections and friendships growing more organically and strengthen the community that way, as opposed to it being like, okay, you're in this spot to buy a [00:05:00] coffee.\n\nNobody talks to each other. This look at the phone. No. If it was just a place where we could all just be, that's, I think that would actually help the spirit of the city free spaces.\n\nStarting with the man in the mirror, like we lead by example and if each of us becomes the best we can be.\n\nThat's the true way to see the world get better, individuals making a difference in their own lives and that rippling out to see awesome change in the community.\n\nI don't know the gentleman personally, but from my experience with Orange Sky, it was a brilliant idea and keeping community at the core.\n\nOf any service is the way to keep a good vibe. Let them know. Thank you. Thank you.\n\nI really want a motorbike. That's my big, that's cool. Yeah, because once I have a motorbike, I can camp and I'll be the cool kind of houseless, not the street kind of houseless like Yeah. I don't know. [00:06:00] It's difficult also, if you've been living day to day for a while, just dealing with existence and the fundamentals.\n\nIf there isn't really a foundation, it's really difficult to actually plan ahead. When anybody asks me about the future, I'm like that doesn't exist. No, tomorrow. That does not exist.\n\nThere's several ways that I think that I can help and like conversations like these, if I have an idea. I wanna share that with the world, like more third spaces or letting you guys know about the issue with the hostels and stuff.\n\nSo here we go. Here's some knowledge I've learned, pass it on. But also self-improvement and being mindful in the way that I show up in day-to-day interactions with people and trying to just be kind. Which sounds simple, but I feel is huge. And also I'm thinking like music and art, definitely ideas are powerful.\n\nSpreading ideas is powerful, but the groundwork and just helping people out is also powerful and important. [00:07:00] It's all equally important, but what I'd like to do is make music so good that it just changes the world and makes everybody realize that the concept of housing is absurd and everything should be free and we can all live in peace.\n\nAnd I'll write a song that powerful and beautiful that everyone finally realizes that and then everything will be peaceful. There you go. That's my world domination plan. That's pretty, yeah, that's, yeah. That's pretty good. Yeah, I can, yeah, I'd love to hear that song. Yeah, me too. I'm still working on it.\n\nWhat, you got a particular. Genre of music you like more than others to play or to do? It depends on my mood. Like I do piano, guitar, singing, and electronic. So a bit of everything. Yeah. That's diverse. Yeah. Yeah. Cool. Let's go take a photo. Cool.\n",
  "themes": [],
  "themeIds": [
    "recShwwtjyRH0R60t",
    "recqjmxKa02nCvQnf",
    "recOv0emowPzYwOMw",
    "reco9HvqJ8ON72KrW"
  ],
  "shifts": [
    "recndj288JQOS3Zv3"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "recbVHDwy8oLlvIzv"
  ],
  "storyCount": 1
}