{
  "id": "recNYprFPM2yIp3IR",
  "name": "Joanne Kingi",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Mount Isa",
  "videoDraftLink": null,
  "summary": "The transcript is a conversation with Jo Kingey, a nurse working on rheumatic heart disease (RHD) and healthy skin programs in remote communities. Jo discusses the challenges and successes in these communities, emphasizing the importance of hygiene, community collaboration, and the need for more Aboriginal health workers. Jo also talks about the positive impact of programs like Orange Sky in providing laundry services for families without washing machines.",
  "quotes": [
    "recZSOpZJP7SZM8dK",
    "recWxsuRKxrCSSs3F",
    "recCrj4BGMxQUa2Jz",
    "recpEKKv1BVL5bGcr",
    "recC4BKo0SS4JDxTX"
  ],
  "transcript": "Oh, why is that? Alright. You're not going to be behaving like that, are you? No. I probably will, because I'm like real thing with my... when I get nervous, sorry. That's okay. Just make sure you're in focus. Sorry, do you want a seat or something? We've got a seat in the back of the car. I think it's fine. Bend your knee. Don't use your back as a crane. That's a good tip, actually. Alright, so just your name and spell it. Oh, no, you don't need to spell it. I know your name. Just your name and... I guess I used to say it. Yeah, your name, where you work, and just a little bit about... Yeah, what you're working. So, my name is Jo Kingey. I am the CNC for Healthy Skin. I've been with Queensland Health in North West for the last year. And before this role, I was the nurse navigator for RHD. Cool. Tell us a little bit about the community, I guess, first. Like, what's your role? How do you feel the community sort of is going from your perspective, like what you do? And what are some of the risk factors that are involved in the community? So, for the past year, as the nurse navigator for RHD and Healthy Skin, we have been going out into Mornington Island, Domogee and Normanton. It's been challenging. But very rewarding. We've been seeing some big changes out there, especially around the RHD stuff. Healthy Skin's programme is relatively new. We just did Domogee last week, which the community was very welcoming to us. Yeah, so... Cool. Yeah. Yeah, tell me a little bit about... RHD from your perspective and, like, some of the things in which you're trying to work towards in terms of outcomes for the community. So, RHD is rheumatic heart disease. It's a result of a Strep A infection that can attack your kidneys and your heart. It is 100% preventable. And, unfortunately, it is very well-known in small communities like Domogee, Mornington and Mount Isa. It has been... Can I just cut there? Yeah, sure. Sorry. Yeah, OK. The benefits, what I want to see. Yeah. Yeah. Yeah. So, when I first started a year ago, in the RHD factor, there was a lot of challenges. Sorry, can I mention the inquest and all that sort of stuff, or no? I don't know. What do you think? Is it important for the narrative? Yeah. Yeah. Yeah. So, when I started last year, a year ago, in the RHD sector, it was quite challenging. It was a small team that we had. I'm going out into... I'm going out into remote areas was quite challenging. However, I've seen in the last 12 months a big change in this. The communities have been very opening and welcoming for us to come in and help them. The bisulin uptake was very poor last year, and this has now increased, especially in Domogee. They had... They had a 100% bisulin compliance end of last year, and their rates are about 90, 95% at the moment. So, that was non-existent before I started. This is a result of a good team that has been put in place, which you were talking to Abby. Unfortunately, Jayden couldn't talk. He's... He's working in remote at the moment. But it's about us all coming together and working as a team. What I want to see in the near future is a decrease of RHD, which kind of links into my program at the moment, which is healthy skin and promoting education around school sores, sore throats. And I think, you know, it's a big step, and we have to get our kids back into healthy lifestyles and all that, which will ultimately bring down the RHD rates, more presentations into primary health care before they end up getting ARF. And then RHD. Yeah. That's cool. Yeah. Tell us a little bit about what you know about Orange Sky, I guess. Like, do you know Orange Sky? What do you know about it? Orange Sky is... Orange Sky is... So, I've known about this. I've worked, my background in nursing has been mainly in remote areas. So I was working in Palm Island and that's when I first came across Orange Sky in Palm Island which was really good in there. A lot of people didn't have washing machines and all that sort of stuff so they were accessing that. Now it's now in Dumeji which it's been pretty good there. With the Healthy Skin team that we're working in on in Mount Isa, it has been challenging because part of our program is going into the houses, working with the families about you know making sure you'll get your sores seen to. If you do have scabies or anything like that, that you need to get your sores seen to. If you do have scabies or anything like that, that you need to be washing your linen and all that sort of stuff, your clothes, having clean clothes, clean linen. Unfortunately there's a lot of families in this area that don't have washing machines. So for our Healthy Skin team there has been a barrier because we've had to use the public laundry and having to use that instead of having Orange Sky to kind of come in and support us with that. I have heard that Orange Sky hopefully is coming on board. There was a two-week trial a few months ago which worked really well. So the RHD team were going out doing stuff with rheumatic heart disease patients and doing assessments. They were then bringing Healthy Skin and then Healthy Skin were linking in with Orange Sky and then they were bringing the van into the actual areas like Yelambie and all that and basically doing the Bisolin side of things that for RHD. Then doing skin checks and then also cleaning out the house and then doing the washing. So it was all done in one area and areas that are really needed, needing support and help. That's cool. So from a really high level what does washing do for someone who has those risk factors? How does that help in terms of reducing the risks? So washing your clothes, having clean linen and clean clothes is a necessity really. You know when you've got things like impetigo, scabies and all that sort of stuff, you've got your clothes, your line and your clothes, you've got your clothes, your line and your bed and all that sort of stuff. You need to have clean clothing just like you need to get up and have a shower every morning with soap and all that. If you're not cleaning your clothes and getting treatment, if we're going into the house as a Healthy Skin mob, we're treating them but if we're walking out and not doing a holistic approach on things, we're treating the skin issues but then they're just going to jump into bed with dirty linen and it's just going to re- the cycle's not going to break kind of thing. You need clean linen, you need clean clothes to break that cycle of the skin infections that are going on. Yeah. Cool. That's good. That's great. Yeah. I think that's it but is there anything else? What else do you think other things that you feel like you should touch on? Yeah. Yeah. In relation to what you do, like outcomes, what's collaboration and partnership for you? I would, yeah. So for me, I really want to talk about the shame factor in regards to having orange sky turn up. We need to make it more, I don't know what words, like more people shouldn't be feeling shame about the orange sky van coming to your house. It should be, oh look, this is awesome that they're there. Not like, oh shame, orange skies here. They're going to know that I've got this going on and they're thinking that I'm dirty and all that because that's not what it's about. So we need to make it more accepting in the community instead of pointing fingers and all that. So how we're going to get around that barrier kind of thing is something we as our HD team and the Healthy Skin team need to come together and kind of have yarns about. Also, what else did I want to talk about? The importance of Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Here's my one question for everybody is, for the individual混ra and my book, Iص, I arises about seeing more Aboriginal health workers and practitioners working on the ground and working with the community type thing. Because having me, that comes from another country, in here, and trying to help in that there is a lot of barriers there. Whereas, if we are using community, like Aboriginal health workers who are coming from likeckeemahje, Mornesmith, and Mount Isa, they're going to connect with the, they're going to be more forthcoming than what it would be if I was to go in by myself and yeah, try and get support. That's basically it. Yeah. That's so good. That last bit was awesome. Yeah. That was a good banger, wasn't it? Yeah, that's it. Cool. Yay.",
  "themes": [],
  "themeIds": [
    "rec7SKVzmJET7aqgd",
    "rec3PqIa6qUFPh3FI",
    "recWB42ksVunj4XZf",
    "recCHgg4MBRVUpssp",
    "rectK4aSsMY2f4wIw"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}