{
  "id": "recNhHHQP0LNQsxN5",
  "name": " Tig Hall",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Canberra",
  "videoDraftLink": "https://share.descript.com/view/50UOrdmun69",
  "summary": "Transcript summary: Tig Hall and Paul Miller discuss their involvement with Orange Sky, a service offering showers and meals to disadvantaged individuals. Tig works for CDC Transport and joined Orange Sky eight years ago, while Paul is retired and spends his Wednesdays volunteering with the organization. They share their first encounters with the Orange Sky van and how the service has evolved to provide breakfast for those in need.",
  "quotes": [
    "recXn4FI5iNTLp4uy",
    "rechyrNcNtygtddJF",
    "recUFQbgo37Z0SSQM",
    "rec0rt6XUio9HPAgk",
    "rec10JhSZg2y8sgC9"
  ],
  "transcript": "Paul and Tig\n[00:00:00]\nNo, I was here on Monday. Here on Monday. Oh, okay. So probably all Canberra ones. Yeah. Okay. We ready? Yes. Paul Super Cash. First of all, foremost, your full name and spell it for me. Yep. My name is Tig Hall, T-I-G-H-A-L-L. Cool. And Paul Miller. P-A-U-L-M-I-L-L-E-R.\nI am the queen being clown, I suppose. I work for CDC Transport, which is working with disabled kids, taking 'em to and from school, and I hang around here when I'm not at work, you know. I joined Orange Sky about eight years ago, I think.\nHad been a public servant and now happily retired. So I spend my Wednesdays hanging out with Paul and all our friends. I think I just came here one day. And the van was here, or was it? No, down at We were down in town. Yeah. And they had that, 'cause that's when the first one that had the showers and.\nThere was lunch available? Yeah, so it's that partnering with an [00:01:00] organization which offers additional services. So we, we would meet people while they would go in and have lunch, and now we meet people while they go in and have breakfast. So it gets even better. Yeah. Annie's doesn't mean breakfast doesn't.\nNo, don't they? Yes. They, Annie's has nice breakfast and ke did you first hear about Orange Guy? Well, I'd been I was contemplating taking taking a redundancy at work and on the day before I did, I was. Allowed to leave. I saw the van, which had obviously been up at Old Parliament House doing the actually new parliament house doing where the boys got their Australia Day award.\nAnd I thought, oh, I love doing laundry and I love meeting people, so maybe I could do that as a way of keeping occupied and I've loved it.\nWell, I do my washing here when I can, but I've been here eight years. I've dressed up as Santa Claus. As I said, I'm the queen being clown, so, yeah, it is exactly. And it really is. I mean, you [00:02:00] stop in more to chat than you do really laundry these days. And I'd say most people here are probably more for the conversation 'cause it's such a.\nConvivial atmosphere and it is really a a community with, with everyone. So those, we get, you know, maybe 6, 6, 8 that need to do laundry. And then the rest are just drop-ins to have a chat, tell us what they've been up to, what mischief they've been up to see what to trouble they've been into this week.\nAnd the good news, the bad news, we hear it all. Eight years is a long time to be hanging. Why do you still hang around? Like it's a, it's a significant like, come commitment. What's, what's your reason for this life? I just, as I said, in between work, I just come in, have breakfast talk to see what's happening.\nI volunteer for Salvos in Queenbean as well when I'm not here. So, yeah, it really, yeah, it really is a way to connect. And the thing is, it's, it's, [00:03:00] when we talk about our friends, it really is about friendship. And over eight years, I, I see Paul just as much, if not more than, than friends I've gone to school with and hang out with.\nAnd so we know the ins and outs of each other's lives and it's really nice. It's really nice. So some people you meet for years and then some for a couple of weeks. So, and here's another one. Hey, that's Alan. How Alan, what's going on a good day.\nI'm trying not to be suspicious. Am I not doing a good job? Put me in. Alan rarely does laundry, but again, he's always here. I met him, one of the first people I met all around. He's another one of our little trouble makers. Wash, but they won't wash it. He won't fit in the washing machine. I've tried to put him in, but another one, they won wash me birthday too.\nYeah, he [00:04:00] brings the dad jokes. Alan brings the dad jokes, don't you? The down, been trying to bring your wife down, but she's not comfort. Yeah. So you, yes, you bring doers, big doers and things, but otherwise you've been, you've been around since I started as well. Walking around an old Yes. I don't know, boy.\nAround, around and, and route. So why do you like Orange sky, Alan? Huh? Why do you like orange sky? Why do you like orange sky? I. It is a congenial companionship of the ladies that love it. Ladies, Barry's here today. He might get upset now. They call him, they call him Gertrude. They call him Ger for short and leave off the rude part.\nYeah, well, there you go. Yeah. Oh, this is. A I, yeah, he watch out the, watch [00:05:00] out, the pictures that he takes, and then watch the hour afterwards. You seen the, I I took some photos up in point or whatever they used to. Yeah. And a couple of the ones are still photos. They've used this animation thing on it, and, but the, the daughter stand there with a wife, with his wife, and that was a phone that was a picture, but then all of a sudden.\nI thought goes, goes, oh, it's weird. So what was this for? Just, just changed it. Automatic. Oh. So we get all the stories. We get all the stories. I didn't do it. They, it was done automatic, apparently. Well, that was what I looked at, said I don't remember taking a movie.\nI'm surprised. I'm surprised Elaine hasn't run down here yet. Wow, we haven't seen her today, have we? Maybe she's got time off, so. Yes. And what's the what are you most looking forward to over the next, well, it's been eight years now. What's [00:06:00] next for Orange Sky for this and whatever do you think? Is it just the same old or you intubating?\nWhat's, what's the goal? Well, hopefully they're going to put orange sky, the sleep bus down near the park, near the police station. 'cause we've got a sleep bus that comes in seven days a week. That four or five people that's gotten off the ground, hasn't it? Yeah, four or five people use it every night and whatever it is, they're taking it off, you know?\nSo that's cool. So hopefully we'll have a sleep. The orange sky there too now, so they'll be able to sleep in the bus, wash their clothes, but I think as long as they need, they saw the movie on Sky. You weren't in it. The movie. Orange Sky? Yeah. Called Orange Sky. Well, I dunno, not familiar. Not familiar.\nHe's he's, he's another clown of queen. They're all clowns. They're all clowns. Me. You're not familiar. Always familiar with me.\nAlright. Thank you so much. You're [00:07:00] welcome. ",
  "themes": [],
  "themeIds": [
    "recRDDBTzNZb7kHHX",
    "rec6q1gyIh5Bquqzb",
    "rec8kWn5A1Fz4Qp2I",
    "rec8nZEsxr35q5Bwm"
  ],
  "shifts": [
    "recMV6by8CnkgQ2OD"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}