{
  "id": "recnmqcAGASmI5Ek7",
  "name": "Chris_Phoniex_Service_Provider",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "The transcript is a conversation where one person, Chris, discusses his involvement with Phoenix Place and Orange Sky, organizations that provide support and services to the community. Chris talks about his experiences, motivations for volunteering, and the impact of rising living costs on the community. He also praises the work of Orange Sky and highlights the importance of providing a place for people to connect and have conversations. Overall, Chris expresses his dedication to continuing his work as a support worker and remaining involved with Orange Sky.",
  "quotes": [
    "recHWz09e58djuBIq",
    "recHXz9jl5Axce9z6",
    "rec7iiP3Z7NhYnab2",
    "reczaS3Mxp1k6TTfK",
    "recDSL5Std6UEM9mt"
  ],
  "transcript": "Nah, I'm no good at talking. You'll be fine. Just answer the questions and don't swear. Swearing, swearing. He'll edit it, beep it out. I like swearing. I could have had my sunnies on. Eh? I could have had my sunnies on. Chillax man. Yeah well, I'm not good at answering questions. That's alright. I'm very good at asking. Easy. Keep it short and simple. Don't waffle onto it all. But why do you do this? Why does Phoenix Place get involved? Well, I'm just going to say I don't know. Just say, we get involved because it's an opportunity to give back to the community. You come city. No, I mean I'm going to blow the car out. Alright, this will be too easy. It's just a yarn with me. Don't worry about showing off or doing anything wrong. I don't show off. Just your name and if you could spell it, that would be great too. Chris. C-H-R-I-S. Cool. And Chris, tell me a little bit about Phoenix first, I guess. Eh, I don't know what you want to say. What sort of, what happened this morning, I guess? Like what's your, what sort of activities and stuff do you do? This morning, the meals are cooked by our wonderful kitchen staff at Phoenix. And then staff are chosen. Staff are chosen to come and serve the people. They do their washing here, they do their laundry. They're very appreciative of all the food they have. And just talk that conversation with them. It's somewhere for them to come and discuss what's happening in their lives. And we can direct them in the right direction for extra support. Cool. How long have you been doing it for? Probably just on two years. Yeah. Wow. And what keeps bringing you back, I guess, to do this? I just feel it's an opportunity where I can give back. Like, yeah, there's a lot of people that need support and conversation. And I just take it as an opportunity to do that. And what, tell us a bit about, like have you, how long have you been in Mackay for? And tell us a little bit about like how, what sort of stuff you get up to in Mackay. I've been in Mackay on and off for about 20 years. Have family here. And, I don't know. That's cool. And like, do you, like it's a bit tough at the moment for some people. It's really like plus a living and stuff and they do it expensive. How's that impact Mackay and people in Mackay? It's a big impact. A big impact. And I see it with a lot of our participants. Groceries having doubled in the last 12 months. Their funding hasn't doubled. There's a lot of people who are in the system even and are really struggling. And that's very frustrating. Very frustrating. What do you think about Orange Sky and the stuff they do? I think they're absolutely wonderful. Lisa runs an absolutely wonderful organisation. Yeah, she gives and gives and gives. It's amazing. What do you see as the impact, I suppose, of this washing conversation? What do you think is like the most important part? I think the people that come here, they feel, they interact. And it's somewhere for them to come. They get out of their normal day-to-day life. True. Yeah, it's interesting, I guess. Like, when I used to do this stuff, I think that was the thing that was on my mind the most, right? You have this, but then what happens after, I think, is interesting. And what's like, what's the most important thing? What's future hold for you? Are you going to keep doing this? I love my job as a support worker. I love it. And I love coming here to Orange Sky. Yep. So good. Yeah. Awesome. That's it. Beautiful. Thank you. That was too easy.",
  "themes": [],
  "themeIds": [
    "reck4C7osenahLgty",
    "recrnzKILJOJtU6jN",
    "recDtceEmOCqW981Y",
    "recM2iBTZw7CDIMwu",
    "recogNb2PxlfhAxPc"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}