{
  "id": "recOzwtmRwIQ38md1",
  "name": "Paul Gordan",
  "role": "Supporter",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "Paul Gordon has been working for Horizon for 10 years and is involved in providing maintenance services for external companies. He heard about supporting Orange Sky through volunteering and finds it aligns with Horizon's values of giving back to the community. Paul and his team have set up a barbecue trailer to provide food and support to Orange Sky in Mackay. He believes in the impact of social connection and addressing the cost of living crisis. Horizon supports Orange Sky through both financial and volunteering efforts. Paul is focused on continuing",
  "quotes": [
    "recOAnO0IMt7QwInk",
    "recXxwaGOenFusboq",
    "recMJtkdBgqvLHMhU",
    "recITB89GmbYITPY9",
    "recykJIVSFEfiqSip",
    "rec5zc2YrYarRfFso",
    "recJ33OWC4u9FnLta",
    "recic3rUvp09cJHpF",
    "recjTTX4l8J4xyqJG",
    "recCVbgAsoijdpnGN",
    "rec8vQO18T2fSOy2L"
  ],
  "transcript": "Do you want Team Horizon? Nah, one each. That's alright. That's alright. Easy. Team Horizon. How you been? Yeah, good. Busy. New gigs good? It's awesome. I freaking love it. Much better? It's just such a different culture. Okay. You still here? Nice, yeah. In the other building? In the network site upstairs with the engineers. Okay. Yeah, my team are so lovely and they're so people focused. That's good. Breath of fresh air for you? Yeah. Being in a very nice people focused area. Righto brother. So just your name and if you can spell it, that'd be awesome for me. Spell? Yeah, okay. Paul Gordon. P-A-U-L. G-O-D. P-A-U-L. G-O-R-D-O-N. Awesome. Tell us a little bit about your role at Horizon. How long you been in this area? Yeah, sure. I've been working for Horizon for 10 years now. Various locations around the country. Brisbane, Toowoomba and now Mackay. And I look after a maintenance contract for an external company that we provide maintenance services for. Cool. How did you first hear about RSCO? Well, the Horizon head office is there. Yeah. Well, I was here not too far down the road and Horizon is one of the signature sponsors of Orange Sky. I started volunteering here on a Wednesday morning and the concept's just fantastic. Bringing those sort of simple services to people connects them also to then a range of other services and just gives them that sense of belonging and it's very aligned to our company values and hence wanted to be involved. Cool. That's cool man. Can you tell me a bit about those aligning values and how that sort of fits with how you came to be supporting Arizona? Sure. Arizon is very much focused on giving back to the community in which we operate. As Australia's largest rail freight organisation, we are located all around the country. It's a very inclusive culture, a culture based on ensuring that we deliver excellence in everything we do. Included within that is making sure that we support the communities that we operate. That's cool. Do you get a chance to come to ship very often? How do you feel when you come to our ship? Yeah. So now we've started a barbecue trailer down in Serena. Serena is about 30km south of here in Mackay. There's a pod down there also. And we wanted to bring that food service offering to the Orange Sky pod down there. So we asked our apprentices down at the maintenance facility to build a purpose built trailer as one of their projects, which they did. And in classic engineering and Arizon form, we went all out. And it's a really nifty looking trailer. So now on a Monday, we get the loco depot, the wagon depot, the transformation team, the overhaul facility and my team on an eight week rotating roster. And we head down there and cook sausages, onions and provide it to the friends of Orange Sky in the hope that food brings them in to then connect them to the services that they may need from time to time. That's cool. I'm really obsessed with this. I'm really obsessed with this idea of partnership recently. What do you think represents a partnership between you and Orange Sky in totality, not just financial or other things? What does a partnership mean to you? Sure. Well, beyond the financial support that we provide, a lot of Arizon staff, myself included, provide that volunteering support as well. That's quite important because of that core principle of making sure that we... support the communities in which we operate. So we're donating both time and dollars. That's cool, man. So Orange Sky is about washing, conversation, connection, all these types of things. Is there something that stands out for you that... Like if you talk about impact, what do you think the impact is that's supporting the community here? The mixture of things, the people that can plan for a single one or what do you think? I think what's changed my perspective around the definition of homelessness or what that classical view of someone living on the streets is that's shifted quite a lot. Has been my experience. Cost of living crisis is real. Often it doesn't take much to be on that knife edge between everything's okay to all of a sudden you're living out of your car. In a place like Mackay, you know, with vacancy rates at less than 1%, my own view of what it is to be homeless has shifted quite fundamentally. And then also it's just that social connection. There are people that come down to use the services and to have a nice sausage sizzle for no other reason but to connect with other human beings, which I think is a wonderful concept in and of itself. That's cool, man. Do you think there's a vision that Horizon has of what Orange Sky should be growing or focusing on in the future? Or is it kind of like you trust them, you just go with it? Or are there different ways in which you as an organisation would like Orange Sky to grow, I guess, in Australia and maybe around the world? Yeah, I think there's probably other people in our organisation that could comment on that. But the concept's quite simple and powerful. Because of that simplicity, I don't think we're in a position to provide that guidance beyond the support that we do in various parts of the country that we operate. That's cool, man. It's always one of those things, I think people have this dream, Orange Sky can be everything, but the simplicity is sometimes where the power is. Down in Serena, for example, Lisa's doing some work with a local bank. There's an unused sort of toilet block down there. And she's wanting to come in. And she's wanting to convert that into a shower and a toilet. So when you think of you've got shower, toilet, laundry services and food, that's kind of like the golden triangle of providing that dignity of service. So there's things like that, obviously, that we can support when it makes sense to do so. But I think the fundamental principle is very sound. And so I suppose since not knowing who Orange Sky is, to being a supporter and stuff, personally, what's next for you in terms of your appreciation? Yeah. And your appreciation or engagement with whether it's Orange Sky homelessness or social issues? Do you have a particular vision or something you'd like to do? Yeah, sure. Well, we've just kicked off this barbecue trailer down in Serena there. We're eight weeks into launching that service. So for the next couple of months, we just want to really make sure we bed that down and create that consistency of service so that we can create that awareness for those people in need. I haven't really thought beyond that. Cool. Is there anything you reckon I didn't touch on that you think you should from an Horizon perspective or anything you'd like to say that's like specific that wasn't captured or? No, I think we wear orange all day and Orange Sky is an orange brand and that's a match made in heaven. Wait, did you plan that or was that just something that came up? No, I saw Ashley in the background. Thanks, brother. Thanks, mate. Well done. I'll just take a quick photo. You actually do? That's all right. Yeah.",
  "themes": [],
  "themeIds": [
    "recmwJeAK8haKZdDa",
    "recxUmkdNJJy4oFwG",
    "recNaJtz6sstrxlWL",
    "recr9JtwcXRxqS9cG",
    "recLsyMNua4nywXlJ"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}