{
  "id": "recov7pUSzHbRRwbZ",
  "name": "Sharna Wentworth",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Melbourne",
  "videoDraftLink": "https://share.descript.com/view/4oga0paZFGF",
  "summary": "Shana Wentworth talks about visiting Ry Gully for a meal, catching up with old friends, and appreciating the community support.",
  "quotes": [
    "recsmsVjNts64o8OM",
    "rech5v14VKrBwujz3",
    "recFrE0mUjDXFYGTP",
    "recrJDkDKCi6ryxZi",
    "recC7aaabAtUDEJcO",
    "recoA0mcka9jFdlPQ"
  ],
  "transcript": "Shana Wentworth - Friend - Foothills\n\n===\n\n[00:00:00]\n\nSpeaker 5: Rot. Eagles?\n\nSpeaker 6: No, the copper. Oh no. What? Who's rot? Oh,\n\nSpeaker 7: you're the one videoing.\n\nSpeaker 5: Oh. How are you?\n\nSpeaker 7: Good. How\n\nSpeaker 5: are you? How am I Dar?\n\nSpeaker 6: You wanna come and have a yarn? Why not? Yeah. Want\n\nSpeaker 5: to? Yeah. Have a yaba.\n\nSpeaker 7: Why not? You wanna hear my story? Yeah,\n\nSpeaker 5: we'll do. We'll do. I'm having a go next. Oh,\n\nSpeaker 7: I thought you were finish. Oh,\n\nSpeaker 5: I know darling.\n\nI know. We're just familiarizing ourselves. Oh,\n\nSpeaker 7: okay. We're ready to go. Oh, okay.\n\nSpeaker 5: I won't be more than two hours. I'll be right.\n\nSpeaker 6: Okay. So on on the camera, we just need your full name and to spell it so that we make sure we know the name right.\n\nSpeaker 5: Hello, my name is Shana Wentworth. S-H-A-R-N-N-A-W-E-N-T-W-O-R-T-H.\n\nSpeaker 6: Amazing. Tell us a little bit about yourself. In your story?\n\nSpeaker 5: Well, I came down here today, uh, Ry Gully. Um, it's, it's not so [00:01:00] much that I'm starving hungry, but, um, it's nice to get out and have a good clean cunt meal. Most of these persons I've known for a long time, and, uh, Steve, who runs the establishment, I've known him for.\n\nOh, 25 plus years and I appreciate that they've got some fruit and veggies to take home. 'cause everything helps. And over the years I've spoken to people and we've laughed, we've cried. We are giggled, we are screamed, we've yelled, we're everything. And it's just nice to come out and meet people. Um. Some of them are around my age, some are younger and that, but not everyone's fortunate to be able to drive down.\n\nSome of them are homeless, but I've never seen any major problems [00:02:00] down here. And if there is, it would be NI in the bud. Very quick. There's no alcohol and there's no smoking on the premises. And people, well, they just respect. And they're just grateful and we just, you know, laugh and just talk about things and it's great and there's always plenty to go around.\n\nSpeaker 6: Tell us a little bit about Orange Sky and what, what sort of you, what do you feel about their presence here? Or what, what do you think about Orange Sky?\n\nSpeaker 5: Well, I feel safe and, uh, there is a police station close by, but. Uh, to my knowledge, they've never had to come. Uh, it's very handy for people that don't live in the immediate area because the train is within walking distance.\n\nI believe there are buses that come into the area to help people, and I think it's just [00:03:00] nice.\n\nSpeaker 6: And what do you think about Orange Guy?\n\nSpeaker 5: Oh, I appreciate it because there's been times when I've got behind with the washing and I've only got a small washing machine. And these gorgeous ladies and Jens, they'll take anything.\n\nAnd not only that, they'll dry it and they'll fold it for you all with a smile.\n\nSpeaker 6: Wow. And what about like the, just the people too? What do you think about the people and the service?\n\nSpeaker 5: The people are good. They're good, they're friendly. I'm not very good on names, but you know, I just say, hi, darl, how you going?\n\nHi sweetie. Or, or whatever. And sometimes people give you a kiss and a hug. Sometimes people are upset and they need to talk to someone. I'm not saying I understand everything or that I can help everyone, but it's nice to just have a little talk. Mm mm And, and [00:04:00] some people, not for me to say, they come down and you can tell they've had the same t-shirt on for a month.\n\nMm. Not my business. Mm. There was a service that where you could actually have a shower here, lot like, um. I think there was two or three showers, a caravan type thing, and I thought that was lovely. And whilst you're having a shower, oh, free soap and towel, bit of the old shampoo. Mm. Then you could, um, you know, if you were really desperate, someone finds you clean clothing, believe me.\n\nMm. It's very kind. And then whilst your clothing and yourself are being freshened up, you can go and have a lovely meal.\n\nSpeaker 6: Why do you think these types of, um, meals and services are important in the community?\n\nSpeaker 5: Well, as I said, there's people that, [00:05:00] um, they just, well, not everyone, but you see them sitting on the streets so lonely and so depressed, and nobody will talk to them because as I said, the same t-shirt for a month.\n\nAnd you don't know their situation. Not everyone is drugs and alcohol. Mm-hmm. Bear in mind, a few may have a mental health, which is made worse by being on the street. Mm-hmm. Because there's, there's not really anyone around to help. I've seen it in the city. They've just walked past and what's a couple of dollars?\n\nThey could get some cool water. A nice sandwich. Mm.\n\nSpeaker 6: And how would you describe your own sort of experience over the last little while? Like, is that, like, how would you explain to people your own situation, scenario, and story?\n\nSpeaker 5: My living [00:06:00] situation? Mm, yes. Um, I'm now divorced. Um, I am, I'm in a ministry of Housing house, home house.\n\nUm, I've been there for 26 years. Um, I'm a mother of five. They've all left home of course, and um, unfortunately they've got themselves because I pushed very hard for education and they've got themselves some very good jobs and they forget that they've come from me and mild background. Mm. And the money that they receive each week has gone to their heads and they see me as just a thing.\n\nMm. I find it, sorry, I find it very hard. Um, I see it as borderline, um, a abuse. Mm. And [00:07:00] I have my youngest son I have not seen for three and a half years. Um, he. He's on alcohol. He was living with me after his divorce and alcohol causes temper. I believe I'm allowed to say to him, behave yourself, and if you don't, you're out the door.\n\nIt escalated. The rest is private. It was a police matter.\n\nSpeaker 6: Mm-hmm. What's the, um, what's the opportunity to. I suppose, yeah. You've been talking about this place and what's the opportunity to create new community and new people here? Do you know what I mean? Like is that something that you are working to do and is this something that's helpful for you?\n\nSpeaker 5: Do think? Well, look over the years I, I've been coming here, as I said, several years over, over the years I've noticed, and as recently as 18 months [00:08:00] ago, a lot of. Uh, places similar to this that were offering meals. Mm. They've just run out of funding and they've closed down, et cetera. Right. And as a result,\n\nSpeaker 6: sorry, there's a nice photo.\n\nSpeaker 5: And as a result, a lot of them, uh, have heard about this place through word of mouth and they've just drifted across here and it's nothing as Steve is extremely generous. And it's nothing for a hundred plus people to turn up at two separate settings on Christmas for a meal and a little bit of happiness, laughter, a generous with the present and a nice box of food to help you through the Christmas break.\n\nAnd for miles around, this is the only place where you can get a good quality meal. And they, [00:09:00] they have soup in the wintertime as well as the meal. Mm-hmm. And you can take food away and people are grateful for that. And it's good food that you can eat. Um, a lot of people don't have cooking devices because they're, uh, maybe sleeping in the car or something like that.\n\nThey can come here, get a nice full belly, and they'll sleep well that night.\n\nSpeaker 6: Wow. So amazing. What, what do you think, what do you think the general community could learn from these types of communities and people helping each other? Like, do you think that this is something that is unique and like, how do, how do people, you said it before, like, I think money gets to people's heads sometimes and they forget how to help people.\n\nYes, it's true. It's true. How do we, how do we talk about these places that other people sort of, these\n\nSpeaker 5: people are on the same level as me? Just be grateful. Today, [00:10:00] there was very little on the takeaway table, as in fruit and veggies. I was offered more and I looked around, there was people behind me and I said, look, I'm taking what I can fit in my fridge and what I can eat.\n\nMm, okay. I will make way. It's the way it is. And the people in there, they're not greedy. And if they appear greedy, it's just, they've come from different backgrounds. Some of them have been in jail.\n\nSpeaker 7: Yeah.\n\nSpeaker 5: And you don't talk, you just eat your meal and you guard your meal. Mm. Because that's the, the situation that they may have come from.\n\nMm. So you, you, you, you don't judge them how they eat or what they put in their pocket because no one's going to say, put it back. No one.\n\nSpeaker 6: Mm. Alright. I could talk all day, but I think we need to like find some other [00:11:00] people. Well,\n\nSpeaker 5: I'm just grateful and there are occasions when Steve gets in a hairdresser free.\n\nAnd he also gets in a masseur free and people love it. Yeah, that sounds amazing. Yes. Yes. And it's so good. All right, I'm gonna take a photo. Okay. Okay. Get my good side. I'll, I'll take, I'll take that mic off first.\n\nSpeaker 6: Oh,\n\nSpeaker 5: just in the shot.\n\nSpeaker 6: Did\n\nSpeaker 5: I say too much?\n\nSpeaker 6: You said an amazing amount. It's true. Yes.\n\nAre you?\n\nOh, I'm way too bright. One sec. It's, this is my fault. Okay.\n\nHow about one you sit up a little bit more and Oh, that's, oh, that's awesome. Okay, great. Amazing. Thank you so much. [00:12:00] Um.",
  "themes": [],
  "themeIds": [
    "recFnWU924ItQpETi",
    "recAzZ7hse0O8DVp9",
    "rec8STQf125WyZJuf",
    "recGuUx1jyAhdnDmK"
  ],
  "shifts": [
    "recMnBRiSmrELgnVe"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "recMQ87ZDucibef1F",
    "recVmRL0L017j13g1"
  ],
  "storyCount": 2
}