{
  "id": "recpef5KEbRJglgGG",
  "name": "David Allen",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Melbourne",
  "videoDraftLink": "https://share.descript.com/view/Nw3cgPPpJMv",
  "summary": "The transcript features David Allen discussing his wife Jean and her journey with brain damage. He also talks about their decision to move to Australia and Jean's health struggles during childbirth.",
  "quotes": [
    "recmmmglwBwiEFxYQ",
    "recD9diGyQccj4Ut1",
    "rec4sUuEQ9V2Ek5NG",
    "recv1VEH4NvufVNZn",
    "reclAonKyXNt6ygVB",
    "recPg2ajfJsnJDu4O"
  ],
  "transcript": "David Allen - Friend - Doveton\n\n===\n\n[00:00:00]\n\nSpeaker 11: All right, so we're going to start.\n\nI didn't get it sharp before so I'm very, I want to make sure it goes sharp.\n\nDavid: Yes.\n\nSpeaker 11: So you tell me your name, your full name and spell it.\n\nDavid: My name is David Allen and Jean Allen was my wife. When she had a child, she had 75 percent brain damage. It took 10 years to get to walk and talk, but she tried and tried every day to get better.\n\nIt's called, the book is called, Waiting for the Sunshine, One Day at a Time.\n\nSpeaker 11: Tell me a little bit more about yourself.\n\nDavid: Ah, yeah, I don't know what to say. I was born in England and then we [00:01:00] found that we couldn't get on in England so Jeannie and I was caught in and we decided we'd come to Australia. She put in for Australia first and got permission to come before I could.\n\nSo she got on a big ocean liner and came all the way across the world on her own, just for me. Yeah.\n\nSpeaker 10: Wow.\n\nWow.\n\nDavid: So when she was having a child, things went wrong. Obviously I must stand by her because, as I said, she came all the way across the world for me. And then, when she was sick, she had the child, she had 75 percent brain damage, which was caused.\n\nToday, they've got a name for it. It's called a clampsia today. In those earlier days, we didn't know what to call it. But they nursed her and looked [00:02:00] after her at the Hamilton Hospital, which saved her life. It was impossible to believe. How many people came to help me?\n\nSpeaker 11: What's it like having people to help?\n\nWhat does that feel like? Oh,\n\nDavid: it's phenomenal. In those days, you just couldn't believe the kind of help and people that came. It was tremendous. One lady had five children, two adopted children, and offered to take care of Jean's baby for 14 months. I said, because Jean was that ill, she couldn't look after the child at all.\n\nYeah. And so many people helped me along the way, it was unbelievable.\n\nSpeaker 11: Have you ever used the Orange Sky for washing?\n\nDavid: Yes, I have. What do you\n\nSpeaker 11: think of Orange Sky?\n\nDavid: Oh, I think it's a terrific idea. Especially nowadays that things are getting tough. And you need somewhere to bring it to. If [00:03:00] you're sleeping in your car, or anywhere, sleeping about, you need to be able to bring everything down to get washed and cleaned.\n\nAnd these meals that's out and about is tremendous. We really couldn't do without them. What's it\n\nSpeaker 11: Having people to talk to and having a community? What's it like having people to talk to and a community? Yeah,\n\nDavid: Of course, we come round these places. To meet people and talk with them and keep you associated with what's going on and around you.\n\nMakes a big difference, yeah. Oh yeah, you'd be terribly lonely and stuck if you were just at home on your own and not able to get out and see these people. Yeah, absolutely. But it's surprising how many of them you meet in so many different places, all the same situation. Oh yeah, it's terrific.\n\nSpeaker 11: Do you get to talk to lots of different people here?\n\nDo they have lots of different stories [00:04:00] and experiences? Oh yes,\n\nDavid: everybody that comes to these. Food, places, or meals. Of course they have different stories and have worked different ways in life. I said, and then found myself completely stuck because I said it's changed now. If you haven't got it, you will never be able to get it at the moment in Australia.\n\nIt's just got beyond the working man to be able to afford to live.\n\nSpeaker 11: Yeah. And,\n\nWhat's what are some things next for you? I've got some, tell me more about the book and like what you're doing with it.\n\nDavid: Yeah, with the book it encourages people that Say they've lost their job, they've got two or three children, the bank's knocking on the door for the house, and they're going to lose their house or their car.\n\nThe book encourages them to show what you can get through as long as you've got your partner and stay together. There's nothing like having reasonable good health, [00:05:00] your partner and your family. Nothing else matters. The house and the car doesn't even matter at all. What difference does it make? You lose the house but as long as you've got your family and your partner then you've got everything.\n\nSpeaker 11: I'm really interested in stories. What do you, and you've obviously written a book. Why do you think stories are important and why do you think books are important? I\n\nDavid: think the story is so important in the book because it encourages people to stay together and to be able to get through tough times.\n\nAs I said, Jeannie was so ill, it took 10 years to get her to walk and talk. It took 30 years for, to try and run a home. I said, but that's the why the story is really going very well. It, for these times when things are tough and you're struggling so much, it really helps you with the [00:06:00] family and stay together.\n\nOh yeah.\n\nSpeaker 11: If you were to tell someone why they should buy the book, this is your chance, why should people buy the book?\n\nDavid: They'll never remember or they won't have nothing left from their legacy or their entire life of struggling or the way they've gone through life. So if you can write a book about your life, how you started, how you found your partner and how you progressed and struggled through life, this is why you need to write a book.\n\nBecause you won't have a legacy to leave behind unless you've got a book of your life story.\n\nSpeaker 11: And what do you hope happens with the book? What do you hope is the outcome\n\nDavid: of it? We're hoping that it'll help a lot of people that's struggling. And there's so many people came to me and said, Oh look, you've wrote a book.\n\nfor sharing the book with me. Because she'd got three [00:07:00] children and was losing the house to the bank. And she was in tears when she thanked me for sharing the story. I said, this is what the story's about. It's to try and get people to stay together. And be together, I said, this is a, this is what it's about, it's to get you through tough times, when you think you're struggling and having bad times, you can understand how, if you stay together, you can get through it.\n\nYeah.\n\nSpeaker 11: And what's where are you going back to tonight? Where are you staying, and what's that like?\n\nDavid: Pardon?\n\nSpeaker 11: Where are you staying\n\nDavid: at the moment? Oh, I've got my own house. So I'll be going home to my house. But of course I'm on my own now, so it makes an awful difference. Without coming round for these meals and coming to these places, oh, it's such a hard time staying and living on your own.\n\nYeah.\n\nSpeaker 11: It was amazing to hear your [00:08:00] story. I'm going to buy one of your books. Yes. On Amazon? Buy it on Amazon?\n\nDavid: Yes, buy it from Amazon.\n\nSpeaker 11: Amazing.\n\nDavid: Yes. Cool. You will thoroughly enjoy it, and you'll be amazed on how many people. Like the story because it gets them to stay together and none of this family violence and all that.\n\nJust please understand that you've met together in the first place because you wanted to. So no having the nonsense of family violence or anything like this. Just be there for one another. And you'll really get life better.\n\nSpeaker 11: Amazing. Alright, I'm gonna get your details so I can",
  "themes": [],
  "themeIds": [
    "recKrstJ18w9wVOgm",
    "recNpLT6EDMYS3Sci",
    "reciX9GnrevKAtAzW",
    "recD4ujK5lFS42k4M"
  ],
  "shifts": [
    "rechTpnJ3jSEKsyh3"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "rec9ZKKH2ZXrHFIgr",
    "recUWGY0kjXHPqG3x"
  ],
  "storyCount": 2
}