{
  "id": "recPRYyNVTSHNoRAw",
  "name": "Lesley Lalor",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Newcastle",
  "videoDraftLink": null,
  "summary": "Leslie shares her journey of volunteering with Orange Sky, starting with getting involved after seeing an article in the newspaper. She describes her experiences driving the van and becoming a team leader at the Hamilton South location. Leslie emphasizes the importance of communication and connection with those experiencing homelessness. She highlights the impact of simple gestures like conversation and clean clothes, both on the friends she serves and on herself. Leslie encourages others to volunteer and shares her positive experience and growth through her involvement with Orange Sky.",
  "quotes": [
    "recEWN5dCMQY1VQFb",
    "recUY7Cl7DOxr8reb",
    "reckfhcTA2fcjlohI",
    "reconBgpHNFldp0iW",
    "recZNHz16NchKu1Hm",
    "recBkmNDBEQJrTHHY",
    "recwwHsvfCSlKNI51"
  ],
  "transcript": "My grandmother used to pick me up from school every single day and I lived in that house. So it's one of those times where you, where you like, it was probably a very reflective few days I think. It'd be nice though, if I can come down and help. Alright, so this is, oh yeah, yeah, yeah, super helpful. So this can go behind your shirt and then this clips on and that holds it on. Yeah, yeah, yeah. So you put it like high-ish but like still hidden if that makes sense. Oh yeah. Okay. Great. Oh, that's perfect. I think we're ready. Okay. So you just look at me. Yep. Don't worry about the cameras. Cool. So just your name and spell it just so we can have it with all of you. Spell it? Okay. So my, just first name? Yeah. My name's Leslie, L-E-S-L-E-Y. Oh, maybe your last name too. Laylor, L-A-L-O-R. Cool. What's the Leslie story? Tell me. Tell us a little bit about yourself. Oh, right. The Leslie story. Well, fortunately, my mother didn't call me what my grandmother wanted to call me because I was born on Christmas Day. So they wanted Carol or Noel or something like that. So mum chose to name me after her cousin who went down in a plane during the war, who was a male, but changed the spelling to the female. Wow. That's exciting. Yeah. And tell me, yeah, tell us a little bit about like what got you here, I guess. Okay. So I had reached a stage where I had finished work. My... One time away from the plane. Okay. We waved to it? We haven't got too many planes here, is there? No. That's unusual, actually. And that's a light one. Yeah. Yeah. Yeah. We get big ones go over because the raft base is up at Williamstown. Yeah. Yeah. Yeah. Yeah. Yeah. So, and my children were adults. My grandchildren had reached the stage. They didn't really want to spend holidays. They didn't want to spend holidays with Gran anymore. And I stumbled across Orange Sky in the news in the Newcastle Herald quite some years ago. And I thought, hmm, this might suit me. So, yeah, I went to... I was face-to-face onboarding back then. And yeah, joined. And that's where I've been ever since. What was the first bits of volunteering like? I went from... I'd drive the van up to Port Stephens, up to Nelson Bay on a Monday night. And I'd go to the airport. And I'd go to the airport. And I'd go to the airport. And I'd go to the airport. And then once COVID hit, of course, we all shut down. And then I got a bit... And then I got a bit... After COVID, I got more involved. I was down at the Swansea shift. Bit by bit, things happened. People resigned. And yeah, now I'm a team leader here. Actually, I started this shift. I was team leader when this shift first started. And things happened and people weren't doing what they were doing. And I took on service coordination. And I took on service coordination. And I took on service coordination. And I took on service coordination. And I took on service coordination. And I took on service coordination. Amazing. Tell us where we are and what the shift is like. Oh, here in Hamilton South, we're in a social housing area here at the community hall. we're in a social housing area here at the community hall. It's... what I would call a fractured society. It's a little bit... there's lots of issues in here, but there's lots of beautiful people as well. Our service provider is Catholic Care. They do a lunchtime barbecue, which if you could put the sense of smell in with this, you would be able to smell the bacon and the sausages cooking, which makes everybody, mmm, very nice. Yeah, so they do that, so we're here when they're here. And, yeah, our friends here are... Most of them are here waiting for us before we get here. We've become... I think we've become a real integral part of this... ..the fabric of this society. They look forward to us coming and there's Bob just going. Do you mind if I say bye to him? See you, Bob. See you, bye. See you next week. Thanks, Bob. Good for hanging out, mate. Will that be online or not? I will send some information so you can see what happens to it. How's that? OK, good on you, mate. Thanks, mate. See you next week. Take care. Yeah, so, yeah, that's about what happens here. And, yeah. There's two friends that I talked with before in the interview. Mm-hm. Julie and Bob. And Bob, yeah. Tell us a little bit about, like, what that feels like for you, their relationship and their time here. It's... It's really interesting. Like, they... Julie, in particular, loves us being here. It gets her out of her little one-room, confined apartment. She... When we first started here, she had issues with her hip. She had broken her hip. So it was... Her social... It was... JIM Officer Yeah, and she's lived in Australia for, like, in the last five, ten years.opolitically, she... We've had issues for four, five years, in Sachenia, Canberra in New Africa, and DB Update. We've had... We've had problems. We have aícula. We really have. Several... As... As a family Come to speak to the people who live here in the asking-of-acks, they can't happen without us. Soil all that. So there are only so many of them at the beginning of our journey, after volunteering for this now? With Orange Sky? Well, I quite often tell people this little story. I used to not communicate very well with homeless people. I would feel embarrassed about them and I would sort of kind of walk past. But now, after talking to them, particularly one guy that was on shift, he said he can normally always get a meal, he can normally always get a shower with the services that are around and about. The thing he struggled with most is the sense of social isolation, that people wouldn't talk to him. So now I'm up front, I go straight up to them. If I see anybody sitting outside the shops or on the street somewhere, I will either ask them what they would like to eat if I'm going into a shop and buy them something to eat, I still hesitate to give them money, but I will buy them something or I will stop and even sit down beside them and have a yak and they are always grateful for that. And I think, for me, that was an eye-opener that they're no different to me in reality. And this is not a one-way street. There's a lot. You've seen the rapport that's here between the volunteers and the friends. And so... Yeah, it gives me a sense of purpose as well, I guess. So cool. What do you think that the community can learn, I guess, more that helps them to, as you do, interact with people experiencing homelessness better and also, like, what can people do like you do, I guess? Oh, look, there's so many people do so much. The Catholic Care, they're all volunteers. REACH. We have REACH do meals in Newcastle as well. But I think... Yeah, my take from it is that communication and Orange Sky is... That's one of their main attributes as well, that communication with these people. Make them feel like they're somebody. Make them feel like they do have... It's giving them a sense of worth. Would that be the word? Yeah, just clean clothes, a conversation. Got to make everybody feel better for the day, including me. And the other thing, I had to use my head a lot with the journey with Orange Sky as well. We went from one system of rostering and everything onto the Volobi system and there was... So I've had to put the thinking tank on a lot and then stepping up into that SC role. Operating through Asana, I've been out of the workforce for quite some time. Some years. So it was like a bit of a challenge, but good for me. That's so interesting. That's the first time I've heard one of the volunteers talk about the tools and the things that you get to experience as a service. I've had to learn, yeah. That's a good advice, girl. What is it that you would say to someone if they were thinking about volunteering, but kind of on the edge? Do it. Just do it. Just come join us. So cool. Cool. I reckon that's it. I was going to take a quick photo. Yep. I have some to give to you too.",
  "themes": [],
  "themeIds": [
    "recx3MCsBXSfJE2Kf",
    "recuEyBWkcxvir4TD",
    "rec9eo59A4XNTAGd0",
    "rec3v4RI23iAcmTEp",
    "recIan3iXMFFkfxL3"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}