{
  "id": "recP5tKO1gxuJ8Sf7",
  "name": "Karl Whitney",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "The transcript is an interview with Carl, a man who recently moved back to the area due to a shoulder injury. He discusses his recovery, job prospects, and how Orange Sky, a mobile laundry service, has helped him with hygiene and provided a sense of routine and community. Carl is positive about his future, focusing on getting back to work and taking advantage of new opportunities.",
  "quotes": [
    "rec4brbYyd0Vl8Zc5",
    "recYFaSBoMs2vJgwj",
    "recnE4T80HRdjhE9K",
    "recjmTqqAOEq99ygu",
    "recPLCEllK2Mum7v7"
  ],
  "transcript": "A glare, right? I reckon we're pretty good. Yep. Alright, brothers, you're just going to look at me over here. I'll try and make sure I can do both of these things good. Carl, so just tell me your name and spell it would be awesome, your full name. It's Carl, Carl with a K, K-A-R-L, Whitney, W-H-I-T-N-E-Y. Awesome. Tell us a little bit about yourself, Carl. How do you like to describe who you are and a bit about yourself? Look, I'm 50 and I've just recently moved here. I've got a shoulder reconstruction and I've sort of come from down south. I was working down there, that's where I had the work accident. I used to live here before and I got good rapport with the landlord and that's why I'm straight back into the same place I was at before. And that's pretty much it at the moment. I do physio, get the shoulder sorted out. I've got a full shoulder reconstruction. And that's just the main thing I'm getting over at the moment, trying to get back into the workforce. It'll happen but it's just like probably another four more months of healing, physio. So this is part of the walk. I walk every morning and do the washing at the same time. I could probably only nearly need to do the washing once a week but the yarn and the chat and the stop off point and sort of like in a like 2K walk every morning. So this place is pretty good for that. I probably do that every day. I probably don't really need help but it is really helpful at the same time as well. In the bigger picture, the recovery picture, that's pretty much where I'm at at the moment. But I'm doing really good actually. Things are going really well. That's cool. And what's your kind of, was there a few ups and downs in life and like? Just mainly this injury. This injury and not being able to work and they wrote me off for work and put me on the pension card. And it was like two months before I could get the surgery and it's just like lots of pain and just full mobilisation of the shoulder. I couldn't do anything that I used to do. I wasn't allowed to drive anymore. All sorts of stuff was just like it was, I had to drive up here which was really hard. I had to do lots of hard things in the quiet. It wasn't really supposed to do just to, because I couldn't live down there anymore. It was too expensive where I was and without work it just couldn't happen. It's more capable living in the circumstances I'm at now. So it's mainly just getting over this is the main big thing. Otherwise I'd probably still be working where I was. Before, as soon as I had the accident they laid me off. So that was pretty much just the shoulder. And what sort of things changed? Do you think after the accident, like how did life sort of shift a bit for you? Oh, it might have been like negative in a sort of a sort of it might have been negative, but at the same time it probably wasn't working down there anyway. And I was at a job picking apples. It was too hard. It wasn't really going anywhere. Wasn't that beneficial here now that this has happened. I'll get more. I'm going to get more help through the pension to get put back into work. So I'm probably going to get more assistance with a proper long sustaining job that I would have before. So just like all those opportunities that I never had before, especially the pension card, cheap, and all these kind of things, I was just doing it so hard. Now, probably I'm getting more time to rest a lot more and think about a better future and more opportunities through funding for job network agencies. I'm going to take advantage of more doorways. My. I've been open after the pain's done and everything's finished. There might be more opportunities. So the cups full, I like half full. And before when I was earning extra money, I seem to have more now than I had then. There are more bills. There's more everything. All these things that like I'm I'm noticing and I'm going to take full advantage of it. This place helps a lot too. So every every little thing is going to add up to better than it was before because I've got the opportunities. Before I had to do everything myself. And you get stuck. And one job that's going nowhere, but you can't leave it because you need the money. And you're stuck into a Groundhog Day with someone that's not really working at all. And a job that's not really good for you. That's going to all change now. So even though things are going to be like on a budget at the moment, there's lots of silver linings, lots of opportunities coming. There really is. I'll be taking advantage of it. And tell us a bit. How did you find out about Orange Sky? And how do you. I used to live here last time at the road at Oxi Lodge. And I just used to walk past and just. See them. And there's the washing machines that they're always breaking down. It's one minute they're working, next minute they're not. So it's just like, oh, they do washing down the road. So I just come through that word of mouth and just seeing the washing machines. You can just see the people here. Like I said, it's on my morning walk as well. So I can't help not see it. And what's how do you feel about coming and what's it what's it feel like here? Yeah, that's it's one of the like it's an everyday thing. I'm taking a walk every day even though it's only here Monday, Wednesday and Friday. But this is definitely a stop. It wasn't about the breakfast, but like that's that's really good. And it worked into the budget. It's really good. You really notice it at the end of the fortnight. And like I said, it's just good to have a chat sometimes. So to get to know the people here now, it's pretty good. It's like a good it's I've got a routine and routine saves you at the end of the day. And this is a real good one for me, even though I'm not really destitute. But like I'm on a tight budget, though, and it really does help. What's it what do you feel like the impact is of Iron Sky for all the people that come? Like how do you how do you think that changes? I see a lot of people that come here that really need the food and the washing machines, but they really need they really need both, I think, because they wouldn't come here with the washing. They wouldn't be a lot of them wouldn't be like as clean and as hygienic as they would be if they didn't need to have something to eat. It just also helps them come here and they just say, oh, well, I might as well bring the clothes as well. And that does it. I think it does. It does a big thing for hygiene, for lots of things, for health, because they push since COVID they've been pushing the hygiene thing and people do do that. I do see them using the sand sanitizers and taking them as well. I think the cleanliness thing, because like if they're hungry, it's not too much just to bring the washing as well. I might as well bring the washing too, whereas if they wouldn't have been washing the clothes, I'm telling you right now. And what about the connection and the conversation and like all the stuff that provides people? That's the other thing that does it too. I think that's why, like I said, it keeps going back to the functionality of the person because they have a yarn and they have a chat and that's why they don't mind staying here with the washing because then they have another coffee and it's just like it's a breakfast table and it keeps them here. So that no one minds waiting for the clothes to wash. And I think it's a big plus, the hygiene factor and the routine is a big plus, I think. So awesome. And what's next for you? What's for you the next part of life or? Just get back into the business. Just get back into the workforce. I've got like irons in the fire with the job agency I still go to even though I'm not signed off for work at the moment. But Borthwick's Meatworks are behind people that are recovering from injuries and stuff like that. So the meat works, there's a few like irons in the fire where I'm signed off and able to work that I'll get the funding that I need for my job agency through being hurt basically. Like I said about the opportunities and then I'll be working soon. I'm picking it up. I'll be working within the next, I don't know, a year or two. I think I'll be working in the next, by Christmas. Yeah, it's probably another four months in the shoulder fully before I'm really better. But apart from that, I think I'll be working soon. Awesome. All right, we're just going to do a few pickies now, that's all right?",
  "themes": [],
  "themeIds": [
    "recXQMSSfvulXTqZz",
    "recn0DE5Qxq0prUaY",
    "recZm6tQ7OeOLY5Ez",
    "rec8oUcUavogoRgtb",
    "rectFgD8DLKN6hOV6"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}