{
  "id": "recpxgknHVMYpOTuM",
  "name": "Allan Mott",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Adelaide",
  "videoDraftLink": "https://share.descript.com/view/hmTomrgswvx",
  "summary": "The transcript is about Allan Mott, a semi-retired individual who worked in the pump industry for 43 years but had to leave his job due to the impact of Covid. He found purpose in part-time work as a driver for Covid test stations and later transitioned to working for SA Pathology in country runs.",
  "quotes": [
    "recM1bKfbASEM1jQk",
    "recCuzWfpT3HCSnHm",
    "recB0DeHB9pAhJOGR"
  ],
  "transcript": "# Allan Mott\n\n[00:00:00] \n\nCool. So you just look at me, don't worry about this thing. Yeah. Um, yeah, can do that. Um, make sure that I'm not confused why it's on. Alright. Rather just tell me your full name and spell it. It's Alan Mott. It's A-L-A-N-M-O-T-T. Tell us a little bit about Alan, Mike, first of all, who's Alan? Alan Mike, probably semi-retired about the Covid days.\n\nUm, I worked for a, a pump company doing, uh, irrigation stuff, sewage pump sets, multi-story building, fire protection system. Did that for 43 years and then when Covid came, things dropped a little bit, so I, um, I was asked to leave with a few other people about the covid time. Um, I'm old enough not to have to work.\n\nUm, and I didn't work for about three months and I'm, [00:01:00] I'm not a, um, I'm not a traveler. I'm not a mechanic. I'm not a shed person. I'm not a gardener. So I found those three months that I didn't work were really tough, um, mental health wise and, um, SA pathology at that time, COVID was at its peak SA pathology were looking for.\n\nPart-time drivers just to run around to all the covid test stations, pick up all the tests, and then take 'em back to the, um, to the, the hospital. So I did that for Covid for probably 12 months. And then after that they asked me did I wanna move across to the pathology side. Um, so I now work for SA Pathology doing the country runs.\n\nI do places like Strath, El Murray Bridge, um, the, the Brossa Valley runs, and I do that 25 hours a week or something along those, the lines. Wow. And, um, it keeps me busy. Yeah. So that's cool. Yeah. Um, how did you hear about initiative? That's a really good question. I'm not even too sure. I, I quite often try [00:02:00] and go back and, and see how that all happened.\n\nI'm going to think it happened on Seek. I reckon that the time that I didn't have a job. Um, I looked on seek for some part-time work just to fill me in and I reckon that may be the volunteering tab on Seek, I think is where it actually came to me. So I think I've, I looked on seek, but I'm not a hundred percent sure about that one.\n\nSo that's how I think that happened. So, yeah. So what, what stood out for, uh, of, about it to, do you remember? Or what do you think stood out for, um, helping people is, is, is a real big part of my life. Um, I really like to do that. Um, I'm the sort of person, um, that would help people in the supermarket and, and, um, can we cut some things out later on?\n\nYeah. It's, it's all just whatever. Alright. Because, because I'd like, I've actually at times paid for people's groceries in line and that sort of stuff. You know, when you look at people who, who can't afford groceries and they struggle Yeah. See you later. And that you know that they're struggling, you know that they're working out.\n\nI can keep this, [00:03:00] I can't keep that, that's gotta go back and that sort of stuff. So quite often, I wouldn't say often, but I've done that before. Um, that's something I like to keep to myself. I don't brag about it. There's some guys on YouTube who pay for people's groceries, but then they film them pay thing and I think that's not what it's for.\n\nYou know, they're, they're doing it to get the clicks on YouTube. And I think that defeats, not defeats, it goes against what the purpose of doing that is. So helping people is pretty cool. That's what I like to do. Um, I do this. Obviously orange sky. Um, I look after, I think there's about 13 sites in Adelaide.\n\nUm, I look after six or seven of them. Um, and Mitch looks after the other ones. Um, when I'm not working, like tonight, I'll just pop up and say hello to everyone, see how it's going, um, help look after the van a little bit. But that's Martin's job predominantly. Um, yeah, but I just like, um, like looking Yeah.\n\nHelping people. So yeah, so that's where it all came from. What's, um, the things that keeps coming you back if you wanting to hang around with orange sky? [00:04:00] Um, the people within Orange Sky themselves, I think we've got some good teams here in Adelaide. We don't live in each other's pocket, um, but I know where they are and I can always pop in a site and say hello.\n\nUm, but these guys here are important to me. Um, now I think that's where, um, a lot of this one's slightly different to the rest of the ones I do. I, I spoke to you this morning about the ones I do at Elizabeth, um, which is run by most of the ones we do here in Adelaide, have some food source attached to them.\n\nSo I just, yeah, it's just nice to talk, be able to talk to people. Um, not that I can offer too much advice, you know, it's not my job to do that. I can't counsel anyone. I'm not allowed, well, I guess we don't do that. I don't do that. Um, but we try and put 'em into areas where they, if they need assistance, where they can go to.\n\nThat sort of stuff. Yeah. So just like, um, meeting these guys, you know, creating a real bit of a, a social relationship with them. A a conversation with people. Yeah. So that's cool. Mm. Um, what do you think the impact of Iron Sky is, um, [00:05:00] across the domains of washing and connection and volunteering you yourself, what do you think is the most important or some of the most important parts of it?\n\nI would like to say that the chat is the most important part. But I'm not too sure if that's the case. I, I think, um, as we spoke today, a lot of people just drop their washing and go sit somewhere else and then come back in an hour and take the washing away. Um, that I, I, I, I think having clean clothes is very important.\n\nI. But I think having the chat is, is the more important thing now. A lot of people live on their own, don't have people to talk to, just come and talk football, talk about whatever they want to talk about. Um, now we've got that Ask Izzy website that we can, um, help people if they need, need assistance and that sort of stuff.\n\nBut it's just a, the, the chat I think is just as important as the clean clothes. Yeah. Yeah. Um, what's your general take on Adelaide in general in terms of struggle or homelessness or whatever? I don't think Adelaide has been hit as hard [00:06:00] as, um, the bigger eastern seaboard states have, and I think that's reflective in the number of vans that we have.\n\nUm, we have one van and that does all of metropolitan area. Um, prior to me starting, I think we had two. And we did a couple of southern areas further down, you know, maybe half an hour outside of the city down south. But I understand a couple of those had no one come to do their washing. So either there's either they weren't, um, advertised enough.\n\nEither it wasn't advertised enough or they just aren't. That sort of people down there. I'm not too sure. So yeah, so, but I don't, A lot of the guys that come to us aren't homeless. Uh, most of the people that have come at Elizabeth. Um, would be, I reckon 90% of them have somewhere to stay. The, the number of people that are homeless that use our facility is fairly small, I think.\n\nI don't think there's too many people here tonight that live on the street. I'm not too sure. I, I don't know. What do you think about this, um, idea of partnering with other service?[00:07:00] \n\nI, I think it's a need. Um. It's the one out at Elizabeth works with Vinnie's. Vinnie's has got a Fred's van where they do a three course meal, very similar to this. Um, there's a food hub where they can come and get food to take away. Yeah. Um, there's a couple of churches that arrive with their vans on a Sunday morning and they've done the, the runaround to the supermarkets and got excess vegetables, excess fruit bread, and they bring that along and we help distribute it.\n\nThat as well. Yeah. So I think, um, I think it's not just the washing, but I think, um, people will come where the food is rather than the washing is. And I think the food attracts us, attracts the people to where we are. I don't dunno too many sites that we actually do, uh, maybe Whitmore Square, where you were, you would've gone Whitmore Square today.\n\nYeah. Um, I think that's probably the only one that there's not a food hub or something aligned with it and that attracts, you know, brings the people in. I think so. Yeah. Um, yeah, you touched on it a little bit, but, um, what do you think the impact is on just people that are, [00:08:00] um, sort of. Um, getting the end of their, um, careers and thinking about other things to do and having to volunteer.\n\nLike what do you think the impact is on some of those people who Yeah. Find this, and I, I look at some of the photos in the, the, the website, not the website, but the magazine, the FFI magazine we put out. And I tend to think Adelaide's probably got a higher, a, a, an older group of volunteers than a lot of the other ones.\n\nUm, probably 'cause I guess there's a bit more transient population in the Eastern states, so people doing university studies and need to, uh, to keep themselves busy, I guess. But just looking at those photos in fro, I think that we probably have a, an older volunteering group, even though there's some young guys here tonight.\n\nSo, yeah. What do you think, what do you think people. Um, find themselves at something like, or inspire as a volunteer, their career just to help people. I think that's what it is. People like myself who have worked all their life. Um, get to a point [00:09:00] now where you're not working and um, what do you do? You know, if, if you, you can only trim your roses so often, you know, and you can only caravan for so often and, you know.\n\nYeah. So that's, that's why I think happens is the volunteering side. And we all come from the age where people helped each other come through. You know, like if your neighbor needed a cup of sugar, you gave 'em a cup of sugar. Yeah. You know, these sort of days. I'm not too sure if that exists, but it does for, for us older guys.\n\nYeah. And do you think there's much sort of effect. Who volunteers who may be struggling themselves, do they find some type of support or service or way in which that helps them as a person in the volunteers? Right. I'm not too sure of too many people that volunteer that, that are in that needy spot. I'm not too sure.\n\nYeah. Yeah. I don't, yeah. Don't have a great answer to that one, so that's good. Yeah. Um, anything that we didn't touch on you thought you think is important in terms of our style? Uh, I think just the whole, whole concept I think is good. Um, Adelaide would like to spread ourselves out a little bit further.\n\n[00:10:00] Um, but also understand we don't have a, a great, um, there's an end to the list of volunteers that we actually have there have come up. Some of our sites struggle for volunteers occasionally. Um, I know that we're trying to look at two new sites that we're about to start. Um, both of those, I think. Won't need the van.\n\nThe van Splash is the only van that we have, which causes a bit of a hiccup. Um, it's on the other side of town. Uh, when I do the Sunday morning shift, the shift itself is three hours, but the shift, by the time you drive to the base, get the van, go to shift, take the van back, it's the seven hour day. Yeah, it's a really long day.\n\nSo we have discussed about, you know, moving the van somewhere more north, but then that disadvantages the people that are on this side of town or that side of town. So there's no real. A place where you can put it, that's gonna make it easy for everyone to get to. But no one complains about it. We just, it just works.\n\nSo, and we don't have, um, we don't have the pods. We don't have the turnover for pods. Um, we've spoken about that a couple of times, [00:11:00] putting them out north. But the, the places where we'd put the pods, I think we'd be looking at probably 10 or 15 washers a week. And I don't think that justifies a. Uh, 20,000, $30,000, whatever it takes to put the pot out there.\n\nAnd I don't think it increased the number of washers by putting the pod there anyways. It'd still be the same 'cause uh, they, people come on the Wednesdays and Sundays when there's food. They're not likely to come on a Tuesday or a Monday to do their own wash. And my understanding of the PO is someone from Orange Sky has to be there to protect it, uh, to, to look after the asset.\n\nAnd I'm not too sure if that we'd find that sort of depth here in Adelaide either. So, yeah, so cool. Such good feedback. Um.\n",
  "themes": [],
  "themeIds": [
    "recLy2vC2Yxr7NVdH",
    "rec6YcMsNYvPcRH62",
    "recyvtYeUAiVLm8kG",
    "recs1y3aiL9T5887q"
  ],
  "shifts": [
    "recD94IKMO1jm0cfS"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}