{
  "id": "recPYrGjNmafHUEJ2",
  "name": "Marcus Barlow",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Canberra",
  "videoDraftLink": "https://share.descript.com/view/3VVyZ6LqiqM",
  "summary": "Marcus Barlow is a former security guard who now lives in a motel-like room near town. He appreciates a laundry service available at St. John's and enjoys reading in his quiet space.",
  "quotes": [
    "recBeXXmhCjYvbr6X",
    "rec18O3yPzeAqaJFR",
    "recz6cRVyA17p9sCd",
    "recYC0LKg95E9k9Kx",
    "recHFZAT5qRphHdhU"
  ],
  "transcript": "Marcus Barlow\nMarcus: [00:00:00] My full name is Marcus, M-A-R-C-U-S Barlow, B-A-R-L-O-W. And Oliver Ryan. Yeah. Cool.\nJust as Marcus unemployed. Normally I don't tell people immediately where I live or what I do. If they ask, I'd say I was, I used to be a security guard. Nothing special. Just patrols, night patrols and things like that. And it was a good paying job. But it gets pretty boring after a while.\nI've got a pretty good room. To be honest, it's like a motel room almost. Not like a, it's not huge, but I've got everything that I need. I've got a TV and and bathroom facilities, so that's not a problem.\nI'm quiet, I like reading a lot, so that suits me just perfectly. And we live right next to town, so that's perfect.\nThey don't cost any money. They're locked overnight for security reasons. And you can just take your clothes and wash them. The problem only [00:01:00] is that the tendency was that if you left your clothes here, for a period of time and didn't wait or you hung your clothes on a line, then they'd just disappear no matter what the quality of your clothing was.\nWhen I first heard that there was a service and it wasn't actually first here, it was at St. John's, which is just down the road. And I could take my clothes and they'd be washed for me. I just thought that was fantastic. But having said that, I'd always heard I'd originally heard of Orange Sky on the TV when they were just beginning in Queensland, I think.\nAnd when they had, they were talking about these vans and they were for the homeless, and they had, it was like a I've always got my ear open for homeless services because it's, that's an important thing to me. My background is Christian, I'm very aware of the homelessness issue and I always tend to notice homeless stories on the tv.\nOr about the homeless or homeless services. So I'd heard about this service. They bring the van and they've [00:02:00] got showers and they've got, washing facilities. They'll do your washing, they'll return it to you, and then, and you're free to go. And you can go.\nSorry, I'm free to go. And also, of course, the first thing I found out was that. You could just leave it there and come back and I did that the first couple of times, but then I got talking to the people because I didn't know what kind of people they were. But as I got talking to them, I realized they weren't they weren't just average people, which is okay.\nPeople can be friendly without necessarily being great conversationalists or very social. But I. The the thing was that the people were very friendly and they seemed across the board quite intelligent. They had good interpersonal skills. They had a level of sincerity about them.\nThat was quite engaging. Engaging. And and that was what kind of, it drew me in. I'm not one to be drawn in. To, to false sales pictures or scams. I'm just too [00:03:00] old for that, but I do I. Yeah, I just liked the people and the more that I came back and talked with them, the more I enjoyed their interaction.\nI realized then it's not necessarily, they don't become your friends and you don't necessarily go on to socialize with them afterwards. But that wasn't the issue. The point was you could sit there and two hours would pass and you wouldn't even notice it because of these really great people.\nIf you like, it's also it's not like a psychologist where you go to a or there's this idea, there's an idea, not the whole, but there's this idea that when you go to a psychologist, the psychologist talks to you directly and deals with your problems directly and interacts you with and helps you directly.\nThat's the focus of the whole thing. And the issue with me is I've got post-traumatic stress disorder. From doing security work, I think I, it, it came on while I was doing security work, but the doctor said it can be caused by anything. And I'm okay. I am on [00:04:00] medication. I'm okay, but again.\nIt people, it would come up in conversation with people. And they would ask me how I felt. And they were really supportive. And one person would say, oh, I understand because I'm experiencing that myself. There was one lady who I think she may have been exert an person, I'm not sure.\nAnd then there's other people who've had members of their staff or members of their family who've dealt with the same thing and they. And they know exactly where you are, and they remember, and so next time you come back, if you're feeling a bit uncomfortable or if you look tired or they're just really supportive, and it's just that genuine look.\nIf you just wanna sit there and talk to us and relax, we'll keep you entertained. We'll bring chocolates, you can drink coffee. And we can just talk about stuff. And the conversation doesn't even necessarily have to be that involved. It can become very useful stuff.\nLike I said the people tend to be [00:05:00] the people who volunteer for Orange Sky. I. Tend to be older, more experienced, and I guess also that they're screened differently. And so the person who's responsible for screening and managing and hiring the volunteers is obviously a very insightful person.\nAnd I can see that too. And it come, definitely shows that's the issue. And that's what I love. Those are all the things I love about it. And when I go home at, afterwards, like I'll go home with my washing. I've got everything. It's all there, it's all ready. And so this afternoon I have to go to the gym.\nI I need to train 'cause I've got high blood pressure. I have to train every do aerobics because of my high blood pressure and my, I have to keep my weight down. And so the fact that I've got t-shirts and shorts available every time I've got my towels available, I've got everything.\nIt's all washed. I don't have to do it myself. And then it's Tuesday and Friday, same routine, orange sky gym. And then I've got my clothes for the gym for the rest of the [00:06:00] week.\nIt's reassuring. Because I come back and people say, Hey Marcus, how you going? Are you okay? What's happening? What are you doing? And I find myself talking about say, oh, I've been reading a lot this week.\nI've been reading more. And then a week later I'll come back and somebody else will say, Hey, if you mean, what did you read this week? What did you watch on tv? And that's important to me because with recovering from the PTSD essentially PTSD is is like a form of shock. And a form of kind of you feel anxiety or even terror for just no reason.\nAnd so what you need to do. And the doctor, even one doctor even told me that some people just never recover from PTSD. So there's a number of things you have to do. Take medication. I need to and not just lie in bed because that's the thing. You get up in the morning and just go, I just don't wanna do anything, but if I do that, then it's that old thing, use it or lose it. And don't let boredom take control of your life. And reading, [00:07:00] getting up, just that thing. Getting up, going to orange sky, getting up, going to the gym, going to lunch, having lunch, going to bed. It's like you have to really make yourself, sometimes you have to force yourself to do it, but it's really important because what's happening effectively is that my mind is becoming more.\nCo more calm and a lot of that has to do with and I've even told them the, I've even, because I've been coming here for years now, I think probably about at least eight years. Which is a lot of visits, and, and the people are just, they're just so kind. And I've even said to them, look, I probably would've managed without you, but you guys have just been so helpful and friendly and kind and reassuring.\nAnd it in a sense, it does give you a goal where oh yeah, today's Tuesday I've got, and you've got, it got something to do. You don't know necessarily who's gonna be on, or you might know because somebody said, oh, I'll see you next Tuesday, or whatever. [00:08:00] But again that's the most critical thing for me personally, is that it keeps, it's keeps the ball rolling, so to speak.\nIt keeps you moving forward. It gives you something to do. Yeah. And that's critical for me. Yeah.\nI just, part of my appreciation of orange sky and what I like about it and why I say I like Orange Sky and what they're doing is because I can, I think to a certain extent, I can see the purpose and I can see that the purpose is not just to wash people's clothes.\nBecause then it would be completely different. But the purpose is to for example, I come from a Christian background and I've read a lot of books about the Catholic church and the church in the old days. When there were no cities and there were no there everything depended on the church.\nThe church was the center of the village. And so if anyone wanted money or they wanted help or they wanted to they would go to the church and everyone from that village would go to church and. [00:09:00] Helping the poor was critical in those times because the, and so the monasteries did that and people did that and people really, it was part of their, the way.\nBut in a situation where people ignore the homeless or ignore the poor, or ignore the sick or the frail or the elderly, and the list goes on and on. We live in a society where first of all, there's a fear that if I become old or frail or poor or elderly I won't survive. I'll just rot on the side of the street and I'll die.\nBut in a society where people are actively, proactively going out, looking for you. Giving you pamphlets, giving you church pamphlets, telling you, oh, do you know about the blue door? Do you know about Own Village? Do you know about First Point the homeless services? Do you not, and do you know about orange sky?\nAnd then once you get to Orange Sky, then they really start helping you. That there are so many opportunities because [00:10:00] people know people and they have connections and I've literally seen members of Rowan Sky help saying to people, oh, I know it. I know a guy. I can help you do that.\nAnd then, Hey, I heard you're moving to new apartment. I'll go with you. Would you like me to go with you? And it's, it is nothing. It's really, it's really a there's nothing inappropriate about it. You can, you can trust these people and they're accountable. But also what it means is that if there's more than one orange sky, and that's happening all over Australia people start to get to, to get the idea that charity is important and that helping people is important.\nAnd I think my grandfather my grandfather was Catholic and my grandmother, they were both like that. They, you've gotta, if you wanna do something, you've gotta do it yourself. And you've gotta, you, you can't just, you can't just ignore people. You have to help people.\nIf someone's struggling, you help them. If you see someone by the side of the road, you don't necessarily have to give them money. But you can say, [00:11:00] Hey, do you know that, there's four places where you can get meals this week. Here's a pamphlet. And at least it'll make them feel as if they're not at the end of the line. And when I say the end of the line, it's beyond that point where they're attention seeking and it goes to the point where they just start perhaps, I don't know. They get, they just, they perhaps get suicidal, which is just horrific. But you don't want people to do that.\nYou don't want to live in a society where people will just let people. Die because just because they're out of luck this week. So that's, yeah, that's that's where I, that's where orange sky, that's what orange sky means to me. It's, yeah. It's been really good. Yeah, mate, it's so amazing.",
  "themes": [],
  "themeIds": [
    "reckCOVaASM54CKCA",
    "rec5HlPwTaioS0Cr8",
    "recKtMW7bZsP8JLl4",
    "recBdjKTWtyzgG1Bo"
  ],
  "shifts": [
    "recywajtNjhcR4yPO"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}