{
  "id": "recqCfzyHTI1l3AbV",
  "name": "Ashleigh Choice",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "The transcript features a conversation with Ashley Choice, where she discusses her role as a data analyst at Horizon Network, her involvement with Orange Sky, and her plans for the future. She talks about her experiences volunteering, the impact on her family, and her aspirations to increase community engagement. Ashley shares her insights on the growth potential for Orange Sky in Mackay and her desire to expand services to the Northern Beaches area.",
  "quotes": [
    "recHvaFVWI1EKzTdw",
    "recRpZqnRfgQtmbar",
    "recpad8a910Ai1l4Z",
    "recPJwDS6rDpLCC87"
  ],
  "transcript": "For breakfast? Oh, eggs on toast? So boring. Yeah, that's good. Eggs on toast is cool. Okay. And... Wait. And I think the sun's not going to hurt me this time. Okay, I'm going to record. Start recording. When I record, that's another booboo. Do I look at you like there? So yeah, you can just straight my eyes. So what I've done is just created my eye line, which is... Oh, okay. Yeah. Cool. So just start with your name and if you can spell it for me, that's great. Yep. It's Ashley Choice. A-S-H-L-E-I-G-H-C-H-O-I-C-E. Good choice. Amazing. Tell me a little story about you in how many words you want. Oh, about me. I am a data analyst. I... It's hard talking about yourself, I think. I like to... I play inline hockey locally in Mackay, which is a lot of fun. It's a cool community. It's very casual. I volunteer here, which I really love. I like to do a lot kind of out in the community and be part of people in Mackay and what's going on. So I get a lot of life from that and from people. But I'm also probably a little bit of a hermit because I'm studying at the moment as well. And I have two kids. And raising. Sorry, I look at you. Yeah, look at me. Casual. Casual. Casual. Yeah. So I'm fairly busy just between kids and work and study and hockey and yeah. Wow. Fantastic. Fantastic. Tell us a bit about your role at the Horizon. I work in Horizon Network in their asset performance team. So we look after all of the assets that you could think of that keeps the train running through the network in central Queensland. And I look after the condition and what does condition look like for those assets so we can better maintain them. So I work in a data science area of that. Cool. What's Horizon do in your words? For me, what does Horizon do? Particularly in network, we look after this system that enables trains to move from mine to port. And also we look after bulk and parts of the network that are not. Parts of the network that have transportation trains as well. So we are a big employer in the regional communities and it really a big pusher for keeping jobs in regions. We do have a Brisbane office, but our biggest footprint is all the way from Gladstone in the south up to Bowen in the north and in Townsville for bulk as well. So I think that they're all about, they are a coal business. But it's really a much bigger plan around keeping regional jobs in the community, supporting community groups. Cool. On those values, how do you think that aligns with what I was trying to achieve? Horizon is really focused on how our vision is around, I guess, people and how we engage in that. And I think that's how we perform. It's not really about KPIs and performance. It's about integrity and how do we maintain that integrity and how do we engage not just within our organisation but the groups around. We deal a lot with a vast array of different people in the community and it's about how do we... I hate interviews. Sorry. No, just take your time. It doesn't need to be perfect. It's just about how we engage. I think that's really important. I think that's really important. I think that's really important. I think that's really important. I think that's really important. It doesn't need to be perfect either, by the way. Yeah. I think that particularly is why I like working for Network because I think it's less focused on the coal side of things and my value is more aligned with that. They're much more people focused, I think. Probably take that out because coal is going to get... Coal will get very mad about that. That's a good... Yeah. Say that every time. Yeah, yeah. Take that bit out. Okay, good. Yeah. That's cool. What's it feel like for you to come down to Orange Sky? I really love it. I've gotten a lot out of being here. My favourite part about being and coming down to Orange Sky is the conversations. I enjoy just the breadth and different types of people that you get to talk to, not just the volunteers but the people who attend the service as well. I've made a lot of connections with different people that I really love and enjoy. And I find it's been really great. And I try and encourage a lot of people from my work to sign up and join as well and really want people to be a part of it because I think it has changed how I then talk to people even at work, even with family and friends because it can be challenging. Conversations can be challenging and there's a lot of growth in that. And I think there's an incredible, beautiful thing when you can talk to people and have challenging conversations and hear challenging things sometimes. And really reflect on that. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. And reflect personally on that. And just I think it changes who you are. And you can grow with people with that long-term connection as well. That's a job. And, like, fundraising is hard. Fundraising is hard. And you did a really great job. Why did you first feel compelled to do it? And how did you go about it? The Sudsy Challenge was really the start of my journey into Orange Sky. Um, Horizon is a funder, a key funder of Orange Sky. And, um, I think it was the start of my journey into Orange Sky. that was being promoted within our organisation and I knew, I know Paul Gordon, I knew he was volunteering down here, so I thought why not start there and see what that's like and kind of be involved in the group. I managed to convince my entire team to be part of it, which was a lot of fun and I think it was just getting a bit creative around how we entice people to be part of that challenge and if they, not just if they want to partake as a team in our team group, then how can I get them involved in part of what is Orange Sky and there's nothing like a cupcake that sells that to people. Food is always good, so I used a bit of that to convince people to get involved and yeah. That's cool. Was there a particular part of it that created challenging conversations around it and is there, do you need to change your, your approach to it? Yeah. Yeah. Yeah. I think it created a lot of curiosity with people, particularly in the same office that I was working with and quite shocked that, oh, you really, you're really wearing like really like a lot of, and very, I, what I didn't expect out of the challenge was the quite personal conversation people would have around, you're really wearing this, like everything the same, are you? Um, and I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I, I was a bit, oh, this is a lot to talk about with people. This is a lot actually. And they had to reframe that and think, actually there are people who, this is a very real thing and part of their life and why shy away from that conversation with people that you, particularly people you're working with, it's probably a safer conversation to have. And for others though, who just kind of go, oh, yeah, okay. Another thing I think then it's just about, well, it's a great, it was more about them than what is Orange Sky and what do we do? And it's more than just washing clothes. We're not here just to wash and provide washing services for people. We're here for connection and conversation and it's rephrasing that as part of it. Awesome. Um, do your kids get involved and do you talk to them about Orange Sky? I talk to them about it all the time. Um, they're too young. Can we, sorry, can we, yeah, like, um, like if I said, what, what do you have for breakfast? What breakfast I have? Yeah. So if I do, yeah, do you employ the kids? Can you say like, um, yeah, with the kids or something? Or is it, is that my example? No, sorry. So just repeat the question. So if like, if I say, what do you have for breakfast? You would say full breakfast, right? Oh, okay. Yeah. I see what you're saying. The rest of it was fine. I could pick it up on that. Yeah. No, that's okay. Um, so the kids, they're too young to come down here and I, my daughter will be in grade 10 at Mercy soon and so she'll be able to come down and do volunteering with Brekkie Club, which I'm looking forward to. Um. But it's been really good. They see me in the morning every second Friday, don my orange sky shirt and it's been a really good conversation with them about what it looks like for families and that there are kids their age here sometimes. And um, there's a little guy who comes along who is deep into Pokemon and designs his own Pokemon and I have, I really love talking to him. He is just so in and he's so creative and incredible and taking that and back and talking to my son. And he's also so into Pokemon as well and saying, you'll never believe this kid who comes. He has the most incredible drawings and being able to share that more relatable level of conversation with the kids so they can say, oh, this is something that, you know, it isn't, it affects so many different people and being able to model that for them. And yeah, I think taking those stories back. That's cool. That's awesome. Um, what's your plans for the future with Orange Sky? Like is there things you'd like to do with Orange Sky? Are you sticking around? What's the plan? My plan with Orange Sky is definitely sticking around. I've loved it. I've been here since August, I think August, September last year. Um, and I'm now the community engagement coordinator so that I started that at the start of this year and I just released my first newsletter. I was very pumped about a bit nervous. Um, I was kind of nervous about doing that one, but, and I do the social media posts as well. When I kind of get on there. But, um, I think for my plans and what I want to do with Orange Sky is I'd like to be able to, once the kids get a bit older, build my capacity to volunteer more shifts. I only do Friday and maybe every second Friday and I wouldn't mind being able to do shifts. I travel a lot for work. I traveled to Rocky and we just opened a service in Rocky, which I'm super pumped about. Um, so maybe when I start traveling and I go down to Brisbane is to try and link up with a few other services and volunteer at those locations. Yeah. And just to build a bit more connection in the community at different places around Australia. So. That's so cool. Yeah. Um, are you, um, what's your like, um, what's your feeling around what, um, Orange Sky can sort of achieve in Mackay, I guess. Do you think there's still growth to happen and what do you think can happen in the community? I think there's a lot more growth to happen, particularly in the Serena community. I think there's a lot more that can do. I'm not as involved in Serena as Mackay just because of location and being up here. There's definitely a lot of growth and I think we have an incredible, um, connection with a lot of other community organizations here in Mackay to build that network. Um, I'd love to see maybe another location in the Northern Beaches area if there was a possibility to support that. Because, um, being in the center of Mackay is quite a spread out. Yeah. Town. Um, we're a great centralized location for a lot of people. It's very visible here, um, in the city, but it would be amazing to see if there was something where it could be supported on the North side as well for people who might not be able to make it all the way in. Um, I think there's a lot that we can do in terms of conversation with other organizations for how we can promote what they're doing as well in terms of support for services and attending a lot of community events. And that's probably something that I'd like to be in trying, um, growing and being more involved in as well as more of that community group or community awareness kind of forums. There's, um, some in Serena and some in Mackay that I'm going to start coming along to and just learning and connecting with other groups and people and just seeing who else is out there and letting that be part of the conversation back here with our, because sometimes we might be a bit more connected directly with people than some other areas are. Yeah. So cool. Was there anything else that you wanted to say that we didn't get to? Um, not anything but everything. Sorry for the ride.",
  "themes": [],
  "themeIds": [
    "recXQxt3TMq75m4y5",
    "recW74guhjtdtaTeS",
    "recfz1twhUKLq8KKE",
    "recmbn6CjfbrJXrqe",
    "reccyu8KWmJO0yNu4"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}