{
  "id": "recQXgF2U3ayFnEm8",
  "name": "Nichole Ann Dobson",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "Nicole Dobson shares her experience of sudden homelessness due to a house sale in Swansea Heads, highlighting the challenges of finding affordable housing and the struggles of families in the community. She praises the Orange Sky service for providing free laundry and valuable human connection without judgment. The volunteer-led nature of the service is seen as keeping it genuine and people-focused, as opposed to commercialized models. Nicole emphasizes the priceless impact of kindness and warmth on individuals' well-being and self-worth.",
  "quotes": [
    "recj2Vu0hHoOzZUa0",
    "recw7iUwP3rYX2K59",
    "recYruRJ0nw5vU8j8",
    "rec5Thdn64jIM4lZ5",
    "recuZUE5w70tgNup2",
    "recAgqFyTvg37C5rx"
  ],
  "transcript": "Sounds like you've been doing this for a while though. Oh, I've been hanging around for a long time, yeah. I was the brand manager on Sky about five years ago, I think. Okay. And has your mum been doing it? Was that your connection with it? Oh, no, so I did it first and then I got mum to do it. Yeah, okay. All right, nice. I convinced her. Cole, I think we're pretty rockin' now. So if you just say your full name and spell it so I remember. Okay, so my full name is Nicole Ann Dobson, N-I-C-O-L-E-A-N-N, Dobson, D-O-B-S-O-N. Amazing. Tell us a little bit about yourself. So I've lived in this area for five years now, yeah, five years. Okay. And I moved down from northern New South Wales. I lived in a little place called Brunswick Heads, which is about 20 minutes north of Byron Bay. I know Brunswick very well, yeah. Yeah. I'm from Upper Izzy. Yeah. So I moved up there when I was about 17, grew up in Sydney, had four kids up there and so I've pretty much lived there for my whole life. Wow. What's life like now for you? It's great, great. I've just recently though had to move. I was living in a lovely sort of duplex kind of house in Swansea Heads with great views and it was just like an absolute wonderful find of a house and that sold suddenly with the buyer stipulating vacancy. So I got 30 days notice and it pretty much took me all that time just to pack up and sell things and all of that. And so I actually don't have a home at the moment. I'm still looking. I'm staying with friends. I'm very fortunate to have kind friends and yeah, but rents have gone up. So I couldn't possibly afford to replace where I've been to get what I need. I need to pay at least $100 more than I had been. So it gives you a good indication of how tough it must be for families and so I'm just one person. But people with kids, there's a lot of homeless people in this area. A lot of families living in cars I've discovered since this has happened. Yeah. What's your sense of the community I guess in terms of what you're saying there, like the struggles? Like do you see it often? So no, no. You see the odd person. I sort of work occasionally with my church. I work with my family. My church does a second bite program on Tuesdays and Wednesdays and I sometimes go down on a Wednesday and just sit and talk to people. And so there are, you know, we get the occasional people who come through who are, you know, like in an emergency situation. But most of the people who live in their cars are living there by choice. And that's how they kind of feel they can cope best. But it wasn't until I was in this situation and actually looking on, you know, private rental sites and different groups on Facebook that I realised how many people were desperate for houses and, you know, have been months, some even years. Without getting accepted. So like people like, so for example, there was a family that they'd migrated here. So the wife had specialised nursing skills. So they were brought in. She's working full time. But he can't find work yet. I'm not sure what country they came from. And they've got kids and they're all living in their car. They can't get a house because they haven't got references. They haven't got an Australian rental history. And I don't understand why they're not being sponsored. Because they should, I mean, ordinarily, you know, if a business brings in someone from another country to fulfil a specialised role, they sponsor them. They go to the real estate and say, you know, we'll go guarantor for them if anything goes wrong. Or, you know, they'll pay a bond or something like that. I don't understand why we can't have that system in place for people like, Department of Housing does that sort of thing for people who are struggling. But. I think immigrants aren't entitled to that sort of help. You have to be a resident. How did you first hear about this Orange Sky stuff? So I think I'd just come down to the library and I'd seen you guys and I'd just asked what was happening. And so, yeah, I've only used the service a couple of times, but it's been brilliant because, we have a laundromat apparently, which I only just discovered, but it's changed hands now. But before the guy was never there. So it was pretty much we didn't have one. So, you know, if you, you know, if your machine broke down, you'd have to drive into Cooks Hill and cost you 40 bucks. So. Yeah, tell me more about that. You were just talking about that. What was it? Yeah. So, so a couple of weeks ago, because I'm, you know, now without home, I went in to do my washing in there and I was blown out at how expensive it was. So $10 a load. And that was for the smallest machine. And so I did three loads of washing and, and one load of drying and $10 for the drying. So 40 bucks. And then she wanted to change. Yeah. And then when you weigh up the priorities that some people might have, maybe that sits a bit lower than everything else, right? Yeah. Well, so, so if, I mean, Orange Sky is brilliant because if you don't have your own washing machine or if you're in a situation where you're homeless or living in your car or whatever, this is a free service. So. And I love that there's no questions asked. They don't, there's no discrimination. So if you don't look homeless, you're not, you know, shunned or anything. In fact, you know, they're just beautiful people that welcome you and sit down and have a chat with you. And it's, it's lovely. It's great. And I think people really need that. They need that. They need that kindness and, you know, a smile, a bit of love goes such a long way. So true. I think it's like, yeah, the epitome of the philosophy of what they try to achieve is no judgment, understanding, and just an openness to people's, like, needs and whatever. And I think that the stereotypical person who's homeless is not necessarily, like, the only reason why. It exists. Yeah. Yeah, absolutely. And what's it like, what's it feel like, I guess, like this, this happens across Australia, like hundreds of times a day, a week or whatever. What do you think the impact is more like generally in terms of like, of all the things, from the watching, the conversation, the connection? What do you think the impact is on Australia, like to be able to have a service like this? I don't know that you can measure that. I think you can't measure kindness. I mean, it can have a profound effect on a person's day. To have a small bit of kindness in the morning can mean that someone can have a wonderful day because it, you know, when we smile at one another with genuine warmth and care, it's a wonderful thing. It's a wonderful thing. It's a wonderful thing. It's a wonderful thing. And if we have that kind of warmth and care, then that's something that, you know, it bypasses all our understanding. It tells us that we're worth something, you know, which is, you know, people have negative voices and expectations in their heads and all around them. And so it's priceless. That's awesome. And like, what do you think about the idea that it's priceless? Yeah. I mean, I think it's a great idea that it's run by just volunteers. I guess it's all models where you could pay people to do it and there's different ways to commercialise it. Yeah. What's the value of it being a volunteer-led type experience? I think it just keeps it very down to earth. Then it's very people-oriented. If it's a job, it tends to change everything, doesn't it? It becomes about money and about outcomes and about, you know, reaching yourself. Reaching your CPIs and all of that jazz. It's just when it's volunteers, we're all in it together kind of thing. It's volunteers tend to volunteer because they want to. So even if, you know, if it's a work for the doll situation, they choose where they want to go and the people they want to volunteer with. Yeah. And volunteer organisations, hopefully all of them, I mean, I don't know if all do, but treat them well. Like these guys are all really happy. They're great, you know, which is what you want, isn't it? You know, and yeah, anyway. That's so cool. So wicked. It was amazing. Like your view on everything is awesome. Thanks, Ben. You have a really good understanding of why this is here. So it's cool. Anything else you wanted to say or like anything we didn't talk about that you thought was important? I don't. I think that's fine. Wow. That was great. Thank you so much. I'm just going to take a photo, if that's all right. Mm-hmm. Bye.",
  "themes": [],
  "themeIds": [
    "recAiUilKmo4CDPry",
    "recsNzLJrslZHVLJV",
    "recRsHCvNQL4Yrwa2",
    "recgFoNj2D7RcvMtq",
    "rec0ViW8KttADXWfb"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}