{
  "id": "recQsKUeosDZknjS9",
  "name": "Ana - Bega",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Kalgoorlie",
  "videoDraftLink": null,
  "summary": "Summary: Anna King, the Health Programs Coordinator at Bega, discusses the wide range of services the organization provides to Aboriginal and Torres Strait Islander families in the Goldfields. She highlights the positive impact of the Orange Sky laundry service in providing not just clean clothes but also dignity and connection to the community. Anna envisions the future growth of Bega and Orange Sky, emphasizing the importance of ongoing collaboration and communication. Additionally, she praises the easy and proactive nature of working with Orange Sky and expresses gratitude",
  "quotes": [
    "recY96N1EXzqx4FBT",
    "rec6EzUiLRYGqnAAN",
    "recHCUT4ZmIDinNE9",
    "recPtgOYTVOG0FwHQ",
    "recxeufrTxnFqaUIj",
    "recVH12yHtPl9CGKQ"
  ],
  "transcript": "So, we usually start with your name and you spell it. And that's like the service we're giving you. So, my name's Anna King. It's A-N-A-K-I-N-G. Cool. Tell us a little bit about yourself first, I guess. A little bit about myself. I've been at Bega for about 16 years through different roles. Currently, at the moment, I'm the Health Programs Coordinator. And I have Aboriginal early years through Connected Beginnings. We also have the Community Safety and Wellbeing Program, which is about engagement and AOD. And we also have the Orange Sky with Philip. Cool. Tell us your perception of what Bega is, I guess. Like, what is Bega? Bega, I would say, is an Aboriginal health service that caters to the Aboriginal and Torres Strait Islander families throughout the gold fields. We not only do clinical services, but we also have a wide range of services that tap into social and emotional wellbeing, social support sort of services with homeless, French dwellers. We also have tackling indigenous smoking teams. Lots of engagement through AOD youth programs. And we also have... like our counsellor services. But generally, we've got a wide range of staff. We even have an environmental team who goes out. So we really try and cater to the health and wellbeing of everything. Both social, physical, emotional, detriments of a person. So glad to talk to you. You're good at this. I suppose you've been kind of, you know, like, you've been looking at the social and mental health of your own. I suppose you've been here for a very long time. Yeah. How does your own experience connect with what you do in terms of the community connection and stuff? Yeah, so I have been on lots of different strategy groups, whether it be for early years, it could be for they used to have one for Aboriginal families. I'm very passionate about working in community and being a part of community, but giving of myself to help as many families as we can. I started here in the Crèche as a Crèche coordinator, and I worked there for about ten years. So I've seen so many families come through. I'm passionate about education. But not only that, once I left the Crèche, I've seen these children not only grow from children, but now they're either youth or adults and they're running their own families. So just seeing that whole picture is quite a beautiful thing. But definitely to be part of community here, if we look at the gold fields, one of the greatest things that I think I can see in this community is that there are so many people that give. This community will always be there. Thank you. And I think that's something that we will always continue to give. And there are so many services here that if we were able to collaborate really effectively together, we could do so much. That's so cool. Tell us a bit about how you first heard about Orange Sky, I guess. So we heard about Orange Sky quite a few years ago, and it was just sort of like a thought that somebody had. And then I guess it went through different pipelines, where Clyde was able to do some work to actually get it here. I think community heard about Orange Sky coming, so it sort of had this trickle effect into community where they were excited about it coming. They weren't too sure how it was going to look, and then when they heard that Beagle was taking that on, they got excited to see what it would happen and do for community. That's cool. What did you think of that? What did you think about the concept I heard, I suppose, when you heard about it? When I first saw it, I was like, wow, that is amazing. Three washing machines and three dryers in one truck. But I was like, but how is it going to work? Will it really be utilised? But I saw, so Stuart was the first person who ran the service when it first came here. And he absolutely loved it. And he had this sort of like, this passion for it that made everyone want to find out about it, you know. But what I've actually seen with the service, so he's taken it and he was doing roughly, Church of Christ has probably been our biggest service provider. They also predominantly, 90% of all their clients are probably our clients too. So it works really well down there. They used to do on average about 22 loads down there. They are averaging about 50 odd loads now. So it has increased tenfold, you know. One, it's hard work for Philip. He loves it. He's great. Nothing's too hard for Philip, you know. But what we can see is that community really need it. Yeah. There's been something that was said in community once the orange sky had come to town. And then they also got like a shower bath. They said that everyone, you could see the confidence in people walking around the streets. Whereas before, people didn't, who weren't able to have showers, who weren't able to have clean clothes, they would slump. They wouldn't look up, you know. Whereas now they're out and about in town. They look as happy as they can be, you know. It's almost like giving them a new sense of life. Yeah. That's a beautiful way to put it. We, I get to travel around a lot, see orange sky ships in urban environments and some regional. Yeah. We talk a lot about this word friends. Friends is a word we use for our friends on the street doing it tough. We just did a podcast called The F Word. And I know that friends maybe has a different meaning or there's a different word for it or something in community. But how does that sort of resonate for you in terms of like a concept of like that dignity and connection with people who are using the service? Does that carry through to how it operates here? I think it does. I think I've never thought of it that way. But when you think about friends, you think about love, you think about caring, you think about connection. If you can make a connection with a person, you can make their day, you know. You don't know where they've come from or what sort of night they've had, whether they've even eaten. But to say hello to somebody, to actually ask about their day, to generally find out about them, it's not hard to do. And it doesn't cost much. But it can mean so much to that person. Yeah. Yeah, you've got the Orange Sky ethos pretty much down pat. It's hard sometimes to explain, you know, what the situation is for people, I think, in places like Kalgoorlie. How can you, in your own mind, how do you represent, I suppose, some of the struggles in the day-to-day existence of some people in Kalgoorlie doing it tough? Oh, you know, I actually think that people who are even in jobs at the moment are having it tough. So when I look at everyone in like a tough sort of situation, I just think, probably maybe four years ago, the price of butter was about $2 something. We're now looking at about $6 to $7 for the same butter. So I think toughness could be out there for a lot of people in general. But those who don't have a roof over their head know when their next meal's coming. And I think that's a big part of it. Clothes on their back, or just even a blanket to keep warm at night. I don't think there's many words for, I don't think tough sort of comes into that for them. I don't know what that's like because I've never been in that situation. But I can only imagine that it's, that tough is probably just on the tip of it. It's not really probably a word that resonates. It's not really a word that resonates with them. But we have a lot of people in Kalgoorlie who are struggling and they're out on the streets or they have nowhere to go. It's even families. It's not even just individual people. And so for them when they come in, I guess they're a little bit heightened and they don't know what the future brings for them. And they're just reaching out for people to help them. Yeah. Yeah. Yeah. I, so I went to Church of Christ, Boulder Camp and Ingramire. And the way in which this service operates is different to like urban because essentially they've got some chairs, people sit around in urban and they have a bit of a yoke. But it feels to me like there's a different type of connection that happens. The regularity going to where they are fills like status I think as well. So I think there's two parts. It's like tell us a bit about Phil and why he's an important part of this thing. And then also what do you see as like that idea of connection where it's not only just sitting for ages and yarning and yarning, but the regularity over an extent and the period to know that they're coming back. Yeah. Well, Phillip has, Phillip's quite caring. So he's, and he's quite softly spoken and he's just got this genuine nature about him where he truly cares, you know. And I think people just by his smile, just by him even rocking up all the time and the consistency, the consistency behind it, it helps them. It helps them to be able to keep coming back if they need to use the service. But he'll have conversations with people whilst he's trying, but he's just flat out I think, you know. So it would be really great if we could get somebody else to work alongside him, you know. And I guess that way they would be able to offset somebody could be doing a bit of work and then others could be really having conversations, you know, with people. I even felt different. I don't know, like I suppose I've only been there once, but people at Nigga Maya had a particular way about them and coming to Shift and almost like going back to where they were. People at Boulder were kind of there and they were just like ready to be part of what Orange Sky is. Just like so, so, so keen and Church of Christ was different. Again, because it was way more family environment type thing. How, I suppose there's a whole idea of scale and impact. What do you think Orange Sky's impact is as part of this ecosystem of support in the community? Like how do you see that? I actually see that Orange Sky can be the link that can bring everyone together because I think, I think Philip being able to go to different places, without the Orange Sky and being able to have that facility, maybe we wouldn't engage so much in those places. But every week he consistently turns up, you know. And not only that, our friends or our clients, they still come to use the service as well. So it's definitely one that's needed. But I think, but I think it's something that will bring people together. Yeah, yeah. Even though it could be a necessity for them and a need. I don't know. I think, I think everybody has, like I think at first the numbers were low because I think some people were a bit scared to come and use the service. You know, because I think it would take a lot to, have to come out and bring your, you know, washing and stuff. But then I think after a while what they realise is actually it's okay. You know, this is what the service is for. It's for me. And everyone just comes down. Yeah. And I think they are not ashamed about it. There's a positiveness that comes with it. Yeah. Yeah. It's a beautiful thing when things cut through shame. There's so many services where you want people to come and attend but there's shame associated with it. But yeah, I definitely didn't see shame. I saw like a keenness. Yeah. They're excited. They really are excited. Yeah. Yeah. And when he rocks up, you know, you can just see how happy they are that he's there. That he's definitely there. Yeah. Cool. So, future I guess. What do you see as the future in Kalgoorlie and like Bega and stuff? Like what's next over the next little while you think? Over the next little while I think Bega will continue to grow with different programmes. I think Orange Sky is going to grow. So we not only do Kalgoorlie, we do the Goldfields region. So we'll go Laverton. We'll go to Esperance and everywhere in between. I can actually see that Orange Sky could start branching out within the Goldfields region. I definitely know Laverton, you know, is in need and would love some type of service up there. I don't think that Orange Sky would look like a mobile service for us because he's currently needed in some way. Because he's currently needed in town. But I mean, if they had two trucks, you know, that could be a possibility. But I definitely know wherever Orange Sky would like branch out to or even grow and potentially have two trucks here, it would definitely be used. One thing we've been really interested in, I say we as like I used to work at Orange Sky, but I say we because it's what it is. I think the big push at the moment is to look at Orange Sky as almost like a philosophy and an approach rather than a mobile vehicle. How do you think that might work if there was like a container had some washers and dryers in it, had some chairs? Does that still carry through in your mind that that's still an Orange Sky initiative? That's still like a powerful opportunity to engage in? To engage, I guess. Like just thinking about because Orange Sky's trialed like taking over laundry mats and having like pods and going to motels and stuff. Like just interested in your thoughts of like Orange Sky as a idea rather than a mobile vehicle. Like how do you, how does that sort of sit? Orange Sky as an idea. I think. I'm not sure if I've got this right. No, that's okay. That's okay. If it was still like a service and not as in a truck, but it was, are you meaning like if it was based somewhere permanently? Yeah. And then set up? I definitely think it'll still work. Yeah. I think if people see beyond Orange Sky as being a truck, they can still see that Orange Sky could be, you know, a service. Yeah. Like a laundry service somewhere that could still be yarning and still connection. Like. Yeah. I, even though it is the Orange Truck and at the moment, you know, and people talk about this Orange Sky. However, I think it is more than that. Yeah. I definitely do. And yes, it is the laundry service. But I think more so it's more about connections, you know. And when I think about Orange Sky, my thoughts are. And when I think about Orange Sky myself and how I've been able to deal with them in the past and going into the future, it's a really easy service to deal with. There's no problems. They always are proactive. Communication is really great. And I think that sort of like gets put into community the way that they are with us. It's sort of we put that on to our friends as well in community. So I think regardless of what they do, whether it's a truck, whether it's a building, I don't think things would change so much. I think the Orange Sky, however it is put into community, will flourish. Yeah. And one last one. Jude's not here. She wished you could be here. Any shout outs for Judith? Seriously, Judith and the team, they are amazing. Yeah. They're super easy to work with. We never have a problem. They'll always take care of it. If they need anything, they'll probably generally come to us before we'll go to them. But then they normally go, we'll get little emails saying, there's a pickup, just go and pick it up. Or our dealings with them, simple, easy, and they're pretty fast at returning responses. So, no, we really enjoy working with them. Yeah. So good. She's pretty jealous that she got me. I bet she is. At least you'll get to see it. And yeah, I'm super keen to come back soon. And I think there's a real, there's a real beautiful story here that I'd love to keep talking about. And I see like down at Church of Christ there, there's just a constant slide show of people and, you know, it's just, it's a beautiful story. And I think it's very important to have that. Yeah. And I think that's what I'd love to see, too, is to see people in the community. Yeah. And I think that's what I'd love to see. Yeah. And I think that's what I'd love to see. Yeah. And I think that's what I'd love to see, too, is just a constant slide show of photos of what's happening. Like, if we can continue to celebrate what's happening, like return those photos and show the videos of how this is all coming together, I think that's, in my mind, a great story. Not like, not the fancy one that goes to the sponsors. Yeah. But the one that connects back with the community, hopefully. Yeah, definitely. Cool. Because I think, yeah, connection's everything, I think. Yeah. That was so good. Yeah. You were rad. That slide was really cool.",
  "themes": [],
  "themeIds": [
    "rec0gsVmK258jbHNf",
    "recyfkiLP95KKpb6y",
    "recVrA4bIocX063lQ",
    "recFeS6gVA7xuwCSF",
    "recTT4oTKPT9ZsEf4"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}