{
  "id": "recrpqAal2QTqzL5N",
  "name": "Graham",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Newcastle",
  "videoDraftLink": null,
  "summary": "Graham talks about his experience at Orange Sky, how he benefits from the service not just for washing but for socializing. He discusses the challenges of homelessness in Newcastle and how the community supports each other. Graham also mentions his efforts to help others find work and his positive view of Orange Sky's impact across Australia.",
  "quotes": [
    "recidw7kCeyDogvcu",
    "recQgHkOyBp7zzMAR",
    "recS3t4IwTcqCROBk",
    "recdLTu8uF5w54GMv",
    "rec5vsHPmpWIuo3jB"
  ],
  "transcript": "I'd rather look at me, you can talk. Yeah. Tell us your name and spell it for me. My name's Graham, G-R-A-H-A-M. My father couldn't afford a newie, so yeah. Tell us what you're doing here today. Yeah, well I missed out last week, or last fortnight, but these people, they're good at doing washing, especially when your washing machine don't work for you. I like that, but I come even when it does work. What do you keep coming back for? Because I like the people that work here. I know, it's not a chore. It wasn't a... Yeah. It wasn't a job or a must be. It's more part of my social life. What's your current situation at the moment? Where are you hanging out most of the time? Oh yeah, I've got a place on that. Like I said, I've got a washing machine that don't work. Actually, it doesn't pump the water out, you know, on that. When I missed out a fortnight ago, I put it in the washing machine. I used the bucket to empty the washing machine, which takes ages. To do that, the spin dryer doesn't work properly, so that's why I'm here today. Do you come for the food as well, or the services? Yeah, but not all the time. I come here for the same thing, to associate with people. There's a lot of people worse off than what I'll ever be. What do you think about the general community of homelessness in Newcastle? Is it hard? Is it tough? What is it? For the homeless people, I think it's as tough as anywhere in the world. Like, if you've got nowhere to sleep and not much to eat, doesn't matter where you are, does it? On that, people, especially at church here, they look up. They look up to homeless as best they can. And Seoul does too. I worked for Seoul for about six years. I started to develop the wrong attitude, so I've given them this for a little while. But I'll probably go back to it. And it sounds like you're helping other people out too. What do you do helping other people out? Yeah, well, I help find them work. I put a few people, not many, up now and again. You know, and I used to do a lot of shopping and that, but I had an accident and that slowed me up. So I can't do that for anyone now. But I normally have a whinge to people when I see them on that and try and make them feel good. What's the community like here at Orange Sky? Is there lots of conversation and connection and stuff? How's that going? Yeah, 99% of it's great. They've all got positive attitudes. There's not many that haven't got it, but then again, they soon get it. When they get to know everyone here and get to know what's offered for them and all that, their attitude changes and they're always good to talk to. Not like me, I'm a pain in the backside. But yeah. Why do you think Orange Sky is important across the whole Australia? Because we offer this service everywhere. Why do you think it's good to have it everywhere? Because the simple fact is everywhere there's not people, well, they're doing quite so well. And they might only be down for a little while, but when they're down, these are the type people that help, you know, no matter what they do. Some, like yous do, yous do the washing. Others help feed them and others help clothe them and others help them find work or whatever. Or just someone you to talk to. And there's a lot of that in Newcastle. Like I come from Sydney and I find up here there's a lot of young people that think of others. When I was their age, I only thought of number one. But now I think different. So that's that. Yeah. So good. Thanks so much for talking to us. You're awesome. Okay.",
  "themes": [],
  "themeIds": [
    "rec2Qx5Lg2ONqDse0",
    "reccF4YUvrqSwdIqT",
    "recs7E5qUaXpe78yH",
    "recHzoo8MuPrbE41v",
    "recwDR84VExbXXIX0"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}