{
  "id": "recR29XzCGafxQ5f0",
  "name": "Nicole Snead ",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/NYRjC7YVePR",
  "summary": "Nicole Snead, core officer at the Salvation Army in Hobart alongside her husband, discusses their 18 years in full-time ministry and passion for improving lives. She shares how she was born into the Salvation Army and ultimately followed a calling to continue in ministry despite initial hesitations. Nicole finds fulfillment in the stories of transformation and hope in people's lives, motivating her to stay committed to her work.",
  "quotes": [
    "reckMfTJ8VkjbWtgX",
    "recrCiBkzuuOkRx1g",
    "recS7rvhOzvwUG1Pz",
    "recAznfOCxEHiZl0u",
    "recXxrw1YTQbJGmbR"
  ],
  "transcript": "# Nicole Snead - Salvos\n\n[00:00:00] \n\nFirst and foremost, just your full name and spell it for me. Yep. So Nicole Snead, N-I-C-O-L-E-S-N-E-A-D. Tell me tell me about yourself first a tiny bit. Yeah. As you introduce yourself, identify those types. Yeah. Yeah. So I've am the core officer here at the Salvation Army, together with my husband John Ma.\n\nAnd we've been in full-time ministry for 18 years now and we love Hobart. We love its people. Yeah. And we wanna make lives better. That's so great. How did you first hear about this type of work? And you fall actively search it out. What was that like? So I grew up with the Salvation Army and I quite often say that I was born on a Wednesday and I was at church by Sunday, so it's a bit of a family thing.\n\nYeah. And so I wanted to do anything else but full-time ministry and so I Dion, sorry. [00:01:00] Just yeah, so my husband actually lost his job and so then we had to explore what we were gonna do as a family and what that looked like. And how do you argue with the creator of the world when he three times says, no, this is what I want you to do.\n\nAnd so this is what we're doing all these years later. Wow. What are the things that keep you here and keep you coming back? Yeah. Probably the stories of transformation, the stories of people changing their lives, and we are all about good news and we're all about hope. And so when people come back and they say, oh my gosh, I've got housing, I've gotta share this with you.\n\nThat's the stuff that keeps me going, and transformation looks different for lots of different people. And it could be as simple as a shower or it could be as simple as housing. Recognizing that those things are actually massive, so it's the little things that actually mean a whole lot.\n\nWhat are the range of support and stuff to do here? So we offer a community drop in space. We actually call it our third space. Recognizing that lots of people don't have. [00:02:00] Homes, they don't have work. For lots of different reasons, and family's not a safe place. And so we have a space that is open every day of the week during, sort of Monday to Friday.\n\nSo we do soup and toasting, we do emergency relief. We do wraparound holistic support. So if people, need pastoring or they just need someone to talk to, or they just wanna sit down and watch the news or read the newspaper, then that's the space that we offer. We have seniors, programs, youth programs programs for kids and as well as a worshiping or faith community as well.\n\nYeah. What's the relationship like with Orangeberg? Were you here? It started, yeah, we were. So we had one of our colleagues at the time called Stewart he came and approached us and said, Hey, I think we can do something together. And so we are like, yeah, for sure. And so we've been running our meal on a Sunday night for over eight years now.\n\nAnd so we've been partnering with Orange Guide just as long. And so when people come to this space. And they get not only a hot meal in their [00:03:00] belly, but the opportunity to have a shower and their clothes washed and dried. It's a beautiful partnership. What do you think is the impact that RPO has across the elements of, and.\n\nConversation. Yeah. Connection. What stands out for you? So recognizing that connection is actually hugely important. So it actually creates a community in and of itself. And so when you have that, and so it's a place of being known and belonging and inclusion and sharing life together, that is a beautiful space to be.\n\nAs well as alongside of the opportunity to have clean clothes. You feel human again, you feel known and that's actually really important for individuals, but also for communities as well. What do you think the sort of sentiment around homelessness in over, like in terms of from public perception to experience, is there a divide?\n\nIs it like. Supportive of each other. Where do you [00:04:00] cognize? So definitely within the homelessness community, recognizing that looks different for lots of different people. So it could be sleeping in our car park, it could be sleeping in parks or shop. Doors and windows and things like that, but it also could be short stay and not, secure accommodation as well.\n\nSo we recognize that it looks different for quite a number of different people and they look after themselves. And so it's in a community in and of itself who look after each other well. However, we recognize that can sometimes. Not work out, or sometimes there's personnel issues, relationship breaks down.\n\nSo sometimes that can be a bit tense within the wider sort of society and community here. We have definitely seen a rise in. The visibility of homelessness. So when we first arrived in Hobart 12 years ago, you wouldn't see lots of people on the street per se, recognizing [00:05:00] again that it looks different.\n\nBut that is certainly becoming more visible as the years go by, so you will see more people perhaps begging on the street or busking. To make a living. As well as you'll see blankets and things like that in shop doors and on the street and things like that. So it's certainly becoming much more visible within our little city.\n\nYeah. How do we and everyone partner, don't do it. Don't do it. Partner better to support everyone. So everyone from government to council to business owners. When you see that being a like really positive thing that people are coming together and you know that's possible. Yeah, we do. Yeah. I think the value of hearing each other's story is actually vitally important to this space and to, and for people to understand that most of the time it's not a choice.\n\nMost of the time it's because of circumstances, not of their own creating or it's because [00:06:00] something has happened to them and. Being in a house is just not safe for them, and so actually just recognizing the causes of homelessness from particularly when we think about schools and businesses and, governments, quite often the stigma attached to homelessness is around drugs or alcohol or violence, when that's perhaps not necessarily, accurate.\n\nAnd so hearing stories. Together is actually hugely important. Yes, we could build, a whole lot of houses and things like that, but if we just chuck a whole lot of people in a whole lot of houses, I don't actually think that's healthy for people. So I think that long-term, ongoing. Help and assistance walking alongside people so that they can function as best as they can within society, I think is also a valuable service that we could provide those really most vulnerable within our society.\n\nSo I think it's a both and situation. Oh fuck. [00:07:00] You've got such good answers. Sorry, I've given it some thought. Was there any elements we didn't touch on, you think? Important in this conversation around partnership and probably I think the fact that we are better together and we can do stuff in isolation, which is wonderful, but I actually think we work better for our people when we do things together.\n\nAnd so you know, that we know that we're not alone. The people that we serve and walk alongside know that they're also not alone, which I think is really important. So we, yeah, we wanna do stuff together. 'cause I actually think it betters us as people and betters us as a community, okay. Take a photo before this light.\n",
  "themes": [],
  "themeIds": [
    "recZJX9uR9ALnwWTJ",
    "recwjyeE6LWp5L79t",
    "recSozuFlwrx8ooZ3",
    "recgBRjdOxkvzEn4n"
  ],
  "shifts": [
    "recsVCxQUtq7S86eP"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}