{
  "id": "recR0O1xouJhbaie5",
  "name": "Samual Thornberry",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "The transcript is a conversation with a volunteer named Samuel Thornberry who shares his experience with Orange Sky, a mobile laundry service for the homeless. Samuel talks about how he got involved, the impact of the service, his perceptions of homelessness, the importance of friendship, and his hopes for the future of homelessness support. He also mentions his involvement in a podcast called The F Word. Samuel highlights the importance of dignity, human connection, and early intervention in mental health for the homeless community.",
  "quotes": [
    "reczbBHUYQLBlGY8E",
    "reclBc97dTSUK6Iwp",
    "recgQ4DeEloGeopCw",
    "recsVLDiIRnzGfWf0",
    "rec8U6CBxYwFoUGVP"
  ],
  "transcript": "Good night. I reckon that's as crispy as it's going to get. I think it's going to get much better than that. Sounds good. Alright brother, just your full name and spell it will be awesome. Yep, Samuel Thornberry. S-A-M-U-E-L-T-H-O-R-N-B-U-R-Y. Cool man. How did you first hear about Orange Sky? I think I came across, I was looking at volunteering opportunities and something popped up on my Instagram. And just had a dig in, had a scroll through the service. Yeah, it was something I really wanted to give it a crack. Was there something rad about it, something specific, or was it just the vibe in general? I think it's the vibe. I like the idea of, it's such a simple idea but really powerful. Giving dignity to people. Something like, you wouldn't even think, you think of traditionally someone living on the street, like a friend's food and drink. But like, I don't know, just having clean clothes is something I would never even, I don't know, ever thought of. And I just thought that was, yeah, something really special. So, yeah. What's, for someone who hasn't been to an Orange Sky shift, what's it like? What do you do? Yeah, it's great, great experience. You rock up, have a bit of a chat with the other volunteers. Get set up, you know, put out your chairs and all that, start up your dryers. Usually have a couple of friends come for a chat. Explain the service to them, load up their washing. Yeah, it's just building that connection with the friends, which is always good fun. So. What's, did you have a very special experience with the volunteers? Did you have a particular idea of homelessness before you started? And has it sort of changed since you volunteered? Sorry, the... Has it changed since you volunteered, I guess, your perceptions of homelessness? Yeah, definitely. I think you don't realise how widespread it is. Like, it affects people from sort of all different walks of life. I think especially like more recently, like the cost of living crisis and stuff, you start to see a lot more like young families, older people as well. And that's been like, yeah, a little bit shocking almost to me. Something that I don't know. Yeah, wouldn't expect, so. Cool. Yeah. This is good lighting. . . . . . . . . . . . . . . . . . . . . . . . . . . . Yeah. A lot of people just ask, like, how can you bring out you two volunteering or something like that. And I was really interested in just, when they hear about the whole concept of the little van and stuff with the washing machines in the back. They're always pretty like mind-blown. They always think it's a great idea. And then they always express like a bit of an interest and one's getting involved as well themselves. Yeah. So that's always been really good. It's some really interesting conversations. And yeah, like kind of what you were talking about before. Like a lot of them are very interested in the types of people that you get or who are using the service. Yeah, and it's good. So it's good to get exposure to that. And like, what are your thoughts on the public service process? Yeah. get exposure to that. And like characters I guess from all walks of life and different backgrounds and stuff? Yeah. How do you feel like with the different types of people that you've brought up? Yeah absolutely you get some um also it's like we get some older people that people have been farmers people in the military um just people have always been sort of from rougher parts of life um you also get people like professionals tradies literally everyone like this whole segment so it is really interesting you have some really good conversations um and you get a lot of exposure stuff yeah people you might not normally interact with day to day which is really good. Cool and what's like um what's the connection between what you do like professionally and your identity to this is their attention is it totally different is it like an escape what's the what's the vibe for you? Yeah a bit of an escape like I work I'm an office job so I'm in IT um and so that kind of you know working behind a desk you're not you're not really interacting with a lot of people day to day I'm a bit of a keyboard warrior so so um yeah come on and see me. Something like this it's just great like be able to build people skills get to chat to them um I really like that human connection something always we're really drawn to so Orange Sky I think is a very personal service you're getting to interact with your friends the whole time um I really like that. Can you say anything about your new podcast? Um Orange Sky just recently finished this podcast it's called um The F Word so um yeah as you know it's like the terminology we use for um Oh is that right? Um I was recently listening to something by you know Simon Sinek who's like a motivational speaker columnist he's got a new book coming out on friendship and it's all about like the it's like one of the largest sort of influences on health outcomes and mental health what do you feel about friendship as a whole in terms of not just what Orange Sky does but like like holistically people's like lives and like and do you feel that in your own life too I guess with friends? Yeah like just what the vibe is of friendship from generally yeah I think um it's probably like one of the most important things you can have in your life um your mates are there for you um and the good times and the bad um I think until you go through a bad time sometimes you don't realise how important it is to have a really strong support network um and just having mates you can rely on it can be a real rock and it's really valuable so yeah. And what's the translation you think with uh with Orange Sky calling friends when they can't play house and that's what you're trying to find? Yeah. Yeah I think um some of the people you come like yeah like one of the comments always really struck me um one of the first weeks volunteering was someone was talking about having a bit of a chat like a lot of people ignore him when he's on the street um it doesn't feel very sane and he was talking about how he just yeah like empowered the dignity and um just felt a bit more humanised having been able to have a chat with us um and yeah that felt really special I don't know just you don't even picture like I feel like it can be normal sometimes when you're walking down the street sometimes you just turn the other way or um and that was just yeah it felt really special. Yeah. Yeah it felt really special being able to yeah have that chat and build a relationship over time so. What's um what do you sort of is there a thing in which you hope sort of happens in the homelessness sector homeless as well and if you're homeless is there like do you have this dream of everyone being housed or is it more just like getting a bit of dignity where do you have it get to in the next little while? Um I'd want people to get a dress before they fall through the cracks. Yeah. Yeah. Yeah. Yeah. Yeah. I've had a couple of days where I've had a lot of mental health experience because I've been in the tracks a lot um I see a lot of people who come through and I think a lot of it like you sometimes you notice some friends their mental health can sort of deteriorate over the time you interact with them like say over the course of a year and I just wish like there'd be some more intervention and get them the help they need earlier on um before they you know end up sleeping rough um and that exposes them. That's your final spotlight. But uh say something really profound now because that'll be. Oh you missed it. Ah. I like a lot. Cool, man. Yeah, was there anything else we didn't touch on that you wanted to say? Yeah, just love the service. I think it's such a great idea. And, yeah, I really hope it keeps growing in Perth. And, yeah, it does a lot of good. I reckon they're big enough, Nick. I don't know.",
  "themes": [],
  "themeIds": [
    "recKMvpxzKSxNdSvC",
    "recgtjtVT8S9BrqAv",
    "recvG6y9hvTJFl5uZ",
    "recuBUbJE3jUvSyqC",
    "recMMBEncal4l88JI"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}