{
  "id": "recRRuYJMQZ9HFfTS",
  "name": "Jeri Pasovsky",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "Jerry, a retired mining engineer and taxi driver, recounts his journey to Australia in 1970 and his various career experiences. He shares insights on the importance of organizations like Orange Sky in helping the homeless with hygiene and community interaction. Jerry reflects on his health challenges and future plans at 80 years old. He also mentions his volunteer work and expresses gratitude throughout the conversation.",
  "quotes": [
    "rec6ObTltmkn4N98A",
    "recJHtAff3wvuL5x2",
    "rectOGrHa8435Ou4C",
    "rec7uoi2YWrnlCSIc"
  ],
  "transcript": "Okay, you just tell me your name, Jerry, and can you spell it for me? Your name and spell it? Okay. Well, say your name and then spell your name. My name is Jerry Pasovsky. J-I-R-I Pasovsky. P-A-S-O-V-S-K-Y for Yankee. Tell me a little bit about yourself. Well, I come to Australia on the 9th of January, 1997. Retired mining engineer. Drove taxi spot there to the east. Oh, I sparred only in the real estate firm. I think this is not working. This is so bad. I may have pressed the button. Oh, yeah. Geez, Jerry. Okay. Okay, kick off. Tell me about yourself. I come to Australia on the 9th of January, 1970. Couldn't speak English. I knew only six words in English, yes, no, thank you, and John Wayne. Two years later, I was at WIU. 1974, I was at Calgary School of Mines. In 1978, I graduated at Calgary School of Mines in two disciplines. Had an awesome time in the mining industry up north. Happened to manage the second largest gold mining plant in Australia. When I left the mining industry, I became the part owner in the real estate firm in my lane. I was a part-time, or partner, shall we say. Right around about 1991, I started driving taxis for some 30 years. Now I'm retired, 80 years of age, and just about the size of it. And why do you use only Sky? We never know what's around the corner. How do you do that? At one stage, I was heading to be a wealthy man. I had about 10 real estate properties to my name. Today, I've got only half of the house, and my ex-wife is still in it. I was sometime homeless. Now I'm renting property in Armadale. And what do you think of our new Sky? What do you what? What do you think of our new Sky and what they do? Great. Young, young cheque from Queensland. As I said, I used to be a volunteer for them about eight years ago. And, yeah, great stuff. Why do you think it's good for people to be able to wash their clothes and hang out at Orange Sky? Why is it good that Orange Sky is here to help? Why is it good for people? Well, I suppose the health and hygiene are one of the most important things. Also, it gives the homeless people to interact with other individuals. And that's all I can say. You look at me again, I missed you. And what do you think of the volunteers at Orange Sky? Volunteers? Well, I'm volunteering myself somewhere else. So I've got no problem. It hasn't been a long time. As a matter of fact, a long time ago, a long time ago, I never really believed in volunteering. I was of the opinion when I, a politician, become a volunteer, I'd be one also. Thank you for asking. What's next for you? What's going to happen next for you, I think? What are you hoping? Um. Well, I'm going to plan what to do with my name, 110. Okay. Whether I'll be last that long, I don't know. I've been always relatively healthy, first 40 years in Australia, even though working 16 to 18 hours a day. I've never had one sick a day. I'm going to try to get better. I'm going to try to get better. I'm going to try to get better every day. Currently I'm battling with cardiovascular disease. Forty nine ago, I nearly died, arriving in the hospital ED, with blood pressure 34 over nothing, or very little. I've got the installed defibrillator in my chest. Very little. I've got this there. Well, I don't know, I don't know. I'm just talking about myself. So, I'm ready to start. I'm part of this. I'm working. So, I'm ready to go. I want to see you. Thank you very much. Thank you. Thank you. Thank you very much. Thank you. Thank you very much. I'm not planning to meet you, but I'm sure I'll be. Thank you very much. Thank you very much. Thank you. I don't know why I was driving too well.",
  "themes": [],
  "themeIds": [
    "rec46w5KUEx3NyChj",
    "recurVM9hZ7vmTb4e",
    "rec4eFLcpybqTgnPQ",
    "recXm9XBKMSNXEO29",
    "rectoY6oBIyPI1EG6"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}