{
  "id": "recry7aq1JRVU2Smj",
  "name": "Linda  Pietri",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Adelaide",
  "videoDraftLink": "https://share.descript.com/view/0CGZuNkAaPl",
  "summary": "Linda Pietri, a former midwife turned volunteer, discusses her background and involvement in the \"orange sky\" project which aims to help the homeless.",
  "quotes": [
    "recAfL1FkyuyZv0lb",
    "reczhFRkY94p1ipZJ",
    "recCf5e2nUqu2JC3P",
    "recRajZlXKBYLlleK",
    "recs1AeT5TO9WyQcx",
    "reckVZpOyttbPjSMe"
  ],
  "transcript": "# Linda Pietri\n\n[00:00:00] Do you want? No, you're fine with the orange sky. Oh, mech on. I'm not, um, I very much love it when it's not planned. Yeah, yeah, yeah. It's hard to be natural though, isn't it? You know, it's, yeah. It's tricky. Well, what we'll do, yeah. Is um, let's do our best. We have a conversation, so I'll sit here. Yeah. So you don't have to worry about this.\n\nYeah, yeah, yeah. From my eye line as well. That's, yeah. Yeah. Yeah. That's good. Uh, cool. So, um, just your full name and spell it would be awesome. Okay. So Linda Pietri, P-I-E-T-R-I-S. Linda, with an I. Yep. Uh, let's start with a little bit about yourself first. Yes. Tell me a little about yourself. Um, well, in another life I was a midwife.\n\nSo a lot of years in that business and [00:01:00] um, yeah, was doing a hybrid volunteering slash midwifery thing and then retired for whatever reason. And now I probably do more hours volunteering than I did working as a nurse. So, yeah. And uh, I was. Probably five years ago drawn to the orange sky thing and having two 20 something sons, you know, the two boys were on my radar and yeah.\n\nYeah, it's good. And I liked the whole idea. I, I think was great. And the fact that they ran with the idea I thought was even better, so, yeah. Yeah, that's good. My, um, my wife is a midwife. Oh, is she? Yeah. She's, it's a great job now. Um, she's now doing diabetes education. Oh yeah. It's a bit more, uh, user friendly, [00:02:00] our probably, yeah.\n\nYeah. Good. Sure. It's a great job though. Um, how did you first hear about onco? I think I always, because I've had an involvement with volunteering and that sort of thing, I've always been interested in what's going on for. People that need it. And I think when they were made young Australians of the year, that really got them on my radar.\n\nUm, and then I live near where the base is, where Splasher lives in Norwood. So I used to see the van a bit. Yeah. And then one day I just said, oh, look that up and see what's going on. And here we are. Um, what is it that. Almost has kept you around though. What are the things that keep you coming back to do this stuff?\n\nUm, I guess you can take the girl outta nursing, but you can't take the nursing out of the girl. [00:03:00] And so helping people's just in my DNA, I think got no other. Yeah, I just really enjoy that I get a kick out of. Doing the right thing. Well, like you saw then I just sort of ran into Morgan today unexpectedly.\n\nWell, I have been working in the background trying to get her a phone for a couple of weeks and, um, that's come to fruition, so she'll be happy with that. Yeah. Have a little chat with Morgan. Like, I think super interesting to, um, understand different people's cons, like, um, yeah, concepts of homelessness slash.\n\nWhy they use these things. She talked about her clothes getting ruined by dryer and stuff and in the van. Yeah. That's surprised me. I don't know. Yeah. Um, what's it, I guess, um, can you tell me a little bit about your relationship with Morgan and friends and things like, how does that work so well, Morgan [00:04:00] just is here when I get here every Monday.\n\nI mean those clothes she was washing today, I think she only washed them on one day. So I think it gives her something to do and a reason to, 'cause she's where she's staying is, well, you were there today, Elle. It's not close. So it's an all day job getting here really. And washing and getting back. Um, but I guess it gives her a reason to get up in the morning and come over here relatively comfortable, quiet.\n\nShe can charge her fine. If she's got one, she can sit here and tidy up her belongings and. Um, but yeah, she chooses to come up here and like she's told you, she goes to the airport for a shower. So that's another hike and a half over there. Um, I'd like to see Morgan get a house and a job. Maybe she feels, she like, she's pretty stable.\n\nShe's got mental illness. Did she tell you that she's bipolar? So she had an episode at work, lost her job. She's estranged from her family. I don't really [00:05:00] know the story behind that. No. No marriage or children that I can get out of her. Um, yeah, we chat, you know, just every week. I think she's pretty well the meds are working, put it that way.\n\n'cause she's pretty even compared to what a lot of people that rock up. And what do you think her reality is in terms of day to day, in terms of like where she stays and that sort of thing? Well, she was living in her car. Did she tell you this? So she was living in her car, but her car and her phone was stolen, so that means she's now sleeping rough.\n\nShe's been lucky with the weather 'cause it hasn't rained here in months. Um, and then, yeah, she's just out in the opening Glendale. 'cause she finds that safer than other places. But that's not, it's not a long term solution, is it? Mm-hmm. And I just think finding a job or a fine or a place to live is impossible [00:06:00] without a fine.\n\nSo she's gotta get that sorted. So, yeah. Um, but she's, yeah, she's, she seems pretty normal, whatever that is. Yeah. Yeah. We, you wouldn't pick her as homeless if you saw her in the street. Um, she's always got shiny shoes, clean clothes, so. Presenting herself well is a big part of what she is, I think. Yeah. Yeah.\n\nI sort of sit down at the yarn and she was sort of like, I'd love to do that, but I've achieved something, is the way she'd put it. Ah. So, yeah. Interesting to see like, yeah. People's level of interests or motivation. Yeah. Yeah. She, I mean, she has never come in here seeming sad or angry to me. And there are others that rock up that have different moods every time you see them, but she's very, even, you know what you're gonna get.[00:07:00] \n\nUm, she's never pushy. She's no one, you know, people will jump up and down if they can't get her washer straight away. She's not that person at all. She's very calm. Yeah. Yeah. I really. You know, I really like her and I'm probably more inclined to help people that don't jump up and down. Yeah. You know that feeling if they're not pushing her, you sort of Yeah.\n\nReally will go outta your way for them. Yeah. Um, um, tell us a little bit the concept of the laundry here. How much do you know about the, when I start of the concept? So this has always been a laundromat. In fact, clients or friends have told me that in the early days and I didn't know. It used to be a laundromat on the top and a nightclub downstairs.\n\nSo go figure. Cool. Can't imagine what was going on. So anyway, I think Orange sky start took it over as a bit of a experiment, I think, to see if. A, it [00:08:00] could be revenue neutral, self-funding, or maybe even raise a bit of money. And I don't, I'm not privy to that information. I have asked whether that happens.\n\nUm, so all these people that live around here in apartments can rock up here and just use it like a normal laundromat pay with their credit card. We used to be open 24 7 for a while. There were people. Sleeping in here and stuff, and I didn't mind. That's fine. But then it got a bit ugly and walls were being kicked in and there was drug stuff everywhere and it got a bit dangerous.\n\nSo we ended up having to shut it at night, which is pretty unfortunate. So the first three, probably two years open, 24 7. Okay. Everything working gradually, we've had to, yeah, wind it back a bit. We've had about. Oh, [00:09:00] 15 fire extinguishers stole. We just, I almost felt like, let's just put it on the footpath because every day I would come in and now it's a real talking point.\n\nThere's one guy that's been coming for ages and every Monday he goes, oh, the fire extinguishers still here. 'cause we've got a lot covered. Someone has tried to force it open, but so yeah. You know, it's like anything, so I don't know. I think it's it. Morgan was able to come today 'cause last Monday I rang and got her a code that she could use some other time 'cause she hasn't got a phone.\n\nShe can't ring. So, um, that's must have been what she used today. But normally she comes Monday 'cause we are here to do it for her and a lot of other people do that too. And we've just started a shift on Thursdays as well, which took a little while to get off the ground, but I think that's busy as well.\n\nOver the back of that park is a social [00:10:00] housing group of flats with a couple of hundred flats. So we get a lot of those dudes coming over. And what's, what's, how does it work, I guess? Like, can you explain how so it works? Um, you mean just physically? How does it work? Well, yeah. Like what's, what's the idea?\n\nLike what. Do you tell people in terms of the pre and the paper? So free is just, I have a code I can use. Instead of them scanning their card, I punch in the code and it's all taken care of. Mm-hmm. And I don't ask any questions. Some people rock up in their fancy cars and tell me they want it for free. Oh yeah.\n\nWhatever. But the paid is. Six or $7 a load, which A probably pays for the electricity and water. B maybe funds orange sky in other ways, not sure. [00:11:00] Um, that's I think, the plan, but no one has ever told us if that happens. I have asked, but never got that information. Cool. So it's a great idea. Um, and people love the idea and people sometimes that come on a Monday night realizing it's free, then say to me, well, so how can I donate then if you've done it for free?\n\nSo that's really great if they think along those lines. Um, I think it's a really good concept and I think the fact that people don't have to. Meet the van at a certain place for a certain time. Yeah. And also the fact that with six washers, six dryers, we can get through a ton of washing really. So it's, yeah, it's good.\n\nIt works well. What's, what's the shifts like in terms of like people hanging around and talking? Do they drop and leave? What's the, it comes and goes a bit, yeah, a bit of [00:12:00] both. Um, which is good 'cause it gets pretty crowded if everyone stays close. Um. We have, we have had over the couple of years, such a variety of people that wanna either do wanna come and chat, or people that just want you to do their washing and then they wanna bugger off somewhere and come back later.\n\nIt's, yeah, look, it's, there's such a huge variety, but it's busy with Mondays, we are doing 16, 18 loads of washing in the two hours, so that's pretty. Pretty full on. That's, uh, I don't think we could do much more, actually.\n\nUm, what's your sort of concept of, in general, in terms of like the, what do you, everyone has a different concept of what impact it has, like the laundry, the conversations, connections, volunteers. What in your own sort of [00:13:00] mind do you think the.\n\nUm, I think the impact is different for everyone and everyone's looking for something different. For some people, it is about the clean clothes, and that is a big deal really when you think about it. Some people like the chat, some people don't. I've had a guy that I recognized from here. Down in the park.\n\nOne day when I was down there doing my exercises, he was trying to charge his phone on the barbecue and I said, Hey Andy, you know up the road, you can charge it in the laundromat for free. And he goes. Yeah, but don't go there Mondays between two and four. 'cause the fuckers wanna talk to you. And I'm like, okay, no worries.\n\nWell you don't have to go in those hours, go anytime. Yeah. Yeah. So not everyone wants the chat. You know? Some people seriously do not want the chat. Yeah. [00:14:00] But it's different for everyone, you know. And what about volunteer wise? Like why do you think volunteers in general can.\n\nYeah, I dunno. I think some people just wanna be busy. Some people really do embrace the concept and like the involvement with people and the feeling that they're helping people. But um, and everyone's kind of got an interest, haven't they? Because we're all just one bad decision away from being our. We friends.\n\nMm-hmm. So, um, yeah, and we've all seen those guys. You know, I think I was telling Nick in the podcast, I used to have a regular girl who was the lead violinist with the Sydney Symphony Orchestra and you know, a couple of bad years, life goes to shit. Bad partner, a few drugs, [00:15:00] gets bit mental illness, life's just upside down.\n\nAnd I don't think really. That she was ever going back to. She was poached to London. She had a huge musical career, but so everyone's come from somewhere different. Some people just are from families that don't know that full-time work exists and other people have had a whole other life and it's just gone a bit bad.\n\nAnd then we get, actually we've got, had a few people over the years that are, you know, homeless by choice that just like the freedom and don't really want government involvement and happy to just cruise around. Totally. Um, any hope for dreams for this journey? Oh, how long have we got? Well, I do, because I've been here since it [00:16:00] opened.\n\nI feel like it's my baby a bit, and as I said, I'm busting to get a shower, but I would almost settle for a running water and a hand basin, which we don't have. Um. I really like to, it's great that we've got the two shifts. I feel like extended hours have been good. Um, just needs a bit of a tidy up, but actually people don't, no one really comments about the state of the place.\n\nI mean, I might give it a quick vacuum before I go, but not many per it's, it's only when it's been particularly bad, like. I don't know. Sometimes there's, you get here and there'll be pizza boxes and beer cans and stuff everywhere, and no one really wants, no one really finds that environment nice, do they?\n\nYeah, so we try [00:17:00] and keep it nice, but I'm hoping that it's doing well enough that orange sky feels they can keep investing in it and. You know, there's a lot of good about it. I think they really did their homework in placing it here. The free bus from the city comes right across the road, so that's fantastic.\n\nUm, you know, but even if you had to walk, it's not that far. Um, the fact that it's near social housing and it's near a lot of other apartments, I think's a great thing. Businesses in the area use it. We get, you know, hairdressers and restaurants and stuff washing stuff here, so. It's a great, it's a great thing.\n\nYeah. Um, I just think a shower would be fantastic. Yeah. So fun. We'd probably keep it locked unless there were volunteers here, but it'd be great to be able to offer that. And we have water and [00:18:00] electricity. And lots of space behind those walls. So I am thinking it can't be that difficult. If you can put a shower in a van, you can put one here.\n\nSo we've, I know for a fact we've had some pretty sizable donations. Um, a hundred thousand from the Freemasons. I've got the Glenside Lines Club wanting to give us money. The money's around. Well, hopefully this will go a little bit of the way to, ah, I've been nagging Emma for a long time. She knows the who, who's that?\n\nEmma?\n",
  "themes": [],
  "themeIds": [
    "recQGF1AHdnWKsj9n",
    "rech1M582wUJVloP2",
    "recKoknzxb9tPnpWk",
    "recQM7qePdmU7Xd52"
  ],
  "shifts": [
    "rectayNXnFhsdvUbo"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}