{
  "id": "recSxR9ED03I7PuGg",
  "name": "Freddy Wai",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Melbourne",
  "videoDraftLink": "https://share.descript.com/view/Nw3cgPPpJMv",
  "summary": "Freddy Wai, a refugee from Papua New Guinea, discusses his experiences of becoming homeless in Melbourne, Australia, despite receiving asylum rights. He emphasizes the challenges and rewards of his situation, including the loss of friends and trust, while highlighting the importance of having access to basic necessities like shelter, water, and electricity.",
  "quotes": [
    "recfMV7j5FRCCFL1r",
    "rect7EXk8lVTTnBYE",
    "rectkQy8rR27eK6IB",
    "recmlrPrDBzFmbhw4"
  ],
  "transcript": "Freddy Wai - Friend - James St\n\n===\n\n[00:00:00]\n\nSpeaker 12: Yeah, I'm just basically been homeless , I'm a refugee from Papua Newa. Finally got my Visa last year, May 2nd, 2024. That was 16 days before my birthday, and it was a blessing year. And now I've been living in.\n\nAustralia for six months or something now. Yeah.\n\nSpeaker 13: What's life been like for you, I guess for the last little bit in Australia?\n\nSpeaker 12: Oh, I think Australia is the most beautiful country in the world, and I think Melbourne. Yeah, definitely is a beautiful place. Yeah, I've been in two places only that's in.\n\nDanon and Brook, the Sunshine Victoria in Melbourne. And I like it. Yeah, [00:01:00] I like both places. Yeah. But I became homeless just seven weeks ago seven months ago. So yeah.\n\nSpeaker 13: What's that experience been like for you?\n\nSpeaker 12: It's been challenging and I think it's rewarding too at the same time because I learned a lot of things I lost a lot too.\n\nBut there's a challenging part is losing a lot of friends. You are losing trust in everybody, especially the government. And then you tend to wanna blame and point fingers at, others. But at the end of the day, I think everybody deserves a place to sleep, place access to, water and electricity.\n\nAnd as for me, as a refugee. [00:02:00] Who seek for asylum in here. And I came and I got, they gave me asylum. I think these rights, I have to acknowledge that I need to make myself work harder to find another accommodation for myself. So I have a, shelter and. Electricity, water and all this.\n\nYeah. Otherwise, I'm not a human being, I cannot, I have to work harder to do this. Yeah. To find a house to live in. Yeah. Yeah. But yeah, it's all right.\n\nSpeaker 13: What was life like in, in Fiji before you came?\n\nSpeaker 12: Life was very hard. I think it's harder than. It is very difficult, harder than what I've harder than what I've experienced in my life in here.\n\nBut I've seen other people in here [00:03:00] too who are homeless who I think they face it harder than even in my country. I think my country is easier. In here, it's very difficult because it's twofold. You can see the good and the bad, but that's advantage and disadvantage from me leaving my country and from me living in here.\n\nLike in my country, you don't look at the clock. You don't really be punctual in Australia it is different. It's very difficult because the homeless people and all this, they're struggling because why they have to be punctual and pay fees and all these things and all, especially when they don't have job and all this is more difficult.\n\nYeah. But in my country, the only thing is the violence is the scary part. Yeah. The violence is, yeah. [00:04:00] There's no limit. That's the thing. So it's extreme violence. Yeah. So\n\nSpeaker 13: what made you come to Australia?\n\nSpeaker 12: Since we got my country got independence from Australia in 1975. After that, only like my parents. They're like citizens of Australia because they were born before we got independence, but they don't get recognized for that. They haven't got a, their citizenship or anything for me. Yes. I was born after 1975. I can get a, I can't get a, passport and all this fight for my rights to come here, but that wasn't the case.\n\nMy parents fight for the right to come here too, and then I fight for my right to come here. It doesn't make sense to me. It is no common sense, but it's all right. God put the law in for some reason. I don't know. We'll work it out later, but I think it's not right. It's not right because if you are born in a country while it's still Australia, [00:05:00] you are a citizen of Australia automatically.\n\nAnd I thought it was only my parents, but I find that, half of the Korean mob and the Torres Strait Islander mob and all the ma everybody, most of the aboriginals, they don't have the citizenship too. So I think we are all in the same boat. So there's nothing to, what was the question again?\n\nSpeaker 13: Why did you come to Australia?\n\nSpeaker 12: Oh yeah. Why I came to Australia? Yeah, because I know this this. My mother country, this is my homeland. This is my mother country, so I still have right to come here. But I didn't come. All my family and everybody, they came here before maybe 1997. Even, I don't know if I were, when I was younger, I came, I don't know.\n\nI can't remember because a lot of traveling. Around the country within PNG and here too, but I can't remember most of [00:06:00] it when I was younger. I only, the only thing I can remember is from 1993 up, when I started going to school. Yeah. After that there were a lot of tribal conflicts in my village.\n\nYeah. Yeah. So my parents have been like, they're basically like vol, voluntary workers. They're born again Christians. My father was a heavy diesel equipment fitter, and my mother was a principal at one of the secondary high schools in p and g, and then she became a community office officer for the mining company in my country.\n\nYeah. And she got some more degrees on top of her teaching and all this, and she. Yeah, she's basically the breadwinner of my family.\n\nAs a result, inherited a lot of land [00:07:00] back at home because most of my family, they come and grow up here, so my sister and my brother, and my mother's sister. So because of my land titles, my life is in danger. Because I received land royalties. Yeah. So they want to kill me. I had to take myself out of my country.\n\nYeah. Yeah. I'm the first born in my male in my country. In my family. Yeah.\n\nSpeaker 13: What's the situation daily for you in Australia now? What's the main things in which you're working on or working towards, or what do you do today?\n\nSpeaker 12: Yeah the first thing I'm working on is basically to get to know the people.\n\nKnow the system here, the street, the bus service is very difficult because if you grow up here, you can instinctively make decisions like what to do, where to go, what number to go. It is not like that. Every day I wake up to check the number again, [00:08:00] because I'm not sure which bus I'm getting on.\n\nAnd I keep on asking the traffic officers and all this, and the people here are very helpful and very, I think Australia is Australian and the community in Melbourne especially, they're good people. They help a lot. Yeah. And\n\nSpeaker 13: Are you using the Sky Service? What do you think of Orange Sky and what they're doing?\n\nSpeaker 12: I think orange sky, I've seen it where in, on TV and all this. And I think I really appreciate the work they do and yeah, I highly recommend the people who fund and support these services. Yeah. God bless you all, like you, you got a heart, heart of gold and I really appreciate your support for the sky orange. People, I'd like to be a volunteer too, to help wash the clothes for like this, but I'm not sure how it's gonna work because that's the only thing. I have. The trolley, if you can take the picture there it [00:09:00] is. Just the trolley there. Yeah.\n\nThat's my only problem because\n\nI never been in Australia, homeless in winter, but summer is all right. That's why I take a lot of clothes there in there. Okay.\n\nSpeaker 13: And what's why do you think like this idea of connection and being able to talk to people is important?\n\nThat's part of what Orange sky does. Why is, why do humans need other people and other people to talk to?\n\nSpeaker 12: Yeah. I think because it's very lonely world for me. For me, I think I'm lonely. I'm lonely maybe because. I enjoy other things and all this. Maybe I'm not I don't have a partner, that's why I'm lonely or something.\n\nBut I'm straight just for information looking for a girl. I have some of my partner ex-partners back in p and g, but since I come here, I have to start a new life, but it's very difficult for me. I can't get over it. Yeah. Like starting a new life here. Yeah. Yeah, I still have [00:10:00] my family back at home.\n\nYeah.\n\nSpeaker 13: What's like some things in which you do to connect with people in Australia\n\nSpeaker 12: In Australia, basically, I just most of the time I just say hello to people, meet them on the road. But sometimes I drink drink alcohol once in a while, and when I drink, I feel more open to speak to people and yeah, I meet a lot of people here.\n\nYeah. Yeah. But\n\nSpeaker 13: do you meet a lot of other people that are not from Australia and do you connect in that way as well or do you make most\n\nSpeaker 12: Yeah, I meet a lot of people not from Australia and Yeah. But I'm very curious about the, how the real Australian, like how the Australians are. The culture and all this, how they speak and all this.\n\nI try to follow, learn the accent, the lingo. But I think if they speak in the ling the slangs I don't understand. They, I seen a lot of, when they get to the, they start using [00:11:00] the slangs and all this, they know. Yeah. And it's a different level. Yeah. Yeah. I can't read it, but I understand.\n\nYeah, I understand. That's cool.\n\nSpeaker 13: What's the next sort of steps for you? What do you wanna do next?\n\nSpeaker 12: The next step for me is after I understand the system, I'm gonna be like, five years. Five years I won't work because that's, I promise that already, because five years, actually seven years I fight for my visa, and finally after seven years, I got it.\n\nSo seven years I will stay. I am like a, a baby, newborn baby. I'm still growing. When I become seven years old, I will understand what to do and then I will start working there.\n\nYeah. I will start working after seven years, but now I'm so mentally tormented because I've been institutionalized and I tried working.\n\nI was working with the [00:12:00] brick laying and all these things. I just walk one day. Yeah. But I couldn't I'm a process technician. Even just fixing a bicycle. I can't do it. I try to change the wheel, change that tube. I can't do it because I can't concentrate. It takes like over two to three hours just changing the tire.\n\nSo I've been mentally affected too. Yeah. I got stabbed here. Two times here. Two times here, two times here. I'm a victim of one punch coward assault. Yeah. They punched me here too. And I fell down. Actually I was on the balcony and they punched me and I fell down because I was dead drunk, so I fell down and the cement broke my jaw.\n\nI got four screws here. Four screws. Yeah. Yes. From my fractured jaw. And then I got hit by a, I got hit by a [00:13:00] car. It's like it was lady, she stopped by the traffic light. I was coming on a bike trying to go and do a inspection. House inspection. Yeah. I come and then there was green light was on. And then she stopped.\n\nAll the cars went and she stopped. And so I took off. When I took off, she took off again and she hit me again. And then she hit me. I went to the air five meters up, landed on my head, bro. Yeah, to my ligament, spine, ligament. And then what happened was the police come to question me, take me to the hospital in all.\n\nI said no, it's all right. It's not her because she was a Muslim lady. She just pick her children and she was crying too. So I feel sorry. Like I said, no she didn't do anything. And then I woke up and I went to the hospital myself. Yeah. And that's another that's the third incident I got.[00:14:00]\n\nSo I got a lot of injuries when I came to Australia too. Yeah. Yeah. What's, what other\n\nSpeaker 13: services do you use at the moment? What are the types of things in which,\n\nSpeaker 12: I use the sender link. I use the Salvation Army, I use the library for shower, and whenever I want to do a like con. Do internet, like search some things.\n\nFree wifi. I go to the library. I even use the console wifi sometimes when I don't have data. What else do I use? I use the bus services and the train services. Most of the times I don't have the, my key, but I think the officers I used to miss understand. But they're really there to help me. Yeah.\n\nI think. Yeah. Yeah. What,\n\nSpeaker 13: and what other things do you think would be helpful for you if someone was to be able to support? What are Yeah. Are most [00:15:00] important?\n\nSpeaker 12: Yeah. I think I would need support to, at least get a job. I really need support to get a job and a house like I'm mentally affected.\n\nI had a mental, independent, psych mental health psych assessment by a doctor, and he found out that I was mentally impaired and he is put a no enough in claim for my compensation. And he says, admit that, but I don't want the money because I don't know how to budget because mentally affected, I can't even work.\n\nBecause I get paranoid, I don't trust anybody. I don't even trust myself. The only thing I trust is I'm praying to God every night or something to gimme some, yeah. But yeah, sometimes I go crazy. Yeah, I try to take things in my own hands, but in my heart I know what is against my religion and I try not to do it.\n\nDo [00:16:00] it a lot, get angry at someone or get violent or something like that is no good. And I'm trying to learn how to live here. Yeah. But it's overwhelming because the culture shock. Yeah. Yeah. But I think it'll be all good. Yeah. Thanks to people like you and the Orange Sky team and all this, I think we are blessed to have, people who do this work and who support us like this. Yeah.\n\nSpeaker 13: Yeah. Awesome.\n\nSpeaker 14: Yeah.\n\nSpeaker 13: Done.\n\nSpeaker 14: Yeah. All right. We're gonna do.",
  "themes": [],
  "themeIds": [
    "recGQB2rwpmldhZed",
    "recloBlgnFZ75Zfl7",
    "rec3gpxICZFBLDtLH",
    "rec8vJI8b206U1wXL"
  ],
  "shifts": [
    "recZ0LlHTsyQtlmA8"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "rec6UV5NUzptrXwP3",
    "recZHMbfmZvNZyLmO"
  ],
  "storyCount": 2
}