{
  "id": "rectcuCxJdtN2CVx7",
  "name": "Bob and Julie - Hamilton",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Newcastle",
  "videoDraftLink": null,
  "summary": "Two individuals, Bob and Julie, talk about meeting at Orange Sky, a mobile laundry service. Bob had been living in the area for several years, while Julie recently moved because of housing issues. They discuss their living situations and challenges, like noisy neighbors and lack of space. They appreciate the support and services provided by Orange Sky and value the community connections made there. Bob shares his experience with housing insecurity and financial struggles, while Julie talks about wanting a better living situation. They both acknowledge the importance of",
  "quotes": [
    "recqyC96svYGB925u",
    "recg0vgRbQmgAXKkm",
    "rec1VMOqzOLInIqjF",
    "recPpei78ZaVWSREZ",
    "recCq7Fhco6kGbKDo"
  ],
  "transcript": "So what I'm going to do, I'm thinking, I'm trying to work out how to do this, whether I, it'll be good to know, to hear my questions or not. Because what I can do is maybe, maybe what? So I can put, I can put one here for me and then for both of you, maybe I can put it like, like there. As long as I don't move. Oh, well, you know what we could do? You could just, if you put your, if you leave your hand there, that's a magnet and that's like that. Is that all right? Yeah. Cool. I'm going to step back a bit so I'm not, my noise isn't there. So if you, the first thing, could you do your, both your names and spell your names for me just so I don't get them wrong? Is that okay? I really can't spell them. I'm going to spell them. No, I think it's all right. J-U-L-I-E-S-I-M-P-S-O-M. Mine's Bob, B-O-B-30-P-U-R-D-Y. Awesome. And tell me a bit about maybe the both of you to begin with. Like, how do you know each other? Only from here. Only from here. Oh. And how did that happen? How did that first, how did you first meet each other here? Well, I came to, Julie was here one day and then I came and we got talking and I said she lives across the road. I lived in the back. I've been here nearly two years. Bob's been here longer than me. That's five years, five or six years, I think. That's amazing. Well, actually, what I might do, because this would be way better if your voices were better. Do you want to clip that on your? I've got a couple. I've lost my magnet. You can click this here. And then my voice. You'll be able to hear my voice. So, tell me, tell me about what it was like to see Orange Sky, I guess, that first time. What was that experience like for you? What's that? I can't hear you, man. I'm a bit deaf. What was it like coming here originally with Orange Sky and seeing the van? Like, what did that feel like when you first? Oh, it felt great. Because I was paying a lady $5 a week to do me washing. And I said, oh, it's here. I'm going to do it. And she said, oh, it's here. And I said, oh, it's here. And she said, oh, it's here. But I just washing and drying straight. Especially for me and for Julie, too. Isn't that great? Well, yeah, I can't fit a washing machine. I can't fit a washing machine, either. In the unit I'm in, so. And how long ago was that that you first came? 18 months for me. Oh, wow. And then you come back again? Yeah. I've had to get out and then I've been back. And I've had to go back and forth. And I've had to go back and forth again. I've been here for almost five years and then I've had to go back and forth again. And I've been back and re-enacted it. And I've been back and re-enacted it. And I've done it again. And it's been really, really great. Well, yeah, I can't fit a washing machine. I can't fit a washing machine in there. In the unit I'm in, so. And how long ago was that, that you first came? 18 months for me. Oh, it was a couple of weeks later. Because I didn't know about it, actually. Then someone told me and then I came round here. I read about it on the notice board. Tell us about this place. Where are we? This is Hunter South Community Centre. Hamilton South Community Centre. And how did you know about this centre before? I didn't. I only lived just over there, so. I wanted to know what was going on and, yeah, any help and stuff like that. Because I'm not from this area at all. I didn't know this existed. Where are you from? What's your school background? I'm from down Lake Macquarie. I was down there in a house with my kids. And we were there for 16 years. And then the owner just up and sold the house. And couldn't find anywhere. And so I became homeless. And then finished up in a women's refuge. Broke my hip in the women's refuge. So, yeah, and then they put me here. Wow. And what's... What's life kind of been like for you over the last little while since you broke your hip and that experience? Horrible. Especially here. I'm just not used to this. Yeah, the fights, the drugs. And you've got a mental problem. Yeah, it's not... I get on well with him. I've no problem with it. But I'm glad I don't live in that room because I would have knocked him out. Yeah, he's my neighbour. He's not quite me, that's the Julie. Mm. But yeah, it's not a nice place. What's... What do you feel like would be good in terms of change? Like is it a move away and a different place? Like what's the best case scenario for you, I guess? I just want to have a room, bedroom, because I don't even have a bedroom. And yeah, peace. Like over here it's over 55s. And I would be happy to go over here. That's where I live, yeah. Yeah. And I'm happy to go over there. Yeah. Tell us a little bit about your situation. Well, I was renting off a minister of religion who was a complete raven lunatic, unfortunately. And he was about three times about that close to knocking him out. He was just a complete idiot. Anyhow, I put in for the Housing Commission. And it only took me about a week. Because I knew him, because I used to work at the CES in Centrelink. And I knew the people there. And I got a place in a week. And amazingly, he said he's going to ask me to leave. And I said to him, I knew he was going to ask me. I said, oh, I've got some news for you, you idiot. I said, I'm moving out. He said, oh, you should have sent him with. I said, yes. And I said, I know you were going to put me out. He said, yeah, I was. I said, I knew that. I said, because you're a complete idiot, mate. And why do you come in his own sky? Like, what's your situation, I guess? Why do you come to Orange Sky? Why do I come here? Well, I've got no washing machine. And I was paying the lady next door to do the washing, $5 a week. And I'd have to hang it on the line myself. Because she didn't have a dryer or anything. But that was all right. But I couldn't just come and fit a washing machine in. That's all there is to it. Because the son offered me, did he? Do you want a washing machine, Dad? I said no. Because every time I say yes, he buys me something. I said, my phone's just about stuffed. He brought me a phone. I wish he hadn't have bought me an Apple. They're the worst phones in the world. I just can't. I always have trouble with them. Yeah, yeah. And why? What was it like, I guess, first meeting? And why do you keep hanging out, I guess? Bob's a normal person. I don't know. We just, yeah, we just talk each other. Yeah. You're just mates, good mates, aren't you? Yeah. That's it. I'd be there like a shot if Bob needed me. Yeah. I mean, Bob can't protect me like I would want him to, how he used to be. Yeah. But yeah, like it's, it's the kind of place where you watch who you speak to. Yeah. Well, I do anyway. No, I'm not scared of anyone. I never have been, so it doesn't matter. Being on my own, I'm careful. And what's, I guess, I understand washing, but it's also like conversation and we're volunteers. Yeah. What's that like? Oh, yeah, they're great. They're great. It's good. Yeah, they're really good. Greg's unbelievable, though. What is it about Greg? He's the best guy in my life. Him, yeah. He's the fitness fanatic. I've never known a great bike. And a 61-year-old. Yeah, Greg's, Greg's really nice. He's gonna do that New Guinea thing, you know. Oh, I mean, he's unbelievable, Greg. And does long bike rides and long walks and, oh, runs up 2,000 steps and down, oh. That's how he does it. And what's it like having a place to go and hang, I guess? Like, is this, like, an important part of your life? Yeah. I mean, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I've been to the gym, I'll get myagram services. Come on, Greg! And that's the good bit. Yeah. I mean, he's this man. He's just this big. He's just this great. He's a great guy, masochist. friends like yeah I've got five kids but none of them live in Newcastle yeah I've got five too three daughters, two daughters in Sydney one in Adelaide, one in Ireland and another son in Canada and I don't see them and see generally the one in Adelaide once a year and the other daughters come up every six weeks Sydney yeah I see two of my sons pretty regularly I mean one comes one's just started work so he's working again so I don't see him as much and my youngest one he works he lives down Edelong down the central coast so he's a fair way away but I see him as much as I can and we'll go down there and visit because he's got a new baby so yeah it's they're all over the place yeah my third son landed in Switzerland Sweden yesterday Peter's gone back to Sweden has he so I've missed him yeah is there's like do you ever think about like you're both obviously in situations that are not the best situation what do you hope what do you hope or want other people to know in the community about like your current situation I guess like I think people have I can't hear you mate people have different ways in which they think about when people are doing it tough what's what's your perception of I just think there's someone worse off there's always someone worse off oh yeah I'm not bad off I'm happy the way I am the kids want me to go down and live in Sydney but I'm not moving out of here no way so I'm happy with what I'm doing what happens here so I'm staying here you know I've got no problems no I'm really I've never had any really problems anywhere but like you know I just I don't know it's just lucky I've got a good spot where I am and there's no no drug-o's or idiots around where I live they're all over this no they're all over here they're all on top of my drug-o's you know it's horrible what's what's the jury's unfortunately they're all over here I mean she got caught with an idiot next door hmm is is there um is there things you're trying to I guess work towards for different I want to put in a transfer to go but from what I've gathered they don't happen very often hmm tough isn't it oh it's tough I mean to see where I live like it's just one room no bedroom nothing yeah and it's pretty small yeah that's the problem with it like I had a dog until four weeks ago yeah a friend of mine she lives in Merriweather she got a two bedroom place and I wanted to swap her but she wouldn't swap me no I'd be happy with a one bedroom that's a good place where she is is it yeah there's a few drug-o's but not as much like his oh this is a joke plus you can it's overlooking the beach where she is yeah Merriweather yeah Merriweather wow I used to live in Merriweather that's awesome oh it's nice up at Merriweather you lived in Merriweather didn't you I lived there how about 20 years ago oh right it would have been different then yeah I we had a unit that was just above the Merriweather bar yeah yep yep and it was like it was quite affordable but I don't think now oh you've got your fortune yeah I think it was two I think it was $220 a week they put these rents up wow and I nearly I couldn't believe it that last rise that the government gave us I got a letter telling me that my rent would go has gone up again it always goes up love every time we get a pension rise yeah that's when your rent goes but it doesn't go up the full amount we get because we got $19.70 and it didn't go up that much no but what I don't get it's not even a unit and I'm paying $258 a week $258 well I think I'm lucky I really do I mean I don't mind paying that there's that many people that can't get a oh yeah yeah you know I mean you've got to be thankful right oh definitely you've got to be in a bad situation with an idiot next door that's all well I think that whole block I haven't got that problem at all that whole block should go yeah yeah hey can I ask one big favour I'm going to take those so do you think sorry it's got a book on it",
  "themes": [],
  "themeIds": [
    "recVZjPGPoHdEZirz",
    "recUEuJOdpOswjvEy",
    "rec2doBs9X19DMHJY",
    "recjPyodeKJBkUloQ",
    "reclFiBmGqq8YpKe9"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}