{
  "id": "rectXaOWGi4EVfNe6",
  "name": "Tom Robinson",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "The transcript involves a conversation between a volunteer named Tom and an interviewer discussing his experience volunteering for Orange Sky, a charity providing laundry and shower services for people experiencing homelessness. Tom talks about the impact of volunteering on his mental health, the power of connection, and the importance of lived experience in community work. He also shares insights on routine, technology abstinence, and parenting. The conversation highlights the rewards of volunteering and the meaningful connections it fosters.",
  "quotes": [
    "recttVj63cuCPMfhV",
    "rec9m3UFvRTsPeyrC",
    "recCT9YdH3rPhpWvo",
    "rec3A485RGXpjcl4d",
    "receSTBZDcc9GefD2",
    "reckbJ8zw9CQU1lHb",
    "receX0fHT603H3dlN"
  ],
  "transcript": "A customer over there just prepaid for two pizzas to bring over. Oh what a legend! From the restaurant so yeah. There's still a few friends over there. So I can do whatever you would like me to do. Yeah they would I reckon. Here you go. I love those random acts of kindness. Let's see how it's looking. I reckon that's not too bad. Cool. I'll probably do bad over there. I always get nervous because I don't edit them. Oh yeah? And then like I get nervous because I give it to the videographers and they're probably sitting there going what a shit frame. Yeah. That's the worst thing ever. The five. Five. Five. I've started editing videos for some gaming stuff online and. Yeah. Oh really? Oh I'm such a novice but when I see something done really well it's always so impressive. Yeah. Yeah you're like god damn. You see something and you're like that has taken you dozens of hours. Yeah. For a 10 minute clip. Yeah especially like transitions like. Oh it blows my mind. Yeah. I always go to this like. I'm going to get really good at everything. Yeah. And then I start thinking about it and doing it. I'm like fuck this. It's like going to the gym. Like I'm going to do it. Got the program. I just need to dedicate some time and you're like I'm just going to watch a documentary about mountain climbing instead. Especially because like you give it to the editor you kind of like it and you think I wish it was this but then you're like oh I couldn't do it. Yeah. Never turns out to be as good as you think it's going to be in your head. Yeah. Yeah. Yeah. Yeah. Yeah. Cool man. So just tell me your full name and spell it to kick us off. It'd be great. My name is Tom. T-O-M. Robinson. R-O-B-I-N-S-O-N. Cool. Tell us a little bit about yourself first. Who are you? What do you do? Where do you live here? Yeah. So I grew up on the coast and then I moved to Sydney when I was 20. I'm 39 now and I moved back at the beginning of 2020. Oh. Yeah. Yeah. Yeah. Yeah. Yeah. I'm 22 and I enrolled in uni. I'm doing a social work degree and I just had some spare time. And so I was looking for a charity to work for and give some time for and my mum said she'd heard of Orange Sky. She works locally and had seen him in the park so I said give it a go and then I went online and did it. There we go. There we go. Why social work? Is there something that's driving you towards that at the moment? Yeah, yeah, it's a few things. Like I get a, you know, I have a feeling, it makes me feel good to be able to help people. And social work is a way to feel good all the time, maybe, if I'm helping people. And I know there's a lot of, it's not always sunshine and rainbows, as everyone knows, but I think that, I've worked corporate for the majority of my life. You know, I worked in FMCG, you know, in business development and things like that, but ultimately it wasn't kind of filling up that cup of helping people and being a productive member of society. So, massive change for me. Does much translate to what you study, to what you experience as a volunteer actor? Yes, definitely. I think it's an advantage for me to be here, though I didn't come here to have some sort of experience that would benefit me in my studies. I just came here because I had the free time and I wanted to help. But coincidentally, it's really helping a lot. You get to see the sorts of disadvantage that are experienced out there. And, you know, it's a great experience. You know, some like pretty harrowing stories of like people, what they're dealing with and stuff. So, it helps a lot. Yeah. I'm only first year, so, you know. What's the role of Orange Sky within those stories, I guess? And like at what level does Orange Sky help? Yeah. So, Orange Sky is a space holder for me. For people that often don't feel like it. People that don't feel like they're seen. People that need to have a connection. A lot of people live by themselves and they don't get a lot of outward free time. So, Orange Sky is a bastion of connection for these people that are, you know, quite disconnected in a lot of ways. And so, you know, along with the manual labor of the job, which is washing and drying clothes, and the actual role is running around doing work. It's mostly just having chats with people, you know. We'll give it two secs. Although it is real life. It's a riffraff, you know. Bit of a riffraff. It's actually fair. It's like really, really safe here. Yeah. Yeah. You know. Yeah. There's not many places in Australia where like you should be afraid to be, you know. Yeah. Sure. Yeah, so it's awesome like it's in this sort of space. Yeah. With a bit of lighting and a bit of like stuff like this. Yeah. They're like, you know, they do a really good job here, you know. Like, I'm here Mondays and Thursdays. I'm the team leader for this shift. And then the Mondays are like. Making it. I'm just a general volunteer or the driver. And it's way busier on a Monday. Okay. Way busier. There's usually maybe 70, 80 people here. So a lot quieter tonight. But yeah, we're talking about Water Orange Sky, like what their role is and all that stuff. Yeah. Yeah. And you know, we've got people that don't have anything wrong with their washing machine, you know. They just come in. Like, you know, we've got like people that just want to come and have a chat, you know. Hey. Nothing yet, Michelle. I'm sorry. Never reappear now. Yeah. I'm sorry. I'm keeping an eye out for it constantly. That's all right. No worries. She lost a jumper. Oh. Nice jumper. Sure. Yeah. And we don't know. I'm. Could have been put in somebody else's basket. But not sure. So we're just asking all the all the other friends that come like, have you seen this jumper? Yeah. It sucks. What's up? Is there things that have changed for you that you've contemplated more or changed perception of or anything that's happened as a part of conversations here or volunteering here? Yeah. Yeah. Uh, one of the perceptions that's changed is just how easy it is for you to find your self in a situation where you need help. You know, some people are like one or two paychecks away from needing, needing a hand, needing someone to help wash their clothes. And um, also how much some people are starved of conversation. And I said before, like 90% of the job is, yeah, 10% of the job is working and 90% of the job is just having chats with people. And that's kind of what it's about. Do you want me to wait for the next one? Sure. Do you want me to wait for these guys to clear out? Yeah. We'll give it a few minutes. Hey, how you doing? Hey man. You want to see the camera? Let's go and see that little red light. See this little thing going up and down? That's the sound. Is it a good sound you think? Green, red? Uh, yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Hey man, it won't be long. I'll just go up to the office. Yeah, just wait. Yeah. How many? How many? How many flights? One take, one photo. Oh, I don't know. I'm not sure. I don't know. No, it's not a big deal. It's a good deal. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. How many? How many by one? How many photos does it take? One photo. Oh, no. It's digital, right? So. Thousands. Movies. It's like a movie. Movie? Yeah. Movie. It's like a movie camera. Movie camera. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. That's Amanda. I'm Tom. No, that's not me. So, Amanda. Yeah. We just went through her story. Yeah. Super interesting. What's like... Come on. Yeah. It's going. I need to say goodbye. Oh. Thank you. See you. Bye, Tom. All right. I'll be in the hood next Wednesday. Thanks so much for your time. You're welcome. Hello! Alrighty, oh, okay. You know where I'm at. Ah, brutal. That work? You got my attention. Actually sometimes they say, a mother's a friend. Have a good night everyone. Good night, thank you very much. Good night. See you Michelle. Thank you, mate, for being here again. Thank you. I'll be here on Monday. Yeah, Monday, Monday, Thursdays. I'll be here Thursday for you, because that'll be for our Thursday. Good point. I just wanted to check that. Yeah, I should. Monday starts. Yeah, I'll find out. Thanks for the reminder, actually. Best day of the year, I think. Yeah. Is it what, sorry? It's my birthday. Oi! Happy birthday. It's a solemn day to be born. My mum was born on September 11. Oh, really? Never forget. The only thing I remember is growing up, I was in Cubs, and I always used to get to carry the flag in the index day parade for my birthday. That's cool as hell. Birthday, and you got a flag, and you're a woman. Yeah, I got a flag, and you're in a parade. Yeah? Oh, yeah, everything, all my journeys are one. So, like, Orange Sky. You were saying Amanda. Oh, Amanda, yeah. Yeah, yeah. So, Amanda's had this incredible journey, right? Yeah. To get here, and like, she spoke so well around what it felt like to be, like, to use a service, and then to, you know, like, be a volunteer. Yeah. What's that, what's that journey, like, feel like for you, I guess, now you know you've made your way to the world? Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. And I'm curious if it's the same thing for you, I guess, now you've made it a hand with her, and like, is there a different relationship because she has experienced homelessness, or is she just the same as everyone else? Like, what's your... I didn't actually know her when she was a friend. I've only known her as a colleague. But to see her grow as, like, a person who is in an unstable position to a person who eventually is in a really stable position now has been amazing, you know. It's like a full transition. transformation and you know you can see it on her face like she's got a wild story but she's a very positive happy person um so yeah it's been lovely to have her what's what's the power in that like lived experience it's massive and thinking about what you're studying yeah like how empowering do you think that is to be able to support more people to be part of that industry it's so massive having lived experience for any sort of community work is a superpower people you know you don't want to be divulging you know straight off the rip but having an understanding of what somebody's going through is and is incredibly powerful because you know what they need you know how to hold space for them and how to be how to be a supportive person you know so yeah if you want to do anything in the community you know it's so powerful to have someone that's willing toがんじ Pictures think of them and think it's super inspiring they're like a blessing in the world know the traditional locomotive that you and your old snails you know change up your regularly changed guys community sector I would say get out and volunteer and you know meet the community yeah lived experience is massive for me it's really you know in my studies it's really big it's really good so many diverse people that volunteer for a different reason yeah what do you think from an Australian perspective cultural perspective what's the power what the impact in more people volunteering yeah it's better for everybody because as a volunteer you get a lot out of it you get to make these connections with people meet them get to hear their story they get to hear your story and you feel good and they feel good so it's like two parties just walking away with positivity you know you're not there's a different feeling to it when you're volunteering you know it feels way more pure than getting paid for it because you can leave whenever you want really like you don't have nobody forcing you to come here but you know you want to come like I really enjoy coming here so I think if more people volunteered then they the people they're helping would feel better and they feel better it doesn't take much you know it's only a few hours out of the week for me so it's easy it uh yeah pays more than it pays more like than it takes in terms of karma I guess I always think about like ________________ but the services offered what will be the difference if all the people that have worked on it paid for the people for the friends like how do you think that would change the service ________________ I don't think it would just change the reasons why people do it people is supposed to overestimate People wouldn't be, I just don't think people would be coming to it for the same reasons. It's not an, you know, it's like two and a half hours out of my week, you know, if they said, do you want me to pay you a wage to come here? I'd feel really weird about taking it. So, yeah, I think that it keeps it, you know, it keeps them more honest if you're just doing it because you like doing it and you want to help people. It's not for profit, you know, like I wouldn't be volunteering if this is like a corporation. You know, they're doing really good stuff. And it seems like all the money is invested in new vans and new services and stuff. So, yeah. Sometimes I hear from friends and they say, kind of like you said before, like volunteers don't have to be here. Yeah. And that's why the friends appreciate the volunteers coming because they're giving up their time. Exactly. And they all know, you know, sometimes they say, oh, like sometimes they ask you, you're getting paid. And you're like, no. And they go, oh, really? And then they like you way more. Yeah. It blows their mind. What do you hope to, I suppose, continue to get out of our own sweat as you're studying? Like are there things that you think will be beneficial and what are those things? There's nothing that I want to gain specifically outside of meeting, but I want to be able to be able to be with new people that come here and maintaining the friendships and relationships I have with people that are already coming here. It's really good for my mental health. You know, I get like anxiety, depression and stuff. And this helps to serve a purpose. And it is a really, just, this makes me feel good. This is really weird. Like, I don't know if it's getting worse or what. But like. Yeah. Anxiety and depression and like different things that are happening in the world that like are creating like this connection maybe or loneliness and stuff. Like. Yeah. Addiction. There's lots of other things. Like what do you think? But yeah, it's interesting to hear you say that. It is. It's a protective factor for you. It is. You know. People with addiction issues. You know, you can easily fall into that cycle. And there's a lot going on in the world at the moment. So, you know, if you're looking out there for reasons to be sad or anxious, like you're going to find heaps of them as well. So I think there's also a lot of people that have probably always had it, but they just never looked at it for what it was. So, you know, sometimes people say, oh, there's so much more people being diagnosed with depression, anxiety, sore throat, depression. So, you know, sometimes people say, oh, there's so much more people being diagnosed with depression, anxiety, sorrow, sadness, depression. And things like that. But I think the reality is that they were always there. They didn't say anything about it. So, yeah, people, you know, they become addicted to things because of that. They're trying to make themselves feel better. And connection is the opposite of addiction. So, like, you know, people come here and get to connect and make them feel better. And they make me feel better, you know. In a weird way, that's like a selfish reason. You're like, I'm trying to feel good. It's like a positive addiction, right? Addiction connection? Maybe. It could be. I definitely didn't come up with that. Oh, yeah? Oh, really? You write that down in my phone. Stolen. Stolen focus. Stolen focus. Stolen focus. Or lost focus. I always take stolen focus. Johan Harari, right? I feel like it's, yeah. I feel like it's a lot of stolen focus. Harari. He went to this beach place and just got rid of all of his devices for three months, I think. Oh, yeah? How'd he go? Yeah, it was an interesting process for him, I think. Like, just the, like, what he gained and what he lost was interesting. Like, I think he gained. He lost a lot of focus and drive and stuff, but he lost some connection and some engagement. But I think he felt, in the end, it was a positive experience. I think it's really good to have those, you know, have that abstinence from technology. And it's hard, but doing hard stuff is good for you. I think that's a big, right? Yeah. It makes you feel, like, you know when you come back from a holiday and you've had to, you know, you're, like, broken out of your routine. You're, like, I've got to go to this place, get a bus, you know, everything's kind of, like, up in the air. And then you come back to your house and you're, like, fuck, I killed this shit. Like, this is easy. Life's so easy. And you've just got this, like, you know, this, like, chill energy about you. Because you had to do all of this wild stuff that's out of your routine and you handled it. And then you come back and you're, like, oh. Yeah. It's a child's play. Routine's so funny and habits. Mm. Yeah. Yeah. I'm trying to, yeah, I'm trying to work out how much to drive that into my children at the moment. How many kids have you got? Two. Two. Yeah. And it's, there's no right or wrong. It's just, like, a continuum of, like, how much you push your kids, right? Yeah. Like, you can push them so hard that you'll, like, do everything, fucking, like, all the carry and, like, over a thousand words. Yeah. How do they, how do they, you know, what's the, what's the, what's the, what's the thing that they need to be able to do? Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. I mean tell me how they all respond best. How do they do it? Um, they're both a hundred percent really different. Yeah. It's a role in the dice, hey? Genetic lottery. One loves, one loves routine, and loves to sustain in the game, and, like, being told really specific things. And, like, having rules based off drives. Mm. My other one, gives a direction, hates it. Anarsean. Okay, she just loves... What a legend. ...dreaming. She loved looking out the window for 30 minutes. That's sick. And you're always, hurry up, darling. What are you doing, darling? What's going on? And now, especially for the Pollyannas, like hurry up, what are you doing? Yeah, yeah, yeah. She's like, shut up, I'm thinking, Dad. And she writes, like all the time. Oh, really? She's got a typewriter, she types letters. That's cute as hell. That's super cute. I went in the other night. Nice physical memory. And she typed something, and then she rolled it up, and then she tied it in a bow. And I was like, is that like a letter for someone? And she's like, no, it's instructions for something I was doing. And I'm like, it's all weird, but I love it. That's super cute. Is this a scroll from the 1500s? Where does it go now? Yeah. She reads the, she's a perfect drag in the fantasy book. Oh, sick. She reads like one every three days. Oh, what a weapon. And so I've been exploring a lot of the like, those, right? Yeah, yeah, yeah. All that medieval lore. Hey, are those clothes? Five more minutes. Five more minutes? Yeah, yeah. Sweet. Cool, brother. I reckon that's about it. All right. Thanks, Ben. Unless there was anything else you were keen to say, or talk shit about Nick and Lucius, or? Never met him. Are they?",
  "themes": [],
  "themeIds": [
    "recJfWL2hTaGi4vqz",
    "recqQR2qh9ztKYnn3",
    "rec37SMvnUbSEkWCe",
    "recPnetBPMg7c1sBe",
    "recazNhLyAoZSY7uE"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}