{
  "id": "rectcIjopQGjArGbK",
  "name": " Cheryl Ann Mara",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Gladstone",
  "videoDraftLink": "https://share.descript.com/view/ruDTN6rQw4s",
  "summary": "Transcript summary: Cheryl Ann Mara, a new resident of Boy Island, shares her volunteer experience with Orange Sky, a community organization she discovered through her local Lions Club. She was inspired by the simple act of helping others with laundry services.",
  "quotes": [
    "rec9X2aLuWbvQTpBZ",
    "reczhonHsFk7GXb1T",
    "recE31fiv1C1KFK4I",
    "recMzfLtmLBeN3De6",
    "recI72jQ5cdurFbil",
    "rec0zFZJ4ndICwbdl"
  ],
  "transcript": "# Cherly\n\n[00:00:00] \n\n**Speaker 3:** All right. I'll just clap my hands to make it sound like I'm professional. Alright. This is great. Yeah. Just tell me your full name and then spell it for me. \n\n**Speaker 4:** My name is Cheryl Ann Mara.\n\n**Speaker 3:** Tell me tiny bit about yourself first. Who are you? \n\n**Speaker 4:** I am fairly new to the area. I've only been out at Boy Island seven years.\n\nI come from New South Wales, a little tiny village called Wool I, which is halfway between Coffs Harbor and Yamba on the coast there. I was the local first responder and in charge of the SES. My husband and I raised two kids there, a boy and a girl. One lives here. The girl lives here in Gladstone as a lawyer, and my son lives at Dhar as a minor, and my husband died in 2005.\n\n**Speaker 3:** What how did you first hear about Orange Sky? \n\n**Speaker 4:** I saw it on the television many years ago when it very first started and I thought, wow, what a good organization. And then I must admit, promptly forgot all about [00:01:00] it. Came up here and learned about it again through the local lions. Got sick promptly, forgot all about it.\n\nRan into one of our members at a Bunnings Barbecue Alliance, Bunnings Barbecue, and I was signed up that afternoon. \n\n**Speaker 3:** Wow. What was it about it that. I, \n\n**Speaker 4:** it's just a fantastic community organisation The people you're helping, it's such a simple thing. Doing a load of washing for somebody, how simple can it be?\n\nBut there's nothing like clean clothes. \n\n**Speaker 3:** What keeps you coming back? \n\n**Speaker 4:** It's a shift. The shift. The people that I meet, I've met some wonderful people through here. The people I work with they're great, and that shift changes every now and then. But people like, like Sergio and Marilyn that come along and have a yarn and Cliff, we wondered what had happened to him.\n\nBut he's act unfortunately, been in hospital, but he's turned up again. He's fine again now. And they become a little bit like a family and you worry about them. They're old mother hen I suppose. [00:02:00] \n\n**Speaker 3:** That's so cool. Yeah. What are some of the things that have surprised you since you've started volunteering with Lawrence Fire?\n\nAre there things that have changed in yourself since you've started to do this? \n\n**Speaker 4:** I'm a lot more appreciative of what I have. And I have a day where I'm feeling a bit sorry for myself and then I stop and I think, no, I could be out there in the cold or the heat with nowhere to go. And it just makes me so thankful and it makes me thankful for the fact that for three hours.\n\nI can come here and help somebody else and all it costs me is a bit of time and a smile. \n\n**Speaker 3:** That's cool. Tell us a bit about the, how much do you know about the area and about the people that come to use the service? \n\n**Speaker 4:** Most of the people, most of them are men that come to us that are living rough.\n\nSome of them are living in their cars, some in tents, some in vans, on sides of roads. They just can't get accommodation. Or they have a pet and they can't get accommodation because they have a dog. That makes it very hard and [00:03:00] they can get accommodation if they didn't have the dog. But the dog is their best friend.\n\nWhy should they have to give it up? Sometimes it's the dog that keeps them safe. A couple of the men that come here are veterans and it's so sad to see them. Not having a home. I don't think any of them are homeless by choice. \n\n**Speaker 3:** Yeah. How does the, is there a different flow of people at different times or is consistent with \n\n**Speaker 4:** people?\n\nWe have our regulars. We have our regulars every week. I'm sure the Tuesday shift has their regulars. But then we get an odd one that might be somebody passing through that's maybe used the service somewhere else and heard about it here and they come here 'cause we are a little bit out of the road here.\n\nBut that's part of the appeal too. Because we, it's easy for parking and they can, most of them come and they drop their washing off and go and have a hamburger and a coffee from the Salvation Army. And they get a feed, and sometimes that might be the only hot meal they've had, so it's very sad.\n\nYeah. [00:04:00] Yeah. But it makes you feel good that you are doing your bit, and like every organization, we cry out for volunteers. And if people would just come and realize that by giving back to somebody, you don't know them, they don't know you, but you've done something wonderful, a load of washing.\n\n**Speaker 3:** Tell us a bit about the pod. \n\n**Speaker 4:** The pod's great. It's wonderful that 10 minutes to set it up. We we run our hoses around to the drain, then our water and our electricity and all the, detergent and everything is automatically fed in. We start the dryers up 10 minutes before we want them, and that gets them hot.\n\nThey run on diesel. Occasionally we have a few hiccups, but with maybe water running the wrong way or something. But we figure out what to do. We've learned and we leave little notes for the next shift. This happened, this is what you do to fix it. But if we need something, we ring the number that's on the board and they attend to it.\n\nThey're very good. They're very good. 'cause we only operate two days a week, [00:05:00] Tuesdays and Wednesdays. And it gives them, five or six days to be able to fix something if it's something major. \n\n**Speaker 3:** How do you feel about being part of the broader orange sky community? Oh, \n\n**Speaker 4:** great. If I go anywhere, if I were to go anywhere and there was an Orange Sky pod there I would go and just call in and say, hello.\n\nI'm Orange Sky from Gladstone. My sister would love to be able to get involved. She lives at Tel down near C Harbor, but there's nothing down there. Their closest one, I think she said is Ballina. Maybe one day I said, just keep an eye on it. Maybe one day it'll happen. \n\n**Speaker 3:** , one of my passions is this idea of story or conversation.\n\nHow does that happen on shift here? That conversation? Is it a planned thing? Is it very natural? How? Just natural. \n\n**Speaker 4:** Just natural. If somebody comes along and wants to have a yarn as Cliff did this morning, and tell us that he'd been in hospital. We just let him tell us what he wants to tell us. We don't really ask any questions.\n\nWe might ask the question, are you okay now? But they tell us what they want us to know and we only tell them about us, what we want them to know. But [00:06:00] we have a little girl here, little Emma, little, I think she's three. She comes, she has to come see her laundry ladies. She comes every week to see us.\n\nShe's a real little sweetie. So \n\n**Speaker 3:** good. \n\n**Speaker 4:** Yeah. \n\n**Speaker 3:** And who would you recommend next to talk to? Who should we talk to? \n\n**Speaker 4:** I think Faye, she's the next one. Yeah she's here. Yeah. Yeah, she's here. She's in the black cardigan there. \n\n**Speaker 3:** Oh. And what about some friends do you think we should talk to? Oh. \n\n**Speaker 4:** Oh, James.\n\nJames is over there. He comes every week. He's a regular Cool. He's been coming for ages. He's actually moved into a house now, but he still comes here every week. Amazing. And and we like to have James. Yeah, he comes with his carer. Yeah. He usually has his mom's washing too, but she's in hospital in Brisbane.\n\nHe told me this morning. But he's a lovely bloke. He's so special that we fold his washing \n\n**Speaker 3:** so good. \n\n**Speaker 4:** I dunno why we do it, but we do. He's just so lovely. He's so polite. I think that makes us feel good because, 'cause I always try to be polite to people and when you get a [00:07:00] you are welcome or a thank you back.\n\nAnd he always says goodbye to you if he's leaving before shift's up and that he's just such a lovely bloke. Would you like me to go and ask him? \n\n**Speaker 3:** Yeah. Amazing. Just say that one.\n",
  "themes": [],
  "themeIds": [
    "rec2v7oaaVaq7DhUc",
    "recCwEvIy5SzSwQT9",
    "recz36jqSUSk3SJ5Z",
    "recDQnsJaRGT2cUy8"
  ],
  "shifts": [
    "recztH9xwFE3kdcK4"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}