{
  "id": "recUqCjwyH7SRam6Z",
  "name": "Brett Klumpp",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Newcastle",
  "videoDraftLink": null,
  "summary": "The transcript features an interview with Brett Klump, a volunteer team leader with Orange Sky. He discusses his role, the connections he makes with people in need, the positive impact of volunteering, and the strong relationship with the local church. Brett encourages others to give volunteering a try and highlights the rewarding feeling of helping others.",
  "quotes": [
    "recwHknhLnaP61EFu",
    "rec3EGdbmhakHNx2v",
    "recl7CpnChzxULefH",
    "rec1KwAQxJkVs4mwH"
  ],
  "transcript": "A bit of like rough behind the scenes type bit of action going on. Do we look like rough people or something? Is that, don't I? Righto brother, just your name, tell us your full name and spell it, it'd be great. Brett Klump, you know Brett Klump, K-L-U-M-P-P. Come here, tell us a bit about Brett Klump, who are you, what are you doing here? I'm here volunteering, helping out our friends, it's all just giving back, helping people who just need help and it's just yeah, good group of people sharing time. Tell us a bit about your role and how you got into it I guess. I'm the team leader with the role, I just, joining Orange Sky, I joined probably just right at the start of COVID or just before, just before COVID. I was just finished, all my volunteering was with the kids and sport growing up and now growing up and then I just wanted something else to do, I looked around and heard about Orange Sky, seemed like a great opportunity to join that. Um, then with the team leader, the other team leader just said to me they didn't want to do it, am I interested, everyone stepped back, so I stepped forward. But no, I enjoyed it, it's quite easy job to do, it's a good group but we all run it, just all together, it's all, everyone shares an opinion, gives ideas and we go from there. What's the vibe like here with all the people that come and the connections, conversations, how do you feel about it? No, it's good, it's a good area, it's like we're always, and like I keep warning the team, and I did just sing earlier. Um, you know, it's a good area, it's a good area, it's a good area, you've got to be wary that any situation can happen any time, it's always been safe here, we had a couple just might have raised a voice and we just have to calm down, there's been a couple of knife instances around with the meals, they haven't been around here and they've been sorted but it's always seemed safe, we're always on alert, but friends we have coming, we have a chat, we have other friends who come just for chats because we start here, you know, an hour before the meal starts, so they'll come and just sit with us and have a chat and catch up and we'll just keep going. I've been very thankful for that. Yeah, it's a good group of people. That's cool man. Um, there's a relationship with the church, how's that work and what's the benefit? Oh, very good relationship with them, we help them out, um, they'll put on a Christmas lunch for all the friends at Christmas time over in the Cathedral, um, ended up, because we do that, we're our chief carver, I have to carve the ham every year for them, um, we run a barbecue here, every about two or three times a year, the relationship, yeah, works well, we're going to talk with them, but I think they're the best. I think they're the best, they're the best. They talk with us just to share things. They have all the kids help out. They'll bring the kids around to have a look what's going on with us and they'll learn about Orange Sky as well. But yeah, no, they're a good group of people. That's cool, man. Tell us a little bit about what you get out of this and why you keep coming back, I guess. The people I'm here with, volunteering with, they're a good group of people. We all get along. The friends just hearing different stories. That's just interesting to hear the stories. It's sad as well how they've got to be in the situations they're in at times. There's the others who aren't keen on sharing stories, which is fair enough. They don't have to. I don't know. I just feel good. Whenever I come in here, I go home, I always feel good when I go home. I might be hungry or a bit tired, but you just feel good. It's just a good feeling to be out helping people who need help. Some people are kind of on the fence with volunteering. They want to do it, not sure. What would you say to them about why just give it a crack? What's the reason? Just give it a crack. It's easy. You can always give it a crack and then decide, no, it's not for me. So always just give it one go. But even if you volunteer, might try it here and go, no, that's not for me. I want to do something else. Go try somewhere else. Just try different places. There's lots of different opportunities out there, different things. I think everyone will find something for them in volunteering, no matter where it is. Cool, man. Mate, you smashed it. Yeah.",
  "themes": [],
  "themeIds": [
    "recJfWL2hTaGi4vqz",
    "recInLsX3LEDUPMxC",
    "recdFm8isbYNDy4N3",
    "recDLaF2YO9JgyfrN",
    "recggl7hB1IQXtkdv"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}