{
  "id": "recVajRcaR2N5aGJN",
  "name": "Chris Mourad",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Melbourne",
  "videoDraftLink": "https://share.descript.com/view/DyZ422WiNXp",
  "summary": "Christian Morad, a software developer and member of an orthodox church in Hallam, Melbourne, discusses his background and experiences in a brief interview.",
  "quotes": [
    "recSZTTCg8TzD76ye",
    "recGFWXbX3rAoAz8g",
    "recuBhju9LdeBUK2e",
    "recybz072pygaZHVj",
    "rec2FmRNTKgi0lBgN",
    "rec73TL3telIks6x5"
  ],
  "transcript": "Christian Morad - SP - Doveton\n\n===\n\n[00:00:00]\n\nSpeaker: It was totally out of focus learned.\n\nSpeaker 2: Oh,\n\nSpeaker: so this, um, I'm going, going to,\n\nSpeaker 2: will it stay focused or could it come out of focus as like I move, sorry, you've\n\nSpeaker: got two settings. One's continuous focus and one is, um, static. Okay. It's on static focus. Okay. And you look, you look in focus.\n\nSpeaker 2: Beautiful.\n\nSpeaker: Sweet. Let's just make sure you're right.\n\nAnyway. All right, brother, you just talk to me, don't worry about the camera. Beautiful. Um, and just tell me your full name and spell it, will you? Awesome. Uh,\n\nSpeaker 2: Christian Morad, C-H-R-I-S-T-A-N. And Morad is M-O-U-R-A-D. Most people call me Chris.\n\nSpeaker: Chris, tell me a little bit about yourself, Chris. How would, how do you, like, tell, introduce yourself and identifying that kind of stuff?\n\nSpeaker 2: Uh, I'm a Christian. I am a, I'm an ortho. I practice in an orthodox church here in Hallam. Uh, called Sanmina San Marina. Um, the, my day job is a software developer and I am married to a beautiful Maria Gabriel, uh, for two years [00:01:00] now. Uh, we moved to Melbourne a year ago. We just closed a year, two weeks ago.\n\nAnd, um. Really enjoying the day today. You know, it could be negative to any back home, so I'm very happy with the sun here.\n\nSpeaker: Um, tell us about like, the, um, connection with, um, with the church and how that came about.\n\nSpeaker 2: Yeah. So, um, I've, I've had, um, a spiritual guide my whole life back home. Uh, home is, um, Toronto, Canada.\n\nAnd, um, it was, it was actually very difficult for me to come here and lose connection with my, uh, with my spiritual guide. I always reli on him with, you know, decisions as to my, my service, my spirituality, um, and my day-to-day life. And then we came here. We actually live in rural. Uh, Gibsland. We don't live here.\n\nUm, and, you know, six months in, I was really struggling. It was the first time, you know, moving from a [00:02:00] metropolitan area to the, the country. It was my first time I was kinda struggling with, we, you know, my wife and I were making a trip every week making sure that we come and connect church and we have communion.\n\nUm, but then I was still, like, during the week it was a bit difficult. I work from home, so kind of connected with my company. On my laptop, but outside of the laptop, there was nothing, uh, other than my wife, which is fantastic. Um, but then eventually it became a little difficult. So, uh, the father suggested that, Hey, why don't you come midweek, do something different.\n\nUm, there's this service running here. Um, I was like, okay, uh, well what is it like? So he described it to me, he said, it's a dinner. You just come and talk. I was like, yeah, great. I'm very good at talking. So, uh, I'll come and talk. Um, more interesting is the listening I've, I've been learning. Um, and uh, actually this is how I met my wife.\n\nWe, we met in soup kitchen back home. Uh, we used to [00:03:00] volunteer at soup kitchen every week for years. Uh, so it's, it's also very, uh, sweet to to be here doing the same thing.\n\nSpeaker: That's awesome. What's, um, how would you define this idea of connection with people? How do humans connect and why is that important?\n\nSpeaker 2: That's a great question. Um, humans connect through, I think more than anything, listening, being present in a conversation. Uh, more so listening than talking. Uh, I know, I, I say I love talking, but, but really listening is a lot more powerful in my, in my experience. Listen to somebody looking eye to eye, uh, smiling, reacting, being surprised, being shattered.\n\nIt, it builds our fabric together as humanity, uh, to be connected. Get to live an experience with somebody who lived in rural Australia here for maybe 20 years. Somebody who live worked in a coal mine, someone who worked as a, a race, uh, [00:04:00] like um, a bike racer. Someone who worked as. A bodybuilder. People who met here that, you know, lived lives that I've never lived before and I don't think I've ever lived them.\n\nBut through them I'm exposed to part of humanity that I would have no connection with.\n\nSpeaker: That's cool. What, um, from working here, how is your concept of what this idea of experiencing homelessness is, has that changed for you? The more that you've been able to engage with people, or is it, or is it something you've had in that concept with lot?\n\nSpeaker 2: So I've had that, I've, I've had a connection with, uh, with, with people of lower income, uh, or people who are struggling with homelessness for years. Uh, I've done it maybe for 10 years back in Toronto. Um, this is different. Every time is different. Every city is different. Every group of individuals is different.\n\nIt's never the same. Uh, I've served in Toronto for people who are on the streets or in shelters. I. Those were very different from people who came to the soup kitchen at church. Those were very different from people who [00:05:00] were of low income status that we used to, you know, go to their buildings and share meals with them.\n\nIn Mississauga, which is a suburb, a suburb of Toronto, very different people are coming here. You know, it's very surprising to me. People, people drive and come here, uh, or pick up their friend and come here or take the train and come here. Um, one thing that is definitely has been evident to me throughout the years is.\n\nNobody wants to be where they are and nobody's scary, which I think is an idea that, um, I had before. It's scary. I'm scared to talk to somebody who looks a bit different, who might twitch or might say something that I'm not comfortable with. Um, but I'm learning. The more I have the conversation, the the less scary it is and the more they're, you know, someone having a bad day.\n\nOr someone who've been having a bad day for so long. Hmm. Um, they're, they're just struggling with a bad day and a smile, a, Hey, how are you doing? [00:06:00] Talk about the weather. Talk about something that I really like doing 20 years ago, will take them in a flash in a to a happy place because I also have bad days.\n\nSpeaker: Totally. You know, it feels. Um, what's, what's your concept of orange sky? Do you know much about it and what do you think about it? I guess?\n\nSpeaker 2: Sorry. Uh, can you repeat, oh, sorry.\n\nSpeaker: Um, what's your concept of orange sky as a service and do you know much about it and\n\nSpeaker 2: what's not? So much? So my only exposure is walking in and walking out, uh, seeing that, uh, seeing, seeing the laundry, um, and what I know from people who should sit with me on the table.\n\nThey're very thankful, um, that somebody can take care of their laundry and not only take care of the laundry, but take care of them. Somebody who's gonna talk to them, somebody who's not gonna make them feel like they're, you know, they're their duty, but hey, uh, we're, we're here. We're doing laundry, we're talking, we're making friends.\n\nUm, fellowship is a strong word that we like to use. So having fellowship and not just a duty. I think [00:07:00] also I struggled that a lot for, for a long time, is. Serving as you know, I am here and you are there and I'm putting my hand down to help you. It doesn't feel so good. It is not, it doesn't build the other person.\n\nUm, and what I get from, you know, the, the, the gentleman and the, and the woman that I meet here is, that's not, that's not the attitude. The attitude is we're sitting together. There's no one is putting their hand down. We're sitting together. And that's very powerful.\n\nSpeaker: That's awesome. That's good. That's a really content.\n\nUm. What's this, what's this idea of story for you? So, the reason I'm doing this is Mm. Um, that we're gonna have lots of different people's telling their story. Yeah. Like what is our stories powerful and why, I guess, like, and, and why is it important to have a range of stories and not just a few?\n\nSpeaker 2: That's a really good question.\n\nUm, I think. Uh, so I, I, I've been, uh, born [00:08:00] a Christian, lived a Christian my whole life. Um, I'm a believer and, uh, there's something very powerful about God choosing to speak through stories that says a lot when, when his choice, his defacto choice is a story that says something about the power of a story.\n\nUm, the Bible starts in a story, continues to have story upon story upon story, and tell the story of Christ himself and then the story of the church that we are living today. Um, stories are. Complicated or not complicated. They're complex. They have nuance. They're not bullet points. They're not, they're not flat.\n\nThey're 3D. They're full. They take you up and bring you down. You cry, you laugh. You, you, you feel something and, and you do not get stuck in a linear flat to the sequence of events. Mm-hmm. And. That, that that's what life is like. There's no, it's not linear, it's not flat. [00:09:00] There's so much happening. And when we tell stories, we're able to transport the person from where they are to being in the story.\n\nAnd that's so powerful. It's different from getting a bunch of stats or some information. Uh, it's, it's living something with somebody, which is very different than just getting information\n\nSpeaker: and what's like. I've, I'm definitely not a very good Christian. Um, I used to be good and I've read a lot of, I've read the Bible a few times.\n\nI even read it in Spanish. Um, what's like, and this whole, there's an idea of the word of God, I guess. Um, does that mean that he owns the, the words and the stories, do you think? Like, and, 'cause the reason I'm asking this is\n\nSpeaker 2: mm-hmm.\n\nSpeaker: I'm really interested in like, who owns the story once you tell it. So if a friend or someone experiencing homelessness tells us a story and someone goes and [00:10:00] uses it, like, is that okay?\n\nAnd, and how do you, how do you do that properly, I guess is question.\n\nSpeaker 2: That's a great, that's a great question. I think\n\nSpeaker: about it a lot. Yeah,\n\nSpeaker 2: that's, that's a great question and, and\n\nSpeaker: I think the reason I asked it was in relation to religion is that I feel like words are sacred.\n\nSpeaker 2: Yeah.\n\nSpeaker: And to me there's almost like a ownership in that.\n\nThere's like attribution,\n\nSpeaker 2: right?\n\nSpeaker: So how do you do that for everyone, I guess, right? How do you, how do you allow people to attribute their own story,\n\nSpeaker 2: right? And have value that that's, those, those are some really, really big ideas. Really big ideas. Um,\n\nyou know, everything I've read and everything I've, I've, I've learned, uh, and I've come to, says that God very much involved people in writing his story. Um, he did not, you know, some other religions believe that, you know, somebody came and dictated exactly and the words were written. Everything I know about the Bible says that God did not do that.[00:11:00]\n\nThat God showed someone, someone something, whether it was a prophet or a king, or who, whoever was the writer, and then the person wrote what they saw in their own words. A very good example of that is, you know, the, the famous story of creation. That God created the heaven, the earth, and it was good. And then he created the animals and it was good.\n\nAnd then he created men. And it was very good, very unlikely that God was standing there and saying Very good. Most likely not. That's why Moses, this, these are Moses' words expressed to us. You know, everything was good, man was very good. God was very happy with man. The pinnacle, the crown of his creation.\n\nThose are the words of Moses. Those are not the words of God. But it's a story of God creating the world and humanity. So God, you know, the author and the owner of everything has no problem. And actually the delight in giving us, [00:12:00] uh, this, this like to become co-workers with him cot tellers of his story. So how much more, you know, should I allow my fellow human to do that if the creator allows us to do that with him?\n\nUm. That comes with a lot of responsibility. You don't wanna go and bash or ruin the story that someone gives you. And, and, you know, the, the church has a big history of those. We call these heretics. We're not very fond of these heretics. We took those stories and ruined them. Um, and, um, and, and so it should be with, you know, you telling me your story and then I'm going and twisting the story or giving it in the wrong light.\n\nSpeaker: Mm-hmm. It's a great frame. 'cause you know, one of the things I'm really interested in is if someone opens up their whole heart and tells their story and then someone goes and uses it and profits from it, or like, takes a bit of it and [00:13:00] spreads that part, but hides the other part. Mm-hmm. Um, it's almost like, um, you are devaluing that person's intelligence or experience.\n\nMm. And yeah. It's like a, yeah, something. I don't, I don't, I don't know how to solve or to work towards, but um, yeah, I feel like to be able to tell the whole story and then somehow make sure that you deliver the whole story is, is, is somewhat important. Um, and I know that like religion is one of those things that carries a lot of power and worth.\n\nAnd when those words are misconstrued, it can create some really damaging outcomes. Right. So. Yeah. It's, and it's the same with like, um, politics or like, um, yeah. Some of the stuff that happens with hate and things. I think it's, you're right. Words.\n\nSpeaker 2: Yeah.\n\nSpeaker: Getting manipulated.\n\nSpeaker 2: Yeah. I think the beauty of religion, um, [00:14:00] at least Christianity, the one that I experienced the most is that I'm, I'm fortunate enough that I can connect with the source of the story.\n\nMm. Uh, I can connect with the author, I connect with God himself. Yeah. And then, you know, double check with him. That this is true. This is, this is what happened. This is what he intended to say. Or, or, or to ask us to do like wiki. Yeah. It is like a wiki. So we're also fortunate in the 21st century that we can go back and find the, the sources to a, to a degree.\n\nYou know, you can never perfectly find the source for everything. But we're, we're fortunate today that this can happen. You know, we're not living two, a hundred, 500 years ago. We know just because someone traveled, they can tell whatever they want, 'cause. How we're gonna go check something that happened, you know?\n\nYeah. 50 miles away.\n\nSpeaker: Go to the next town.\n\nSpeaker 2: Yeah. Different story. But today that's not the case anymore. So we're very fortunate that's the case. Uh, I think also puts an onus on each one of us to, when we read something, when we hear something, especially if it touches us. If it angers me, if it excites me, I should go and check.\n\nI should dig a little deeper [00:15:00] and, you know, seeing a source behind the story should gives me more confidence versus seeing something that, you know, is a. I don't know. 15 second TikTok. Yeah. And then I don't know what to make of that.\n\nSpeaker: Uh, I think we, this bloke might have ended our storytelling. The motorbike\n\nSpeaker 2: don't\n\nSpeaker: go perfect.\n\nNo, it's perfect timing. That's awesome, man. Thank you. Thanks man. Thank you so much.",
  "themes": [],
  "themeIds": [
    "recA7KrEd6ZZ6NwXT",
    "rec8pynVha5ZPl4aY",
    "recM51tZEZyIjk7VK",
    "recnjSBY1R0JxKIho"
  ],
  "shifts": [
    "rechTpnJ3jSEKsyh3"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "recMKAGHH22H4iC9O",
    "recpJmxRzRqgWoqD2",
    "reczWuNVZSmbQuN49"
  ],
  "storyCount": 3
}