{
  "id": "recvRzljrWF1KoByC",
  "name": "Melissa Legg",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Kalgoorlie",
  "videoDraftLink": null,
  "summary": "Melissa talks about her journey of volunteering at a community center after a suicide attempt, forming connections with the homeless community and the importance of support and non-judgment. She highlights the impact of services like showers and laundry facilities on people experiencing homelessness. Melissa expresses frustration at the lack of government recognition for essential services and emphasizes the importance of dignity and respect in the space. Collaboration between various organizations is key to providing comprehensive support. The transcript showcases Melissa's dedication to helping others and creating a welcoming and supportive",
  "quotes": [
    "recDz0XzpuY0DaxmI",
    "recohWLga3JPqRR0y",
    "recHkcbe7eFNWyvfc",
    "recWIhZhBHnuD8vsi",
    "recSVLIEZs8xX35me"
  ],
  "transcript": "I have a little clap here to get my sound. I always forget to do that. All right, if you just say your name and spell it, that's awesome to begin with. Melissa, M-E-L-I-S-S-A. And what's your last name? Leg, L-E-G-G. Tell us a little bit about yourself, I guess. I was looking for something to do where there's no judgment. I've got a pretty sketchy past and stuff. Actually, four months post-suicide attempt. So I came here about two months ago when I was ready to look at what I was going to do. It showed up on my Facebook feed and I know some of the people here through the community and stuff. So yeah, it sort of was a good plan for me. Just come in and volunteer a couple of days a week and it's turned into five days a week. Four days, just about. But I love it. I love it here. I love being with these guys. I love catching up with them, yarning, seeing how they're going. Helping them out where I can. Tell us a little bit about the community, maybe. I found myself, personally, to begin with, they're very closed off. Very untrusting because they've got a lot of cultural stuff. But once you spend time with them and you show that you're interested and you show that you actually care, they are very opening, welcoming. They take the time to have a yarn with me and tell me stories about growing up or their communities out bush. I've gone out and visited Ningymiah and Boulder Camp and just being a part of their stories. And now I get along really well with them. I love these guys. I love seeing them down the street. I love seeing them down the street. And saying hello. And I've got a 16-year-old daughter and she's come down here a couple of times and like, oh, we see her around. We'll keep an eye on her and make sure she's right. You know, she's 16. She's running around town with her friends and her boyfriend. And they always keep an eye, oh, I seen your daughter the other day and she was so happy and she said hello. And, you know, it's those kind of things that mean the world to some of these people because a lot of them are far away from their families. Like, they've got a little bit of family here but not much. And I like to count them as my family too. So, that's one thing that I love about this onshore. That's just so awesome. Tell us a little bit about, like, this vehicle that you're watching right now. It is. We'd be lost without it. Because, as you say, in the section I work in like we do store a little bit, but some of these guys, they're homeless. They have a blanket and a pillow and sleep in the dirt or in a sleeping bag. So, for them to be able to come here, and like, we do get donations. like I spend my time trying to stretch them out but they've been able to bring their own clothes here have them washed dried and then when they come back the next day they're ready for them to have a shower and so they're not always looking for stuff that I don't always have so I don't always have track pants or jumpers and so this makes a huge difference especially in this weather of them being able to have their jumpers and pants washed and be able to use them again The idea of our own sky I suppose is birthed from almost like an urban environment people experience homelessness and that idea of connection. How does that sort of translate to somewhere like gradually I guess? Well Ningamiah and Boulder Camp they are pretty much they've got a couple of houses with no windows or like shelters or tents and so they are effectively homeless and it just yeah like then it brings everybody here and it makes it feel a bit more of a home I had a friend come here the other day just to check the place out and she goes it feels more like a home because they can come here they can have a shower they can get their clothes washed they can have a feed they can we try and help them with everything that we can and just this truck and the fact that the Phillip can go out to Ningamiah and Boulder Camp and do stuff for people that don't come in here it makes a huge difference you know like when you're homeless I've been homeless myself and when you're homeless just having a clean set of clothes and a nice little bit of clothes makes a difference and we don't always have money so like even I struggle when I was homeless to find the money to be able to do my washing and I was in Perth at the time so I was trying to find laundromats and stuff like it's just one less thing that you can take off your plate when you're homeless because you've got so many other things to worry about How does collaboration work in community in this type of space? What does that look like? It's just all the organisations coming together. So like you said Orange Sky, we've got the One Voice Shower Truck, we've got Bega that comes here which is a health service. Centacare will pop in here every now and again. We have Centrelink that come and visit here. So that makes a difference. I've been to the Centrelink office and you can be sitting there for three hours. But we have a lady that comes in here for two to three hours a week. So they're able to deal with their Centrelink stuff and a lot of them don't understand. So we're able to help with that. We have some of the schools come in and do our cooked lunch. We have the short back and sidewalks homeless hairdressers come in now once a month. They've just started. So it's just all those little things that make a difference to the people that don't have access to this. So what's the... Do you have kind of like hopes I guess with the community over the next little while? Are there things you'd like to see change or things that you can change? More access to money that I know is available for these sorts of things. So I know that because this is run by a church, it's not classified as an essential service by the government. So we don't get government funding. Tracey? Yeah, Tracey has to spend time looking for grant money and donations and all that sort of thing to be able to keep our doors open. And I guess that's probably my biggest thing is that I'm so frustrated with the government that they are not recognising this as an essential service when it is. Like there's so many people that come here and use this service five days a week that we're open. You've got your regulars, you've got your ones that come in, you've got your ones that come back from hospital and they're waiting for the next bus ride to go back home. There's all those sorts of things and I just wish it was recognised more as it being important because it is. Yeah. Mariska, you use this terminology friends for people experiencing homelessness in terms of wanting to work out terminology that better supports connection. What's that word friends mean to you professionally and personally? Support. Understanding. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. I guess those more than anything is just for me personally like my friends that I have they're very supportive. They're very understanding and it's the same here like everybody makes mistakes and you need to be willing to put those in the past and give people a chance and try and help them to do better. I know a lot of people coming out of prison like there's very little. No. No. No. No. No. No. very little support. There's not a lot of people that actually understand and I found that some people here find it better to be able to engage with because there's no judgment here. It's probably another big thing is no judgment. Yeah, the judgment thing is interesting, I guess, like from when I was based in Australia, the idea was dignity, non-judgmental conversations. Is that what you see here? Yes. Everyone's treated the same here. When you walk in that gate, you treat us with respect and dignity and we'll treat you the same. You know, like if you come in swearing or you're drunk or whatever, you're asked to leave. But this is a safe space. It's a family space. Like you've seen a one-year-old running around today, you know, up to however old they are. And it's got to be welcoming for everyone. And, like, I'm flat out all the time. Like pants, jumpers, towels, soap. But if I get five minutes to sit down and have a yarn and check in and see how everyone's going, that makes my day. It makes my day to bring joy to these people's lives. Just to be able to come in and have a warm feed, have a shower, get their clothes done, and be able to have some nice clothes to put on the next day or they wait around and they take them and they put their jumper back on because it's nice and warm, because it's on because it's nice and warm because it's just been dried and washed and you know that's giving people back their dignity just some clean clothes and if I can get in there and do anything else then that's and I I've been judged my whole life so the last thing I want to do is judge anyone else and I don't judge anyone by what they've done the past it's what you want from the future and if you want to go and get a job and if I can help you I'm going to help you like yeah",
  "themes": [],
  "themeIds": [
    "recQ9E6SZXy4qNLSI",
    "rec0P98aLxUOuxFk1",
    "recdsO7c9JlvcczUJ",
    "recyJ79GBpQeib2i6",
    "recEi6T0yWnKNbSla"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}