{
  "id": "recVqFrsGkkD2Kv61",
  "name": "James Miller",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/3kBjs6WcAx4",
  "summary": "Retired teacher Russell James Miller shares anecdotes about his family, career, and hobbies in a casual conversation.",
  "quotes": [
    "recZsg4x8brk1mZtI",
    "rec4xaNQCNwLZ8Zac",
    "recLy3kN89Vpn8Qzp",
    "recTDY0pFpyMVwsWc",
    "rec7zmGi8tQ8YU8pc"
  ],
  "transcript": "# James Miller\n\n[00:00:00] \n\nYou know what they're doing over there. Yeah. All good. Gotta keep an eye on me, troops. Keep the standard up. Clap my hands. That helps me sync up my cameras here. Alright bro. Yo, look at me. How about this? Oh no. Look at you. Just your full name and spell it to start off. Your, say your full name.\n\nRussell James Miller. RU double. SELL? Yep. James, as in James and Miller. M-I-L-L-E-R. What's the little James Miller story in a few minutes? James. James. My I've got a son who's I call Dylan, James Miller. Oh, Dylan. James Miller. Yeah. But James, I dunno where James come but Russell is my mother's.\n\nMother's. My grandmother's Christian name. Oh, sorry. Surname. [00:01:00] Awesome. Yeah, so she was a Russell. Russell and they chose Russell as the first name. But James, I dunno where James came from. Dunno. Tell us a little about yourself. What's the little yarn that you like? I'm an old geezer now.\n\nI've been retired for a few years. I was a teacher for 40 years, did teaching for 40 years. I was married for 36, but I'm not anymore. And live by myself. But my son has just moved back from Queensland. He worked up there for 10 years and he's come back and he's, she lives in a. Flat himself got a house he rents, but nearby.\n\nSo we see a lot of each other, which is nice. We're very close. But I love my fishing and I've got some good mates and we go away fishing regularly and that's one of my great interests. And I've got a big garden, which is good. I like romo and veg and organic veg and things like that yeah.\n\nBut yeah, that's my story in a nutshell. How does that link to Iron Sky, your story? I came back from Queensland. When I retired, I [00:02:00] bought, I had a house in c Cremorne. We, my wife and I, ex-wife and I bought a unit up in Redcliffe and we just having a winter up there, summer down here. It was perfect, ideal for few years.\n\nThat didn't work. When I came back, my mate, Greg Cook he was work, just started working with Orange Sky and said, look. I was at a loose end. He said, why don't you join us? And it was great. And it was one of the best things I ever did in a way, because when I just thought my life had come to an end.\n\nBut when I came and worked with Orange Sky to here, I've always come here and see how other people's lives have panned out. I suddenly started realizing, my life's not so bad after all, putting it into context. Yeah. And it's been a while. What keeps you coming back to this nine years?\n\nIt's been now and looking at next year will be the 10th year. I know that the people really love having us come here and they, and a lot of people have said they've made, you've made such a big [00:03:00] difference to me over the years and I think, I just feel it's great to be giving back to some people, and I love the situation where we can do a clean wash for people and have a good yarn to them.\n\nAnd we've made some good friends over the years. I. And I love it. I wouldn't give it up at the moment, so that's why I'm keeping on coming. That's cool. Yeah. It's some good people. What's like the, is there any effects on you, do you think, that other people wouldn't consider in terms of volunteering and why you do it?\n\nAre there certain things that have changed within yourself over the time that you've noticed or what's that? Oh I've always been pretty tolerant. Of people's differences. I think everyone's entitled of their own opinion and things. And look, when I come to these shifts, it's all about having fun and having a laugh.\n\nAnd I think it's good when people in the house hear us laughing and having a good time that brings them down, they love that sort of thing. I dunno really what to say in that respect. I just, I'll keep coming back because I [00:04:00] enjoy every session we do here. It's great. I like meeting the new volunteers.\n\nNo new. We've been the same shifts now for so many years. We're not looking for anyone else. And what's your, is there a vision or a mission or thing that you're working towards? Or is it just about turning up every day? What's the, I think consistency to be consistent and be reliable.\n\nAnd always, the van's kept here, it's parked here, and other shifts come and take it away to be used, but it's parked here. And I just, I want to keep coming because they rely on seeing, I think it's important for these people to see that we are consistent. They've not had consistent in their lives. People have let them down.\n\nSo society's let 'em down in lots of ways. So I think coming here to do that I'm not gonna give it up because of that. I think they we owe 'em that, yeah. What's like a general thing that you think the general public get wrong about people who are struggling with disadvantage? Oh, that's a good point.\n\nYeah. [00:05:00] Often people say, they're not, they're everyone who lives in this place or comes to stay in this place have a story behind them and there's a reason why they live here. No one would actually choose to be here. So there's always something that's. That's led or them to them being here. And I don't think a lot of people that don't ever see people like that or talk to people like that live here, to our friends that live here, they don't understand the sort of people that we're dealing with.\n\nThey've had very little choices in their lives, so I think, that's the problem. People don't give them a chance. They don't want to talk to them. They see some of these people walking down the street. They wouldn't want to know them, but in actual fact, they're good people. We're all good people, basically.\n\nHumans are good people. I think there is a difference between, it broken down a lot of things for me. Having seen, met these people I always felt a bit challenged by it, but not anymore. [00:06:00] And what about Orange sky? Do you think they're doing a good job? Growing, not growing track.\n\nYeah, I think it's good. I the essence of this is excellent. I think once they started growing, they've gone through a few teething problems as far as I'm concerned. It's growing so much that it almost becomes unmanageable and you lose that small, the family oriented feel, but I think they're getting it together.\n\nIt seems to work. And there's rules we have to follow with Orange Sky. I know, but in the end. Oh, can we stop? That's I think ring tone. That's, yeah. Oh, that's terrible. Pause. Can you pause it? Yeah.\n\nThis is scratch. Robin. Hey Robin. Did you get my, I did. I'm just sitting here. I've Ben's just paused the camera 'cause I'm sitting here talking to him. We should record this actually. We should have recorded it. Yeah.[00:07:00] \n\nSorry, are you saying any, are you saying anything sensible? Am I saying anything sensible? Get after? Yes. You'll, is there anything else you require? No thank you sir. Oh, I only got it when I was traveling, ah, and then I arrived here and it's been all go since then, oh, good. Yeah. Sorry about that. So you working?\n\nThat's good. Yep. Yeah, we've got a few loads bill's back on deck here and putting a few loads through, which is good. Oh, is he okay? Yeah. Oh, he is pretty, yeah. Not that really. He is just yeah. Anyway, he's going all oh good. Yeah, and I think he's decided not to go to another place now, so I think that's pretty, pretty much his thing, probably.\n\nYeah. Yeah. Yeah. And Trevor apologized to him for knocking him out.\n\nRighto. I'll let you go. Okay. [00:08:00] Go tell your live story. See ya. Okay. See you Thursday. Okay. Bye. Bye.\n\nSorry about that. She's keeping you in track. Oh, honestly. Damn. She's about to go. Yeah. Sorry. She's about to head off. Yeah, she's off. Yeah. Uk. Oh, London. What's today? Oh yeah, on Friday. Yeah, this Friday. Yeah. Yeah. So we're almost done, but all good. One thing, I'm sorry I go on a bit. I'm not No, that's great.\n\nI'm not Great. Going on is awesome. That's alright. That's what we need. Yeah. Yeah. So orange sky, like in 10 years, what do you reckon you would hope would happen? Is it the same, is it massive? Is it overseas? Is it what's, what do you think in your own mind would be? I'd like to, I don't mind it growing.\n\nIt has grown in massively in the nine years. You can imagine how many vans there were in operation eight years ago, and how many are operating now. I worry that it [00:09:00] gets so big. That the communication between the volunteer people and the headquarters, the top there, it gets a bit too clumsy. I don't want to be having to do too many forms peop people who volunteer don't want be restricted in always having to fill out forms and be.\n\nYeah, following this and following that I think they should encourage volunteers just to be doing what they do. That's what we do best. And not the administration. I do a fair bit of the administration, but it has changed with the new Myo system, I must say it's been a little bit easier. But I, yeah, no, I think I, I'm all for it expanding and getting more of these bands out because it's great.\n\nIt's a good thing. It's not just for washing, it's not just getting people's clothes clean. It's this connection. That's fantastic. I think and not, it's a different story here at Flint House because it's an old bo it's a boarding house. [00:10:00] There are a lot of the other shifts dealing with people who are actually legitimately homeless.\n\nThey are living rough and tough. And that's another matter altogether. But I think orange sky is gonna grow for sure, but just be careful that it doesn't lose sight of. The individuality of the volunteers, they've gotta be kept in touch with just in as humans, that's perfect.\n\nYeah.\n",
  "themes": [],
  "themeIds": [
    "recppECVpakJJxfa4",
    "rec6Dm8yukeABo8UN",
    "recjgRq5yTsuZ2hQe",
    "recuHuMrCyn2tOg7T"
  ],
  "shifts": [
    "recyMRTWqgsYHr8VP"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}