{
  "id": "recVw4RKDJ18CTfl5",
  "name": "Kisha Neville",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Mount Isa",
  "videoDraftLink": null,
  "summary": "Keisha Neville, an Aboriginal health worker practitioner for Healthy Skin in Mount Isa, discusses her work in combating rheumatic heart disease caused by skin infections in Aboriginal and Torres Strait Islander communities. She emphasizes the importance of community outreach, education, prevention, and collaboration with services like Orange Sky to promote general health and hygiene to prevent the spread of infections leading to rheumatic heart disease. Keisha highlights the significance of building trust and rapport with clients to empower them in their healthcare decisions, advocating for culturally safe",
  "quotes": [
    "recn4wdm0slzs53vn",
    "recns7WLiyEYvy2HP",
    "recsrWUOT8jDszz7b"
  ],
  "transcript": "Alright, you looking at me? See if this looks rad? Look at my hand. Look at my hand here. Are you looking at it? Yeah, I'm looking at your hand. I don't know why. Okay. Can I be up for a duck a little bit? Because I'm only short. Are you looking at me? Yep. What about... Oh, you got that there. No, it's good, it's good. Come across a little bit, behind a bit. Stop. Back a little bit. Stop. Alright. Alright. Alright. Just tell me your name. And your role and where you work. To kick us off. Alright, so my name's Keisha Neville. I'm an Aboriginal health worker practitioner for Healthy Skin. Um... So I work and live in Mount Isa at the moment. Been here for three months. Worked for the Mount Isa Hospital and Health Service. Um... Yeah, so come here on a secondment from up Cape York. In Weipa. And yeah, so... Come up here to try a different experience in a new program called Healthy Skin Project. Um, it links in with rheumatic heart disease. Um...yeah. Cool. Tell us a little bit about rheumatic heart disease and your perception of what it is in the community. Okay. Oh, well this... So rheumatic heart disease is a disease that's been caused a lot of the time from skin infections. Um... Uh, scabies and those infections lead to a strep-ache infection, which causes the valves to leak. And when they have leaky...leaky valves, that's when they have rheumatic fever and rheumatic heart disease. Cool. Tell us a little bit about Mount Isa and like the surrounding community. What's your perception of it? And like, are there like things that increase people's levels of risk, I guess, in their lifestyle and their social stuff? Oh, gee. You don't ask easy questions. Um... So... Um...so yeah. Mount Isa has a large population of Aboriginal and or Torres Strait Islander people. Um...and... Yeah, so the social determinants, I suppose, in health are some of the causes of some of the um...house disparities in... amongst Aboriginal and Torres Strait Islander people. So... things like social housing, um... access to healthcare. Sometimes there's stigma there and barriers because of things that happen in their life and stuff through their family going to hospital. So that's where Aboriginal and Torres Strait Islander health workers and health practitioners and liaisons come into place so they can advocate for the rights and needs of patients. Um... providing cultural support and education and prevention and promotion for clients. Um...also we break down the health literacy for the clients to understand, um... what is being said to them from doctors and nurses to help in prevention and promotion and helping them with their healthcare. Yeah, cool. What's it looking for? What does it feel like, I guess, being out in community and talking to people about it? Like, are they open to it? Is it tough? What's that feeling like for you? Yeah, so... I find working in community is is easy...is a lot better than in a hospital setting. Um...you have... they have the comforts of their home. Um...also you're not just looking at that one person, you're looking at them holistically and also um...their whole family and and stuff like that. Um...because when it comes to some of the infections that we look after, they're very highly contagious and those contagious infections, so they spread like wildfire through, you know, families and stuff like that. So then it's up to us to go in the home, provide that education and that prevention and um...help them with maintaining it to prevent them from getting, like I said, the strep infection causing the rheumatic heart disease or rheumatic fever. What's those um...why's it important to have um... like general health and wellbeing and sanitation and clean clothes and things in relation to rheumatic heart disease? Like why are those things important to people? So those things are important because they keep the germs away and they keep those infections away but also um...sort of explaining that to patients and...oh, Clive, I'm sorry, to clients and stuff like that. They um...sometimes they might have large families and they need help. So yeah, with that we can sort of help them as well. Like we supply some um...laundry powders and disinfectants and stuff but also in linking in with Orange Sky we um...got them to go around to clients' homes and some of the other places that they access in community, so such as Centre Care, they're parked up there and Yolambi and um...Serenity House, they were parked up there and we let the clients know there was free access to washing of clothes and linen and stuff because that helps with the prevention of scabies and those sort of things to prevent them from getting, you know, acute rheumatic fever and rheumatic heart disease. Yeah, and you were talking about Orange Sky before you saw them in different places. What do you think overall of Orange Sky, what they do and what's important to the community? So, what I know they were only here for a week and it was a bit of a trial sort of thing like that but um...it was great. They had a successful like turnout and stuff and not only that, they were very friendly and the patients were very content with them and they didn't feel you know, that it was um... there was no stigma with it so which is a main thing one thing we need to make sure that they feel comfortable and you know, everything is culturally appropriate for them and stuff and we worked in with them as well so it was good. Um, they made a the Orange Sky also made a lot of referrals for us for people that had some skin issues and also um... they talked with the clients and found out they were rheumatic heart patients as well and referred them on in case they needed some follow up or check up with that, with the RHD team as well. So yeah. Why do you reckon it's important to have like good interactive skills in community and like be able to be someone that people trust when you're offering these services? Well if you don't have trust you don't have the people and you've got to build that trust as well so you've got to build a rapport, it doesn't just happen like overnight and if they see familiar faces like the Aboriginal health worker or health practitioner out in the community with these uh...other services where they link in and in a collaborative sort of service, it makes people feel welcome and they know that they're safe because they know that other person and then we introduce them and stuff and start building those relationships as well so that they're comfortable and yeah. What do you think the end result is when people are collaborating really well and like politics out and things are built around the client like is that possible do you think and what sort of what does that look like? Well I think it comes to how people like clients and stuff like that they're not going to interact if they don't have a say in their healthcare and it's we should be basing healthcare around the client not us around them like it should be their choice those sort of things and um we help them to empower them to have that knowledge and education and to help their own healthcare. Cool and like what sort of process do you think needs to happen to make sure that people's services collaborate properly and they're there for the right reasons are there things we can do better and how does that look to support clients better when people collaborate in a different way? Well you need to make sure that they have a culturally safe environment um you know like they're comfortable that they have an understanding of what it is that you what it is that you're there for like to provide what sort of care make sure they understand um use open ended questions so um you know so they can elaborate on you know ask them so that they can interpret it back to you so you then know that they do have an understanding cause some people just think cause they can talk and someone nods their head that they understand but not only that that's where health workers and aboriginal and terrestrial health workers and health practitioners and liaisons come into place as well so they can they can read you know a person or and say hey they don't look comfortable and that's where we advocate and stand up for their rights and needs as well Cool is there anything else I missed do you reckon anything you want to say you want to blow about something or get that on camera people that grind I'm a I'm a so I come from um up in the western cape and I worked alongside as a health like as a health practitioner um with chronic kidney disease up there so I I came to this project to learn a lot about um APSGN which is a post strip um infection that attacks the kidneys so with rheumatic heart disease um clients and rheumatic I keep my rheumatic fever they can get bycelin to help them um to prevent further damage to their um heart but when it comes to the kidneys if they've had that um strip infection when they're a child there's you know a great like a really big great chance that those kids will end up on dialysis by the time they're 40 years of age so um I wanted to see how it works with the skin project and those sort of things to help educate prevent and promote healthy skin um to prevent kidney disease as well so yeah Brad that's the main reason why I come",
  "themes": [],
  "themeIds": [
    "recpWAZwCjfNN9Y3U",
    "rec32jDg5lYQ889Fm",
    "recTLaaxo9xS3LxmD",
    "recMSuQJcrWgR4z8E",
    "recY8Q8Vrp7Z5RlFR"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}