{
  "id": "recwG73tL99YNujEV",
  "name": "Felicity Davis-Smith",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Hobart",
  "videoDraftLink": "https://share.descript.com/view/OcWOD5gBpJB",
  "summary": "Felicity Davis-Smith, a binary transgender woman, talks about her experience with gender identity and growing up in rough neighborhoods. She goes by \"Flick\" and shares her laid-back approach to gender pronouns.",
  "quotes": [
    "recUtcl0RyhTl1q8Z",
    "recs2jHO82xPikrO8",
    "recztm4HBvuxWVi4z",
    "rectgmKjgFjts25Gn",
    "recHS0x34umcxr54i"
  ],
  "transcript": "# Felicity Davis-Smith\n\n[00:00:00] \n\nBe as small as what I'm, yeah. Which are very typically masculine traits. And for someone who's binary trans, like I am, like as in trans woman, don't identify in between or anything like that. All good with people that do, but it's a bit off putting that you've gotta carry the voice and there's yeah. Yeah, I can. Yeah. So cool. So I'm just gonna clap my hands. Yep. Sync my sound. Okay. And all you gotta do is tell me your full name and Yep. This is not there. This is just me. Yeah. Cool. So you just tell your full name and spell it just so I've got it on the video. Yeah, sure. So my name is Felicity Davis Smith.\n\nAnd the spelling is F-E-L-I-C-I-T-Y. D-A-V-I-S hyphen S-M-I-T-H. Cool. Yeah. And so my first question is usually how do you like to identify yourself? Talk about yourself, introduce yourself. You [00:01:00] can take whatever. So I go by flick. I'm she, her. But I'm not real. I'm not a prissy princess about it, buddy.\n\nI basically get there and if someone's bro, oh man. I'm like, okay, whatever. I, I played that male character for 30 damn years, so it's took been a long time to go you started in the hood and you're just gonna go and do it anyway. And if any of them give you a hard time, you'd be like, all right, let's go outside and settle this old school.\n\nYou wanna play like that? I grew up in the same place as you buddy. But no, in all seriousness, like I, I did, I, I grew up in a real rough place, all the worst neighborhoods on the Northwest more specifically around Devonport. Yeah I'd lived in a mall and I.\n\nJust like in many of the other households there, there was a lot of conflict and it, low income, it always causes issues, but it's no excuse for what happened. Basically to my mom, myself [00:02:00] and my sister. So my sister Amy, she's what is it? Five, no, six and a half years older than me.\n\nMom meets this guy George. When I'm two and a half, he starts beating her up, right? Just starts beating the shit out of her. And, he starts getting intimidating with us kids. But so after a week or two, I literally stood in front of my mom as a two and a half year old. And I'm not gonna remember this because I've got identical memory, dude.\n\nSo I stood in front of her and I said, leave my mom alone. And so what happened was he's got there and he's punched me in the face and I went up against the wall mate and that was the day I was like, shit, life's real. You know what I mean? And like during that period, I also had to deal with a cousin that sexually assaulted me, right?\n\nAnd both those things played a huge role in me re oppressing who I knew I was like, before those things started, like from about two three, I knew. That I felt [00:03:00] different to the way that I, was perceived by everyone else in society. I thought things like, why can't I wear dresses? Why can't I play with the dolls?\n\nAll that sort of stuff. I'm like, why can't I do these things? And then I realized very quickly if I did do these things that, where I was brought up I would get harassed, bullied, et cetera. And even at that age, I knew not to be honest about that and essentially be like a version of myself.\n\nSo I was authentic, but not in the way that I expressed myself. I was reserved at times, even though I've got both autism and A DHD and I'm very outgoing. There were just a few things where I would just never speak about it. It never popped outta my head. And it was because I had a lot of shame around because it, at the time, this is the the nineties and the like, the two thousands to 2010.\n\nDuring that time, trans people weren't accepted. Even in those years, [00:04:00] gay bashing still happened. Like it was crazy, and it's changed so much in the last 10 to 15 years, like when it comes to acceptance, with the exception of this crazy stuff that's gone on over in the US at the moment, which is having a spillover effect.\n\nTo and proof in the footing there is as and we'll discuss in a minute, I'm currently homeless. I put a post up on Facebook to look for a house, right? And when I went to look for a house I mentioned in the post that myself and, or I should say my partner and I are both trans. So I am transfeminine.\n\nI was born with mostly male charact. Jurisdictions. Although I'm intersex, I've got chromosomes of xb, meaning I don't produce enough testosterone. Something I found out just before I started transitioning. So basically my partner or my fiance, he's was born female and he is transitioning to [00:05:00] male.\n\nAnd so like we just get each other and we've both got autism and a DH. Both dealt with try and we just gel. We just, we just get each other. So anyway, I put this post up because where, wherever we're living, like whether it's a landlord or whether we're in a share house, whoever we're living with or living in their house, they must be able to accept like the situation.\n\nBecause if that isn't the case, it becomes unsafe for us. And I don't worry so much about me because I'm. Very tough. Okay, let's go with that. And I can protect myself, but he is very naive. And if he was to grow up like where I did, I don't know if he would've survived, to be honest. And I just wanna protect him.\n\nEven though typically it's, the masculine role to be the protector, I still see myself that way, and. They, all these people on this post, they just responded. Didn't give a shit about, helping [00:06:00] people that were like escaping DV from ex-partners. They didn't care about that.\n\nAnd all they cared about was the fact that we were trans and. They just gave us the hardest of times and said all these horrible things just because we're trans dude and we're not harming anyone. Like we're two trans people that are together. Like we're not a trans person. That's with someone who's born cisgendered, meaning, they were born, the gender they identify with, and it actually relates back to a Greek term that means the same side as meaning. Okay, so you identify the way that you were born. You know what I mean? Yeah. So like a lot of people get pissed about the term cisgender, but it's no, we're not trying to call you a sissy dude.\n\nIt's. It's actually got a basis in language and there's a history there and what's that you brought it up a second ago. That experience of homelessness for you? Because it's different. Yeah. That's the new thing for me, and the biggest concern that I had to start off with when I realized that I had to [00:07:00] essentially either live in a shelter or jump into a tent, is that if I went into a shelter, then I'm gonna be interacting with personalities.\n\nAnd I know it's gonna be very much my upbringing, right? I'm going into situation where everyone's got their own issues, they've got their mental health and all that sort of stuff. And I'm like, okay, am I gonna get into a situation where they're gonna want to hurt me? Am I gonna have to keep an eye over my shoulder?\n\nAnd. Thankfully I haven't had that. Everyone's been awesome, every, as I said, everyone does have their stuff. They've got their mental health and whatnot, but who wouldn't? We're homeless, dude. That's, that's the honest truth. But no, everyone's generally respectful and everyone has their bad days, but for the most part, we try to help each other out and.\n\nGet through this and whenever someone gets a house, we're happy for 'em. You know what I mean? It's awesome. But I originally started in the safe space in burn. So what happened was I was living in Latrobe for [00:08:00] 13 years. That was with my ex-partner. And I couldn't stay there because even though I had a family violence order against her after she stabbed me with a pair of kitchen scissors because she got violent, I even though like she wasn't allowed to come near me 'cause I got the violence order, what she did is she'd send her stepfather around and he, that, that's where she got the mentality from her stepfather. He would literally go around and rob drug dealers of their drugs. Like he would go and steal pot from the, like he was a nasty man and I had to tolerate him for 18 years of giving me shit, calling me a pussy, doing all this sort of stuff.\n\n'cause even before I come outta Strands. Like I wasn't good enough for his little girl, I wasn't strong enough. I wasn't, because even though no one knew until I told someone that I was gender vessel trans, I still had a more timid nature because I wouldn't do typically alpha male things.\n\nLike I wouldn't give the boys shit. I'd be like, oh, come on, let it go. [00:09:00] You know what I mean? Like I'd play it off like it's not a big deal, but, I wouldn't be a jerk about it and try and join in. There was like a lot of roughhousing in the neighborhoods as kids and like I wouldn't join in on that and I'd probably say, leave him alone.\n\nBut I do feel a bit guilty for not stepping in and saying something a bit more sometimes. And that's. It also directly relates to, the coming out and being comfortable with it, especially in a place like this. I'm like, okay, here we go. Let's go in. But the fact that I'm autistic is such a key asset when it comes to that.\n\nBecause a big thing with being autistic is narrative, right? So if you're in a situation that you've not dealt with before, what tends to happen is you tend to go through it in your head before you have to deal with it as best you can. And then when you get there just like a story on a screen, it plays out a bit like a script.\n\nYeah. And so like I'm going through all the [00:10:00] 10,000 scenarios in my head because I'm an A DHD as well. You add those two together and you got someone who's very specific, logical, and thinks a midling miles a second, right? And so everything's just gone. All the scenarios are gone through my head and I'm like calculating it all.\n\nAnd I'm like, okay, cool. All right. I know what we're gonna do when we're going here. We're gonna. We're going in as the doctor which doing a medical degree by the way. Yeah. Hoping to become a trans doctor. Cool. Someone who helps other people in my situation. 'cause there's not enough in Tasie. Yeah.\n\nThere just isn't. And sorry bud. You go. You sweet. Yeah. What do you think about this iron inspire thing? Is this Oh me. I couldn't believe it. I get here and I'm like, people do my washing for me. I was the total like, housewife type person even before I transitioned 'cause stayed at home as a carer for my son sort of thing.\n\nAnd so like I was always doing the house. I got here and I'm like, oh my God, someone's gonna do my washing for me. And it's such an invaluable service. 'cause you don't think of the little things that [00:11:00] you're gonna struggle with if you're homeless, at washing. And so at the moment, you, I'm okay. I need to make sure that I've got the outfits, the week sort of thing. I need to make sure I get here on, this day sort of thing or go there that day. You have to think of those things and that's why it's hard for say a homeless person to hold down a job and that sort of thing because they have to go to all these different places just to get, the essential, things they need that basic human rights I would call. Yeah.\n\nAnd what, how did you first hear it? Did you just stumble across this and what did you sorry, I actually found out about it here. But they said, oh yeah, there's someone that comes around to your washing. And they explained it to me, but then. I didn't realize, I thought they come around, picked it up, went away.\n\nI didn't realize there was, the van and the the dryers and everything. And I like when they hooked a lot, I'm like, oh, this is awesome. This makes so much more sense. Coming up with a creative solution like that for something just so [00:12:00] essential and having it, portable so they can go to different spots because, again, homeless probably not gonna have transport.\n\nSo being able to move and do this is the way to go. Yeah, for sure. And what about this idea of part of it's watching and part of it's conversation, having a yarn with volunteers and Oh yeah. I'm all on board with that. Like everyone's great. And even just being able to go and say, Hey, look.\n\nI'll give you an example. I had, I've got this awesome pair of rainbow shoes, dude. They're massive. Everyone's oh yeah. I'm like, yeah, if anyone gives me a hard time, I'm gonna put the rainbow up their house. But anyway I'd wore 'em without socks, which I tend to do 'cause I always lose my socks, right?\n\nNo reason. And so anyway I come out and ask 'em if they can wash 'em for me, and I had to wash 'em a few times to get like the, the dirty or smelly feet smell. Out of them. And I'm like, it's awesome. They just wanted the effort to do that. They're not getting paid by me. Obviously it's funding from somewhere.\n\nBut it was just awesome that, and I love it because I used to run a computer [00:13:00] business that was low cost for pensioners and putting in the effort even though the big bucks aren't there. That's awesome. That's just so awesome. What do you, what's your sort of concept of. Impact of this service.\n\nThese, they're all around the country. They do washing. It's a little bit of, yeah. Just quick question. Do they do any other services? I wasn't, I'm not sure. I know they do the washings showers. Showers and then which they start again. Is there one here for showers or I don't think so.\n\nOnly reason I was asking is because, i'm normally onto it down at the safe space night facility, but I missed it this morning. I got there and I'm looking at 10 past seven. I was meant to be in at seven and I'm like, oh no. Sharon Mother's Day. That's brutal. It's already a terrible day for all of us.\n\nSo no if showers washers and then they flex after going into remote communities and having, okay. Yeah, no, that's awesome. I've got indigenous heritage, so it's cool to hear that. 'cause like especially out on some of the the like in the nt [00:14:00] Yeah. Some of the more rural places, they're essentially Yeah.\n\nThey need that sort of stuff. 'cause they might not have Yeah. Good running water. They might have running water, but it might not, and do you think the impact is more around the washing or. People talk about that idea of connection and conversation. Yeah. Yeah. It's awesome having someone have a chat.\n\nJust before we started there, I was over there having a chat with one of the ladies and just, as I do start talking and don't stop told her in my story and then obviously you've come over and to have a chat and that yeah. Yeah. No, it's awesome to be able to do that because.\n\nEspecially at the moment, bud, like I had to leave the northwest for my safety. So I don't, I, I know a few people down here. I've got a few friends. But yeah, you need to be able to have those charts, especially when you're going through a time that's probably not the greatest in your life. Yeah. 'cause no one, obviously wants to be homeless.\n\nI don't believe. You've got the odd ones who struggle to, to get out of it. And I'm really hoping that I don't have an issue obtaining housing. I [00:15:00] know that I'm gonna be motivated to do i'm only I've probably been living rough for about a month. Essentially what happened was I had to leave Latrobe for my safety.\n\nI couldn't stay with my current partner because he lives in like an independent living. Thing where they've got like onsite support and they've got a thing in the lease where you can't have a second person reside. And they were issuing like him with an eviction notice and all this, and I'm like, I can't make someone else homeless.\n\nSo I'm like, no, rather than do that, let me go do something more productive. Let me go to the safe space in Hobart and find us a house, where it's safe and away from the problem. So yeah, that's how I ended up here. That's cool. I could talk all day. I know buddy. I know. And hey mate, I can talk to you under there.\n\nTalk. I've gotta talk with one of them. Yeah, sure. People as well. Yeah. I'll just take a quick photo. Yeah, of course bud. Just stay right there for me.\n",
  "themes": [],
  "themeIds": [
    "recuhho7gHTDCX4j6",
    "recut99FNBQhi0q7z",
    "recNl0Ii61ic8bnuP",
    "recxRMouzJDEvQ9WY"
  ],
  "shifts": [
    "recndj288JQOS3Zv3"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "recepr1rxw702zdsz"
  ],
  "storyCount": 1
}