{
  "id": "recwJsXOJYk6DzGVY",
  "name": "Phil Barton",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Kalgoorlie",
  "videoDraftLink": null,
  "summary": "Phillip, a humble worker with Orange Sky in Kalgoorlie, is a vital part of the community through his laundry service. He starts his day early, providing clean clothes and dignity to those in need. Despite his quiet demeanor, Phillip's impact is profound, creating a sense of connection and support in the community. His work goes beyond laundry, offering a place for people to gather and feel a sense of humanity. Through his consistent presence and dedication, Phillip has become a trusted figure, helping",
  "quotes": [
    "recYk7vFtYJ8ucjZh",
    "recDb14jKn5n3v3Ph",
    "recypooqAu6Q6mizb",
    "recfp33YzIrqCZAOr",
    "rec0YAzghDO2stbfU",
    "recLysiVYlZOlVGjQ",
    "recbmNDOx7g5diTiP",
    "recOpiGteoRTijykB",
    "reczefNG7eeg8rMcy",
    "recxKYPZpC8VmwyUB",
    "recdd1jp02HgmCb0m"
  ],
  "transcript": "Keep telling me what's going on here. How was today? Was today busier than other days? No, about normal. What's normal? Normal, busy. Busy, yeah, 30 plus loads and that. Wow. Tell us a bit about those machines. Do they go alright? How do they go? Do they work all good all the time? Yeah, they fixed the water system up so yeah, it's been good, just straight through, yeah. How are the people that come here to get their washing done? Are they alright? Yep. Is there a bit of too much trouble? No. It goes alright? No, it goes alright. They want to get their clothes washed. Yeah. How long have you been doing this for? Well, since July last year. And what's it feel like to you to do it? No. Normal. I don't know. Just everyday work. Yeah. It's, from what I could see, you were just going at it the whole time. Like you didn't stop coming. Yeah, true. That's what I mainly asked you if I'd feed all that, you know. They'd just come out. But Kive already grabbed it, you know, a little black Eagle Man, yeah. So that's alright. And what community are you from? Are you from this one? No, Nudgew down the road, Norseman. And how far is that? About 100 something Ks down the road. And do you live there? No, no, I used to live there when I was growing up. What's it like, I suppose, being away from community? Do you get to go back there much? I have been down again, yeah. What do you do there? Town, Norseman town. It's a town, Norseman. I used to work on the mines up there, but then, yeah, come up this way and then went. Kimberley's worked up there for four and a half years. Life without barriers. Yeah, good company. What made you pick this up? Like how did you find RS Guy and what made you come and start working here? Mateo's working around there, but Stewie does. But he is working there, so I was going to go. NDIS, I was going to work for them. Yeah, but Stewie, yeah. He came to be pastor, so I've this church here. Yeah, so I looked for another person, so they put me on. Can you give us a tour of this thing? What's the deal with it? What happens? Nothing, just wash, dry, wash, dry and dry. How do you set it up? Yeah, put all the hoses, nah. Just get two hoses there, put it out. Just get the extensions out. And then the cord for the power goes there and just the hose, that's all. For the water tap, as long as you've got the water tap, it's got that hose there. And how many, sorry, how many loads do you do? Nah, right here, I think about 30. Yep, 30 at the moment. What's your average day look like in terms of how many washes? 34. They'll usually have it all here waiting for me, so. Yeah, I just start here about sometimes 6 o'clock in the morning, just come and just smash it out. What other services are here? What other stuff happens here? Which other? What other services are here? Like what other stuff can people access at this spot here? Right here, the truck and the, oh, Begum have come down for food and that patrol truck, they organise feed too. Yeah. They organise feed too, like every, some day do it every Tuesday, like Begum today, they'll probably do it next week and then, yeah. They all take turns and cook Tuesdays. And Jack of Tobacco, my babies come down on Mondays too, just to, yeah, cook up. Yeah, so. And what time do you reckon you're going to be able to pull up? Haha, all depends, yeah. All depends. All depends. So, leave some, leave some, I'll leave Tracey's dry couple, but the other community out there, I'll just take it out to them. I'll just take it out to them and I'll just chuck it on dry out there.\nDay 2 transcript\nMate, can't get you to sit down, eh? Why, why? I'm interested about this joint. Like, when I went for a walk, there was like lots of rubbish everywhere. How do you think it gets distributed so widely around here? Like, the wind, or like... Well, I don't know. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . all these stuff and move this. Ah, Mandra. Because you've got a daughter up there. Yeah. It's massive now. It's a big prison. Yeah. That worked as an activity officer. Oh, really? Mm. What's it like out there? It's all right. Yeah? Yeah, but it's small compared to now. Mm. Gotcha. Mm. I do a lot of work in prisons, isn't it? Right. Especially you. Mm. Mm. Now you. Perfect. Yeah. Mm. And the old blokes keep going back there. Mm. Mm. Mm. Yeah. The whole prison officer's like, stay away. He does something. Mm. Mm. And they put you in a wheelchair, so go up and down. Like, you know. Mm. Those cowers have to go up there. I didn't think they did, they didn't mind going back, they got a pair of shoes, pair of gongs, a new pair of like pants. Yeah. Especially in winter time, you just might go back. Yeah. Yeah. Because it's cold outside, so. Oh. Scripture though. It cost a government. Would t they go up and down? Because the government's so much money for them to do. They've been in youth detention. It's about a million dollars for each young person in the first three years. It's crazy. It must be weird having a young father in prison. Is it weird or is it fine? How do you deal with that? We've got to learn to get out, get his mind set. I keep telling him, he's a good chef, you know. Get a job. You're doing a course, at the moment you finish it off. So when you get out, as I said, go and get a job. Chef job. They look around. So you're married or what? Divorced. Divorced? All the kids from one lady? Yeah. Mandra. You can teach him some lessons about that too. Make sure he doesn't learn from me. He'll get tired. No. No. Half-back. You know, two boys, the oldest is in a wheelchair, and the youngest wheelchair too. Oh, really? In between, yeah. What happened? They said it was Troy syndrome. With muscular sore on the muscles. Oh, okay. Hmm. Do they care? Or do they look after themselves? Well, the mother look after them, yeah. Oh, okay. There's a lot of that stuff around here, right? Like different health stuff. Yeah. What's your plans then? To keep your own art style and hang it out? Or you got other plans to do other stuff? I think I'll do it at the end of the year. And think about telling kids, oh, if you look at this other person, I know the whole might just, you know, take off. Yeah. Yeah. Because usually we have two weeks holiday. Bega gives us two weeks holiday. Oh, okay. Two weeks here. And we just take four weeks to keep going. Do you only get two weeks a year? Or what do you get? No, we get all leisure days and all that during the day. Two weeks. Good pay at the end of Christmas time. Christmas time. That's good, eh? Yeah. I think that's the only company that does it. At the moment. Usually people like to take holidays. Nah, they just give you, they say, you've got two weeks off. And people always take another two, you know. So they have four weeks off. So Bega must be a big company, eh? Yeah. What's their main stuff? Is it everything? Everything? Yeah, everything. They've got all the Ningila, virtual training, you know, train people up. NDIS. Boys out and about, you know. Tobacco mob there. Yeah. What's tobacco? They kind of just do like... Primate, all that. Tobacco stuff, yeah. Do they have any sexual stuff? I don't know. I don't know. They used to have this condom man in that house. Oh yeah, seen that bloke. Oh yeah? Yeah, on that TV and all that. Yeah, yeah, yeah. Very from Queensland. Yeah, that guy. Yeah, it was a Queensland thing, yeah. Yeah, I was up in Antalya for years. I was through building a new building. Yeah. I wouldn't mind going to Tamworth and have a look. Oh yeah? I wouldn't mind going there, yeah. Country music? Nah, not country. I just love the country atmosphere, you know, when you're going out and about. Yeah. I'm a cult too, about me. Really? I play there every time. Kids grow up on it. Even the grannies, they all know that my music. I saw Jimmy Barnes at the Red Dust Festival. Oh, right. Have you heard of that? They do this big run into the centre of Australia. Do you know Birdsville? No, I haven't heard of it. It's a tiny town, but they have the really famous horse races there. Birdsville races. And it's like, it's kind of like, where is it? You know where Mount Isa is? Yeah. It's about 200km from Mount Isa. But yeah, Jimmy Barnes, they've got this big sand gym, and then they have this big music festival in front of it. And Jimmy Barnes was the headliner of that. Yeah. I like old general as well. But I'm from, do you know Musselbrook? It's near Tamworth. Which is a little town called Musselbrook. It's a coal mining town actually. That's where I'm from. Yeah. And then I went to university in Arbor Valley. Yeah. Machine gun. Which is pretty neat in Tamworth. Yeah. Uh. We used to play football against each other. This road, is to over there. That's um, Maria. On the show. Oh yeah, that's her. Yeah. This one there, I've got to put it in a bag for you. Put it in a bag. Yeah. Family. What's culture mean to you? How do you connect with it? What's it about? I only got involved with it because the mission days, you got stuck in a mission. Stolen generation. Yeah. Yeah. Do you think about that stuff a lot? Or is it just there? Or is it just there? Do you think about that stuff a lot? Or is it just there? Yeah, all the family talk about it and all that. Yeah. But it's been demolished in Northman through the old people years ago. Yeah, so. There's a long way from this way here, they still go past that way. Hmm. And you have a big family around here? Hmm. I'm a mother's side and my father's side. You can grow that by day or do you? South Australia. How was it? Maralinga. It's all family was there. They pushed away with a bomb blast, you know, testing nuclear bombs. Yeah. Did you have a lot of family that got sick from that stuff? Wow. Have a lot of family that got sick from all that? Yeah. Yeah, from that side, yeah. They just blast without checking if any people was living there. Oh no. Yeah. Taking all that things still there, all that buildings and all that. Yeah. Hmm. How did you first hear about this iron squad thing then? Someone. I don't know if Judas came over. Someone came over to talk about it. Hmm. I don't know if it was Judas or what. I was working for maintenance at the moment then. Big maintenance, yeah. Oh. Why did you, did you apply or was it pros or was it starting? No. They just asked me if I wanted to do it. Because it was moving. Hmm. Yeah, everybody knew I was going to go NDS. Right. Hmm. And how long has it been since you started? Like, you've been a year now. Yeah, full on. What do you reckon? You're still here. Yeah. Hmm. What do you reckon? What do you like about it? Oh. I suppose seeing all the family of it, I suppose. The majority of them. Yeah. We've made those, I hardly see any, but I just go around in a little circle, you know. Yeah, each building. Yeah, so. It's funny, like, in Western sort of thinking, and I just go, like, and sit around and have a yarn, whatever, but I think it's like, do you reckon it's like a different type of connection here with family? Like, you have a little yarn, and people cruise around, and they come back, and... Yeah, they come past, have a yarn, and cruise around somewhere else, another one comes. Yeah, so. Do they ever tell you how much they like it, or why they like it, or just like it's known, or? Every now and again they... Well, but I know they like it. No, but... talking about it, you know, they just, they know. Hmm. What's, um... Can you walk us through all the places you go to? Hmm. Down by Church of Christ, you know, Monday and Tuesday. Wednesday here, then Ningamiah, Bowler Camp tomorrow. Thursdays. Back Friday, Church of Christ. Usually do the Saber Up Shelter, but hardly anybody went there, see? Yeah, so. I was bringing up Judith's wife and telling her, I might as well change our location. Yeah, we was gonna go short stay. But then, yeah, went to, um... . Hmm. Yeah, oh, true. Now, I'm not sure I'm gonna finish until it comes up. Hmm. Hmm. I know that number. Hmm. Hmm. Tell us, everyone's been talking a lot about this Bowler Camp thing. Can you describe it for me? What's it look like? Oh. Oh, I got that wrong. Okay. Where are you from originally? Norseman. Norseman, just in a road. What's your, um, country, like, what's your... Nudju. Nudju. Nudju. Hmm. How, like, connected are you with that, like, you? Other side. Hmm. Hmm. Do you, like, do you practice culture? Are they, like, strong? No, they went out yontago, yeah. Hmm. Hmm. . . . . No. You're on there. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . Oh, I'm sorry.\nThe Quiet Guardian of Dignity: Phillip and Orange Sky in Kalgoorlie\nIn the heart of Kalgoorlie, where the red earth meets the vast sky, there's a man known simply as Phillip. He's not one for many words, but his actions speak volumes. Every day, before the sun fully rises, Phillip is there with his Orange Sky van, ready to \"smash it out\" as he puts it.\n\"I just start here about sometimes 6 o'clock in the morning, just come and just smash it out,\" Phillip says, his humble words belying the profound impact of his work. \"It's not complicated, you know? Just wash, dry, wash, dry. But for some folks, those clean clothes mean everything.\"\nTo the community, Phillip is more than just the laundry guy. He's a constant, a reliable presence in lives often marked by uncertainty. His Nudju heritage and background working in mines and with Life Without Barriers have given him a unique perspective on the struggles and strengths of the people he serves.\n\"I'm from Norseman, Nudju country,\" he explains. \"Used to work in the mines, then Life Without Barriers. Now I'm here. Different work, same idea - helping people stand tall. Clean clothes help with that, you know?\"\nThe community speaks of Phillip with a warmth reserved for family. They appreciate his quiet efficiency, his non-judgmental presence, and his unwavering commitment. As one community member put it, \"Phillip, he's just there, you know? No fuss, no big talk. But he's there, and that means something.\"\nPhillip's impact goes beyond clean clothes. He's become a thread in the fabric of the community, connecting people through this simple yet essential service. \"I suppose seeing all the family of it, I suppose. The majority of them,\" he reflects. \"They come past, have a yarn, and cruise around somewhere else, another one comes. It's like a circle, you know? Always moving, but always coming back.\"\nThe Orange Sky service, under Phillip's care, has become more than just a laundry stop. It's a gathering place, a checkpoint in people's days where they know they'll find not just clean clothes, but a friendly face and a moment of dignity.\n\"Thirty loads a day, sometimes more,\" Phillip says. \"Each one's a story. Each one's someone feeling a bit more human. It's just laundry, but it's not just laundry. It's... it's giving people back a bit of themselves.\"\nCommunity leaders and service providers speak highly of Phillip's dedication. They note how his consistent presence has built trust, allowing other services to better reach those in need. His work with Orange Sky has become a cornerstone of community support in Kalgoorlie. Phillip himself is modest about his impact. \"I don't talk much, but I listen,\" he says. \"Every load of washing, every conversation - it's all part of the story here. I'm just helping write a few cleaner pages, I guess.\"\nBut to the people of Kalgoorlie, especially those doing it tough, Phillip and his Orange Sky van represent more than clean laundry. They represent care, consistency, and a small but significant restoration of dignity. In a world that can often feel chaotic and uncaring, Phillip stands as a quiet guardian of humanity, one load of laundry at a time.\nAs one community elder put it, \"Phillip doesn't just wash clothes. He washes away a bit of the hardship, a bit of the shame. He might not say much, but his work speaks louder than words ever could.\"\nIn the end, it's perhaps Phillip's own words that best sum up the profound simplicity of his mission: \"Some days are hard. Some people are doing it real tough. But then you see someone walk away standing a bit straighter, looking a bit prouder in their clean clothes. That's why I'm here every day.\"\nAnd that's why, to the people of Kalgoorlie, Phillip isn't just the Orange Sky operator. He's a vital part of their community, a quiet hero whose impact is felt in every clean shirt, every fresh blanket, and every restored sense of self-worth.\n",
  "themes": [],
  "themeIds": [
    "recxN9EnNIbJQg14y",
    "recsvXTTT23sQle8I",
    "recT6RbZYbg1LSmIc",
    "recAphkwD7C4o6aoT",
    "recJt1DpokC54zbGt"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}