{
  "id": "recwzC4gQ5d56azsK",
  "name": "Abby",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Mount Isa",
  "videoDraftLink": null,
  "summary": "In this transcript, Abby, a clinical nurse, discusses her role in managing patients with Rheumatic Heart Disease (RHD) in Mount Isa, focusing on community outreach and care. She highlights the challenges faced by the community, such as poverty and access to healthcare. Abby emphasizes the importance of collaboration across health services to prevent RHD through primordial prevention methods. She also touches on the need to address social issues like housing and healthcare access to combat RHD effectively. If given the chance, Abby would",
  "quotes": [
    "recELJgEiX02gKzTE",
    "recuJ3fNP1pyMv9Ka",
    "rectak9ptpdvDFxdW",
    "recP99D4gNiHySEyw"
  ],
  "transcript": "Sound and so the idea is you look straight at me. Yep. Don't worry about this bizzo. Yep. I'm kind of your key audience, key target audience. Yep. Your mic's going good and frame is pretty good. Shame. I'm just trying to get in the shot. Okay. Cool. Cool. So it's pretty casual just talking. Yep. I'd love for you just to sort of tell us a bit about yourself. Yep. And your role. Like how long you've been here. Yep. My name's Abby. I'm um what am I? You're a clinical nurse, aren't you? Hang on. Take your time. Nothing has to be perfect. Um my name's Abby. Um I'm a clinical nurse at the hospital for RHD. I've been in Mount Isa for roughly a year or so. Um I'm new to the RHD team. Um I don't know. That's cool. What do you do for the job? Like what's the main sort of thing that you cover? Um so my main role is working in the community with RHD clients. We go and visit them, make sure that they're up to date with all of our all of their RHD cares. We see new clients um and it's a holistic approach to their disease and um yeah. Cool. Explain a little bit about what so if you do like what RHD is and like? Oh yeah. So RHD is rheumatic heart disease. It's um a heart disease that um affects the the valves of the heart and creates permanent scarring. Unfortunately it's a permanent disease. There's no cure or effective treatment other than trying to prevent further scarring and further damage to the heart. Cool. It's a good descriptor. Um can you tell us a bit about like a Mount Isa community and like it's um like why do you think there are risk factors in relation to RHD um in the community? Um we have a high um Aboriginal and Torres Strait Islander population in Mount Isa and um RHD is very common in in that demographic. Um so I'm really excited about what that looks like. that demographic and we also have lots of issues with housing and poverty particularly in the northwest unfortunately and access being rural and remote accessing the cares can be difficult for our clients so our role is to kind of break down those barriers and provide direct care in community rather than our clients coming to clinic which can be difficult and like oh no Jerry what I I did see that but I forgot to I haven't heard that so yeah okay sorry in community health we try and raise awareness about acute rheumatic fever and rheumatic heart disease by being present in the community speaking to local community members working together with other community organizations and providing the direct care is probably the biggest way to spread awareness if we can show that we're actively helping and trying to prevent further RHD then I feel like that's is a way of raising awareness we also provide education to our clinicians who work here we have a massive turnover of staff in this community just due to the location and we have lots of clinicians who come here who've never heard of rheumatic heart disease so always providing education to our clinicians and yeah if we run into someone in the community and they're asking questions we always are happy to educate and provide clarification I guess that's cool what's involved in the training of it like what's the steps I guess you take to support people who have RHD so we our job we make sure that our clients are seeing cardiologist or a heart doctor regularly that they're getting scans of their heart regularly maybe like there's a patient Oral Health medication in a very complicated illness to look after a patient in an emergency situations for whether it's substance abuse or, you know, to OxfordPEP or tiredness basis yep so mainly making sure that they're Oral Health and their general well-being is up to date we also have clients who are on what's called secondary prophylaxis which is an antibiotic injection that we give to prevent further damage yeah and what's the risk if it's not managed what happens ? yeah that Guy started this business about 2 1 million dollars worth of treatment at home so he was not sçirent they back on everyone's資ac what's happening right now and they're all options to sign up yeah so yeah, so I'm just kind second Tulip she's a Europe expert age who's been there請 to protect the bucktasse and she wants you know it and she's vidajector component of theThat's how we do it at this time yeah so we really try and hopefully managed I guess like what happens to people they don't get the management the treatment if we don't manage our clients with rheumatic heart disease and they're left untreated it causes the risk of further damage to the heart and if the heart receives too much damage they are at the risk of having surgery to have valve replacement and like long time lifelong medications yeah I don't know what you mean you have to kind of explain that so like if community have access to laundry and that means that they can wash their clothes in hot laundry to kill bacteria and stuff like that is that a preventative opportunity for people who have RHD like how does that is there a linkage between yeah yeah I just don't know how to word it that's okay there'll be more of it for being such a yeah preventing baby yeah, yeah, yeah well do you want to jump in and talk about that so you yeah you like it can be crossed because that's kind of like a healthy skin thing sure so let's frame let's reframe it how does a collaborative effort across health services support people with RHD like why do we need a lot of collaboration and support across general health and well-being to make sure that RHD is managed because RHD is preventable and we have services like our healthy skin team Gp practices and that that help prevent rheumatic fever which leads to rheumatic heart disease and what we call as primordial prevention is like washing your clothes having a shower shower every day for example as we talk about ultimatelyeme singling out certain conditions which can be that some cases you have to like reminded every single day of the daily 5 to 12 hours of our wraps getting out of desse dzet must prevent RHD shower every day, keeping your skin sores clean, preventing sore throats. If we can have things that can help or if we have services like Orange Sky that can come in and help clients with that then we are kind of killing the disease at the start rather than clients getting the disease and then treating on from there. Cool, that's good, that's awesome. Last question I guess is like if you had a magic wand and you could cure it, what do you think that would look like in community? What would be the outcomes for community if RHD was managed? What would that look like for you? Yeah, that's a really hard question. What do you hope and dream I guess for your time in Mount Isa? What do you hope to achieve? What outcomes would you like to see achieved over the next little while? Specifically around what you were trying to do? Um, I don't know. Take your time. What outcomes would you like to see happen over the next little while? If I could wave my magic wand, fix everything, that would be great but I mean like rheumatic heart disease is, fixing rheumatic heart disease is not the problem that we should be focusing on. I mean it's more so like of your social issues that is the primary problem and if we can fix those issues like your housing, your access to healthcare, we're in better step, we're stepping in a better direction of eradicating rheumatic heart disease I guess. Cool, that's exactly what I was looking for. Okay. Okay, that's it. Well done. Smashed it. Okay.",
  "themes": [],
  "themeIds": [
    "recrhgtALvHrDRAE5",
    "recj37AVZQkzw3sdW",
    "recTg1kVv7EmBNBpO",
    "recCQVfQeC49XdbVZ",
    "recH4ALUYUdVK5W8t"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}