{
  "id": "recwAj4Nh09EMnbnI",
  "name": "Matthew Neill",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "The transcript discusses a conversation where a financial planner named Matthew Neal talks about his experience volunteering with Orange Sky, a charity that helps the homeless. He shares how he was moved by the organization's focus on connecting with people and the impact it has. Matthew also reflects on his perception of homelessness and the value of volunteering. He highlights the sense of purpose and community that volunteering provides and encourages others to get involved if they enjoy talking to people and connecting with others.",
  "quotes": [
    "recRo8GKFkjbc5mYv",
    "reclsHErfsZpw0jqD",
    "rec47W5NUX44rREcx",
    "recB7JXhpfYQEWs2v",
    "recajnvogyLOLBnyI",
    "recaAjcNP1tMRDwLr",
    "recZnUZ6IBxTQl77H",
    "recP1L2jo3tjnXcMd"
  ],
  "transcript": "Hello hello hello can you hear me? Yeah, well I can't but I can see you talking. This is the first time I've had this set up. It's a great setup. It's really cool. It's handy. It's very easy to set up. It's not when you're a one-man band. Yep. Right, Rala, you're looking at me. I'll sit here. Yep. Look at my eyes, I'll get my line. Right. Cool, Rala. Just do your name. I just like, I don't know if that's like, is that? Oh yeah, that's fine. Yep. Just do your name and spell it. It'll be awesome. Okay, Matthew Neal. And M-A-T-T-H-E-W-N-E-I-L-L. Cool. I reckon we just continue on from the yarn we were just having about how you met Nick and stuff. That'd be a cool place to start, I think. Yeah, so. How did you meet Nick and how did you start? Yeah, for sure. So I was lucky enough to attend a conference with my licensee. I run a financial planning business and they ran a licensee conference over in Shanghai and the boys actually came and did a presentation that day. And one of the most moving, touching things I think I've had at one of these events was hearing the boys articulate their story and this story about connection and connecting with people, which, you know, on the surface you think laundry and you think, you know, helping the homeless and those sorts of things. But what I took from it was this ability to connect and the impact you have connecting with people, which I think, you know, that really sort of grabbed me at the time and hence being here today as a volunteer. Cool. And so before that, what was your perception of homelessness and the idea of helping people? I guess in that situation? I think you don't really know. I think I knew it was a problem. I originate from Melbourne, moved up to Mackay sort of a while ago, and it's a massive problem down there, I know. But I think you can, you know, there's a lot of stigma that gets attached to people that are homeless. And I think unless you actually spend the time and get to know them and understand them and hear the stories, you don't really actually understand. I think, yeah, certainly coming to Orange Sky gives me that sense of understanding and knowing, not just this outside perception or listening to the dogma or the stigma that you hear in the community. Yeah, right. And I guess, like, tell us a little bit about your, like, history. You've been in Mackay for a while, or you moved around, and what sort of stuff did you get up to around? Yeah, financial advisor. So I run a business locally. Yeah, so we support lots of different, you know, charities and do lots of sort of sponsorship and things like that locally. But moved up here from Mackay, from Melbourne, sorry, 10 years ago. So I started a business and young family. Wife sort of runs her little shop as well. And then, yeah, two young boys just starting embarking on school. So, yeah, it's a busy, busy time. And what keeps you in Mackay? Like, is it something that's like a community thing or business thing? Community, mate. 100%. Yeah, I grew up in a community in Melbourne. This is a much tighter, tight-knit community in Mackay. I think you really know your neighbour. And I think that's something that you can miss in the big city, I think, you know, whereas here, you know, you're not going to be able to get a job in the big city. You know, you're going to have to get a job in the big city. think, you know, whereas, whereas here, you know, you can foster those relationships. It's got everything you need locally. Beautiful place to live, great climate, great people. Yeah, no complaints. And how does that carry over to what you do here? I guess, like, some people, the people that come here, I guess, are missing something, whether it's like a loneliness thing, or a practical thing. What's, how does that feel to be able to like, like, be here every week and know that that's the reason you're here, I guess? Yeah, I think it's easy to give your money and donate and donate your money and your funds. It's a lot different when you start to donate your time. And you can actually see the change you're actually having a part of, as opposed to, you know, handing over some money and a cheque and, and not quite knowing what that's going to do or what they're going to do with that. I think it's, it's being at the coalface, actually seeing and seeing the impact you're having on people just through connections and hearing their stories. So I think, a massive part of what I've done is I've been able to see how people are changing, and I think that's a really, really important part of what I'm doing. Yeah, I think it's, it's a really, really important part of what I'm doing. And I think, I think, so I think, massive part of what I like to do is, is community, community based and community oriented. So, so for me, it's just a natural, natural progression of that is spending the time. That's cool. So you're a financial advisor, and I guess you know a lot about like, value and economics and things. Yeah. There's, what do you think like the, the impact is of Iron Sky, not just on the personal and the engagement, but like, on a scale where it's more around value? Like, how do you think that Orange Sky supports Australia and New Zealand and stuff with value? Yeah, I think, I think the value it has is that it, you know, clearly, it gets people out of their house, gets people talking to other people, gets people using services they wouldn't otherwise have actually knew were around. Talking to the people here that support us and provide the food services. Just those two, two services working together is what draws people in, makes them aware of what Orange Sky can do for them. You know, you don't actually, you can actually, you can actually, you can actually, you can actually, you can actually, you can actually, you can actually, you can actually, you can actually have this service where you can talk to people, have an outlet, have a social experience with, with people that you wouldn't otherwise interact with. But it's all because of this joint collaboration between, you know, two really great organisations and it's having a huge impact on people locally. That's cool. And what about the impact for people like yourself, I guess, like, um, thousands of volunteers around Australia from all walks of life. What do you think the value is to like a society, um, for people, for that to be a thing you can do? Sense of purpose, mate. Um, I think, um, I think, um, I think, um, I think, um, I think, um, I think, um, I think everyone's looking to connect with people, but for me, it was just a massive, you know, sense of purpose. You know, you've got your work, your family, you can play a bit of sport on the weekends, but for me, I wanted to find that sort of deeper sense of purpose. Why am I here? Why do I do what I do? Um, can I have a bigger impact than just turning up every day and going to work and spend time with mates and family? Can I make a bigger impact and have a greater sense of being and sense of purpose? And I think for me, that's the biggest thing I get out of Orange Sky. That's cool. And if someone's like standing on the fence there looking at Orange Sky and thinking, maybe I want to volunteer, maybe I don't, what do you think would get them over the line? What's something that you would say to them to get them to come? I think if you enjoy spending time with people and you enjoy talking to people and getting to know them and understand and listen, um, and you, and you have those, that, that ability and have those skills, then put them to use and give it a go is what I'd say. Um, you know, there's, there's no harm in, in trying these things. Um, it's a very, um, welcoming community is how I, how I found it. Um, your teammates are supportive. The friends you meet have all got different stories and different backgrounds. And I just find that incredibly exciting and incredibly, um, I just enjoy it, um, fundamentally. And so I'll keep turning up and, um, I hope other people will join me. So good. Mate, good ending. That's all right. That was a good little, uh, box pop there, I reckon. Nah, good man.",
  "themes": [],
  "themeIds": [
    "rec7YgC2EKeuDzfj9",
    "reczL6E5Am7RyjNYh",
    "rec6YnpYU6MWF0jay",
    "rec7n7iUJcO4ivJIs",
    "recz4m876jhv7mqJZ"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}