{
  "id": "recWzm6jtYp5CNgMi",
  "name": "Brendan Gunning - School Vice Principal",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "The transcript is a conversation between Ben and Brendan Gunning, assistant principal of St Patrick's College in Mackay. Brendan discusses the school's values and partnership with Orange Sky to run the Brekkie van, providing service to the less fortunate in the community. Students get involved in cooking, conversing, and learn about different perspectives in the community. Brendan personally enjoys modeling expectations and connecting with the community. The partnership is described as a win-win for both the school and the community, with staff and",
  "quotes": [
    "recITC1wsKNhqUvf6",
    "recdgXycYtGkEEUgb",
    "rechemnDa8SzzOnjK",
    "rec5nixoJAonXjX0G",
    "rec35x4ueILwL6lRI"
  ],
  "transcript": "So how's that sound Ben? Is that working? Yeah man, that's wicked. Make sure you're focused here. Cool. And I think... Oh, that's not... Can you spin your chair so it's this way now? How's that sound? Awesome. The one thing that's important when you're doing this stuff is like, if you talk with one person from a particular place, you want to have them on the other side. Yeah. I think I took this way, that way. I see what you mean, yep. Alright, let's rock this. Okay, point them there. Alright brother, we are rolling. Okay. Just say your name and spell it, it'd be awesome. Okay, so it's Brendan Gunning. B-R-E-N-D-A-N G-U-N-N-I-N-G. Cool. You can just speak to me, I'm sorry. Tell us a little bit about the school and your role at the school. Okay, so we're a Catholic secondary college in Mackay. Have enrolment of about 1500 students, year 7 to 12. And have been around the world for about a year now. And been around the Mackay district now for many years. Cool. What's the, why do you think that the school wants to engage with things like this in Mackay? Like what's the vision of the school, I guess? Or the values of the school that means that you end up coming to the school? Well I guess our four values at St Patrick's College are compassion, hope, justice and respect. And we have a real strong focus on service in the community. So to partnership up with Orange Sky and run the Brekkie van is a great opportunity for our students to practice those values in the community. That's awesome. What do you think Orange Sky is, I guess, like Orange Sky's conversations, Washington's connection to you and the school? What does Orange Sky mean? Well number one, certainly filling a need in our community. But it's really, like I mentioned before, it's really a service to our community. It's really a service to our friends in the community that are less fortunate than ourselves. Opportunity for conversation is our big thing. But yeah, and being able to partnership up with you guys is a real plus for us. That's awesome. What do you think the students get out of it? Well it's interesting because we never have any problems filling shifts. It's almost like the students are jumping over each other to get down here in the morning. And often one of the problems we have is more students than we have students. And we actually need, but that's a great problem to have. But our students really like doing stuff. And to come down here and either cook a barbecue, have conversations with the friends down here, they get a real lot out of doing stuff for the community. That's cool. What are the types of things you think the kids will get out of, like in terms of learning and coming? And I guess, what's his young fellow's name again? Will. Will was saying, I guess, like he understands the opportunities. Yeah. He understands the opportunities to do things outside of traditional education and engage in the community. What do you think that the kids actually leave school with and they wouldn't have if they didn't come here? I think we've all got our perceptions, Ben. But I think actually coming down here and doing shifts, some of our students have been eight, nine times. And I think it really gives them a better understanding about, you know, a wide range of people in our community that they may not have already had. And yeah, I think sometimes their perceptions are a little bit different to reality to what they actually are. So by coming down and spending time on the brekkie van, working with Orange Sky, I think it just really opens their eyes and maybe clarifies a little bit to the, you know, to the real story that's happening in our community. And I guess for you being principal here, principal? Assistant principal, yeah. Assistant principal. I guess you being a leader at the school, what do you get out of yourself in terms of coming and what does the school get out of it as well? Yeah. Definitely. Look, I, almost from a selfish point of view, I come down here every time the kids are down here, twice a week. I always sort of joke this is the highlight of my day. It's downhill after I leave the brekkie van. But I like to model the expectations. And if the kids see us down here rather than just asking them to come down, I think that's important. But I love the conversation with the friends and even with the Orange Sky staff, you know, just over there talking to Andrew Gibbs. Yeah, I just think it's a real connection. Yeah. I just think it's a real connection to the community. And I think that's what the school's all about as well. That's cool. Was there anything that you wanted to say that, like, reflected stuff that you wanted to show the school? Like, was there any, like, an open question, I guess, anything you'd like to say? You're right, Troy, come through. We'll get a seat. You're right, Troy. He's paused it. I don't borrow me. You want to, I'll put a seat here for you if you like. Is it on TV? No, no, you just make a little bit of a... Does it fit under your belt? Yeah. Yeah. Good. No. Will you do this sort of stuff? I'll just hang around and Nick and Lucas, the co-founders, ask me to travel around and tell stories. We've got Orange Sky here. Oh, really? Yeah. Good to meet you, man. We'll have a yarn soon. Yeah. Oh, no. No, they're being good people, Orange Sky. Thanks, man. Yeah, look, I'll just say, Ben, that sometimes we're a bit limited with opportunities for our students to, you know, provide service. And to get out into the community. And this has been a real win-win. You know, win-win for the, like I said, the guests that, the friends that come along in the morning. And a win-win for the students and for the school. Yeah, it's a real plus. And it seems to be going from strength to strength. And not only the students too, I think our staff benefit a lot from it as well. They're down here and modelling the expectations. But also, you know, they're giving service and giving back to the community as well. So, yeah, it's a great partnership that we've got with Orange Sky. Yeah. And hopefully it'll continue, yeah. Amazing. I think that's it. That's it? Okay. I'll take a quick peeky. Okay. What I'll do, I'm just going to do it here because we've got some challenging sunlight today. Looks okay. But I'm always up for a challenge. Here's what we can do. I'll just pop that there, right? Yeah. Oh, thank you so much. Yeah, come and drive with me. Mate, I always like that. If you're standing there, actually, I think it's okay. Let's see how we go. Oh, that's a good one. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. MVD Okay. Yeah. We've got a young lady who's scared of me. Crank. Crank. That's just a throw-over for you, I guess. So we'll send her over. Thanks again, mate. All the best. Thanks, mate. Thanks. Thanks, mate. Thanks, mate. Oh, really? Is this your main sort of vibe? Is it mining or is it like transport? I don't really know. Railways. Railways. I should have known that. Do you see the train? Peggy, you do see it? Yeah, right. Where are you from, man? Brisbane. Brisbane. Do you go to Mount Isa? We do, yeah. I was out there for many years. I've now got a bit of stuff happening there, which is cool. And what's your role there?",
  "themes": [],
  "themeIds": [
    "rec8piNL0welnGTmS",
    "rec70A5EbkEBTJWpw",
    "recBD52OdkeO7ipb0",
    "rec8ZzJXVx45qujen",
    "reclzKaKQUoPzV25Q"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}