{
  "id": "recW4cfktgBUOvyjr",
  "name": "Neilson Naje",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Melbourne",
  "videoDraftLink": "https://share.descript.com/view/z6acdGGfbMp",
  "summary": "Nilson Naoje, residing in Victoria, Melbourne, shares about his life and family with African roots, emphasising the pursuit of happiness and peace in a new community.",
  "quotes": [
    "reclA6Fk4B3ZSqLUu",
    "reczn2KQ8bmvztmZu",
    "receT7jpqPyH4o0BQ",
    "reci2r2nJ5EiCVRvt",
    "reccDykqJe34S1jp4"
  ],
  "transcript": "Nilson Naoje - Friend - James St\n\n===\n\n[00:00:00]\n\nSpeaker 17: Amazing,\n\nSpeaker 18: amazing grace.\n\nSpeaker 17: So do tell me, just tell me your name and spell it and you can just talk to me. You don't have to worry about this thing.\n\nSpeaker 18: Yeah. So my name\n\nis Nilson Naoje\n\nand, um,\n\nSpeaker 17: how do you spell it?\n\nSpeaker 18: Uh, so N-I-L-S-O-N and last name is NA uh, JE.\n\nSpeaker 17: Awesome. Tell us, tell us a little bit about yourself.\n\nWhere do you, where are you staying at the moment? Um,\n\nSpeaker 18: I'm staying in Victoria, uh, Victoria, Melbourne in Danina. Um, stay here for 19 years, uh, with my parents, uh, mom and um, sibling. And I got a younger brother and the younger sister. I'm the oldest and, um, yeah, living happier and, um. I ma migrate from Africa, 20, uh, 20 years, 19, [00:01:00] uh, so roughly, uh, 19 years.\n\nSo, um, Dan, a good place for, you know, a community that can, you know, your country, your place, and starting a new future. For us as, uh, we don't have, uh, all the parents, but before us for, um, million years or a hundred years, we are not indigenous Australians. Uh, we just come from a long way to reach to a peace place and happier place.\n\nAnd to start something within ourself is just, uh, where we come from. And we need to start something and we have to start something. Um, and the world is going, [00:02:00] uh, financially, uh, hard to live in a nice and peace and happier life and learn, trying to educate ourself and um, just to be wise. 'cause the world is getting, um.\n\nNot knowing about the world really enough until we, uh, I start something to, uh, to be, um, just part of, um, any country or country ourself as young fellows or young youth or African, uh, just any community can believe on educations so. Dealing with, um, life or liars that you could be something but you choosing a different direction.\n\nAnd it is the only one direction of succeed is to, to study something and to have a goal, and to have a mind [00:03:00] line, uh, that can, uh, learn to, to make a better place.\n\nSpeaker 17: What's, what's some of the things that have been a bit tough for you recently? Like what are some of the toughest things for you?\n\nSpeaker 18: Uh, it is something that, um, you, coming from beliefs, most of the times it's your belief is, um, not focusing about your belief and your mind or your heart is, and different and something, and something unbelievable.\n\nSo it is more like you don't believe. Things will come quicker, uh, or things can have a time or thing. You can, um, want something, but you have to do sort of things to own it. If you need to buy something, you have to save because you don't have money and you don't have money, but you, you know, where's the money and why [00:04:00] you need the money.\n\nWhy so something that in gold, in plan. That you have to plan your mind into that something that you need. So it's all for me, it's patience and certain and have maybe a wi wisely, uh, to educate yourself. It is just not, you're not running to owning money. You are not running to, in a way that, um. You will have maybe in short times, cars and houses in that will be dodgy for your own mind because mine is all about study and, and have, have yourself in timing doing anything inside of things.\n\nAnd Yeah, and I think [00:05:00] sometime is the difficulty of getting to, uh, different people that you don't know and you're trying to introduce yourself with, um, just with your heart. 'cause you dunno mm. The mining is tell you is people that you don't know is sometimes good for you, bad for you, but this choice to why you need the set of people that be with you.\n\nAnd you have to choose carefully. And some of them, some of them, um, will be, uh, bad for you or some of them will be good for you and you don't have a way of, um, to have another way of, have them through you or through what you're going through, and you cannot force anybody. That to be in your problems and to be part of your problems.\n\nAnd you see there was, you will not see. [00:06:00] They'll try, you try to give them a story about your life and how your misery or how your suffering or your need of support, and you cannot force them for that. They need you need from you is to have a nice story sitting down and see what you need to do with your own self.\n\nWith your own life, and then consider that as professional worker to help you and give that with you and take, uh, to a better way of understanding why things will happen when you're not knowing anything. And,\n\nSpeaker 19: hey, breath, bad. Uh, Freddy. My name Freddy. Freddy. Ben, lovely to meet you. Oh, Ben, nice to meet you.\n\nYeah, lovely to meet you. I'm from you. It's good. Yeah. I just have to go to the library. Just have a quick shower and come back.\n\nSpeaker 18: God bless you. To\n\nSpeaker 19: get my, get my clothes.\n\nSpeaker 18: Okay.\n\nSpeaker 19: Thank you very much. Don't be late. Yeah, yeah. I just, you know, walk, [00:07:00] take my time. Okay. They said if Freddy as\n\nSpeaker 17: well. Yeah. If you got time to talk to me later after your library.\n\nSpeaker 19: Yeah. Yeah. Cool. Awesome. I just get, uh, I just have a quick shower. Great. Because I feel itchy. Amazing. Do it.\n\nSpeaker 17: Amazing. Good to catch up.\n\nSpeaker 19: Yeah. Thank you,\n\nSpeaker 17: Ben. Thank you, brother. Thank you. See, you.\n\nSpeaker 19: See.\n\nSpeaker 17: So why, why, why are you using orange sky at the moment? What's\n\nSpeaker 18: Well, um, dealing with other things at home. So I don't have a new one.\n\nI don't have, uh, uh, the old one's not working, so. That, um, I'm dealing with sampling homeless and not having, um, a right place from place to place. And so surviving, and that's what I learned this, um, not quite well knowing how to survive that, but surviving in different places. It could be different as surviving in other communities or other cities or other suburbs.\n\n[00:08:00] Mm-hmm. It is way to get some help.\n\nSpeaker 17: Mm.\n\nSpeaker 18: And way to, um, so you organize, organize yourself and to get sort of take like professional places so you can just know what way you're seeking for what you need. And I think there's no, uh, wrong, uh, right until you find with the mistake first. And if you make a mistake, there's no problem.\n\nAnd, uh, that's what my way of seeing. Mm-hmm. It's not wrong thing to make a mistake if you don't know.\n\nSpeaker 17: Mm-hmm. And what do you think of service?\n\nSpeaker 18: Oh, they're helping a lot, you know, support, that kind of support is very nice, you know, because, um, you dunno how to get around where your financials bad after you don't have a work and you don't have a place to stay and.\n\nYou. You don't have a friend around you and you do try maybe [00:09:00] everything and you're still in the same situations and you going back forward. To bring a future from what? In the past, if you lost the, if you lose your way of the past is, and it's all about histories and you know, what\n\nSpeaker 17: sort of conversations do you have with the volunteers?\n\nSpeaker 18: Uh, everything, everything sometime is you get a fox, uh, a fox, the, the news around and if you social all the time around. And you just knew what she going through. And sometimes it doesn't have to be, um, face to face or man to man or something that I really want people share. He, well, he all this news around all this gathering and having talk about that and they talking about.\n\nUm, who or [00:10:00] who say it and all of that. They want to say about things and they really want to think about things. They wanna like someone or don't like someone, or they hate someone, or don't hate all this other thing. Sometime you choose your way. Uh, choose way only is unique, is to see. The most important is your mind.\n\nKeep going and think, but if you choose it. Uh, to get off after it and relax your mind and start just, you know, focusing by yourself. And that would be, I think, perfect, but after just people will have to share small things just to be, you know, shelter, just open and, uh, but what heard you, what you don't succeed things or you don't, you are dealing with other financial stuff, problem or families or all of that, sometimes.\n\nHmm. That's the mind. Always bring.\n\nSpeaker 17: And why, why do you think it's important to have other people to have conversations with and talk to? [00:11:00]\n\nSpeaker 18: It is very important. It's part of, uh, human nature and part of your parents that if you go through parents, you go mom and dad, you go through school, you going through, if you did go through all of that, if you go through, um.\n\nUh, a belief. You have a belief through a church or through, um, any belief in this world, you need someone to talk to. And it's just that if you really need, uh, some help, you need someone to talk to. You need anything in this world is somebody, uh, have to have a word with you. If, if, even though, yeah, social yourself.\n\nOr you'll take yourself out of the community, out of your families. You say you wanna be with yourself, only you working hard for yourself, but end of the day you have to come out again and tell them why and why you have to be with [00:12:00] yourself all the times. What's the mistake or anything particular that he, why you don't want to be with everybody, but yeah, because.\n\nYou trying to see the mistake that you always bring, or maybe the happy, well, the happier, the happier time by yourself even have to have a reason. And maybe you're trying to take some, uh, other point that yourself, it's the soul and the heart and the mind that you have is belong to God. And. And that time is people have like, just like your mother.\n\nMm-hmm. And just like your father and your nephew and brother, they have something with you. Yeah. And part of you,\n\nSpeaker 17: why do you think some people are disconnected?\n\nSpeaker 18: So they're disconnected because self shame or self [00:13:00] wisely to be, um, um,\n\nuh. It could be part of a succeed work for yourself. It could be you give time outside the box or outside the circle once when, when you need to be working for yourself. When you need to work for yourself. It mean that you need to show, show you need to be yourself. And work hard was, was, um, was the be, uh, benefit.\n\nThat you want to bring for others or for yourself. Yeah. And work hard for it. So most of the times is that you had to come back to yourself. Mm-hmm. And after when you find you wrong or right, uh, you make a mistake. Yeah. Make sure you're always sorry. And, and that's human leads, you know that. [00:14:00] You gotta come back to, um, to a way that we have to talk to each other and be great to each other, and be nice to each other and start working hard to a way that we all support each other with different, uh, different stages of learning or different specialties.\n\nUh, just, you know, in that. Uh, type of rough times and we had to work together and any type of professional works so we all can support each other and reach to a happier place with the old be, uh, universe and the old community and the countries and, and the cities and the place that, um, hard place to be around tough places.\n\nAnd, uh. And people are not getting enough support. Mm-hmm. They don't know how to reach to a higher place that you can say, okay, I'm going dealing with this and I [00:15:00] cannot support. I've been five years, six years, 10 years. I can't reach even to, um, a medical support. Yeah. And, uh, you know, nobody can help me and I'm giving up.\n\nAnd I think the, I think the, this life is nothing. So when the support is here, it's just that people not working together and bring, bring blessing to the whole nation, you see.\n\nSpeaker 17: And what would you say to Orange Sky people about what they do? Like if you talk to the Orange Sky volunteers or the people?\n\nSpeaker 18: Well, they, they want to know the, the really story that what people going through. I think, I think it's a better idea because that's the way that this is, this Australia is a very nice place, you know, because you want to know if it is, is the true, what is you going through, you know, in the true way of seeing what we, uh, the first place that what we doing with our people, you know?\n\nSo we get to know that the support is here [00:16:00] and whatever you need it and miracle support is here. Anything that you need is here. It's just way you are looking for yourself. What, what is it? What is going, what are you going through? You know, it is through way of life, you see, and then we're all going through different struggle.\n\nIt's not just because Australia or it's not just because, uh, America. It is not just because you are in a country of, uh, Africa. You dunno how to get some help and all of that. And, um, I think it's just that, um, telling you have to tell the truth about really what you're going through. It could be easy, uh, easy access to get your support and happier after you have many, uh, different idea about.\n\nOther things and easy to dealing with type of people coming from many place around the [00:17:00] world. And if you ask me, I'm from here, and you ask them and you bring them together and they have different word. And how, where they going struggle, what, how they're gonna struggle. Where you get, what's the problem, what's the problem?\n\nIf they find them similar way they have, they operate in the same mind of suffering, or you find, uh, operate in a way that they don't have enough, they get less, uh, um, not treat them well. Um, not respect for them because they don't have anything. Uh, or just because, um, they don't know anything. So maybe people, um, different from different nationalities and different belief and, and that's easy.\n\nCan we, I think it's easy. Can walk back easy in, in a different communities and in different professional work, I think. I think that's not hard. That's cool. Yeah. To communicate. Again, we're all [00:18:00] helping. Yeah.\n\nSpeaker 17: 20 minutes. Well done. Yep.\n\nSpeaker 18: Thank you.",
  "themes": [],
  "themeIds": [
    "recd98uk1zvi6bXYj",
    "rech2DsK5b9Gkf7wv",
    "recm2pr45tUPL3VZ9",
    "recNDg8KdelYAj4ej"
  ],
  "shifts": [
    "recZ0LlHTsyQtlmA8"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}