{
  "id": "recxCeNdzRJghQ6ie",
  "name": "Vicki Sorenson",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "Vicky Sorenson, a retired individual involved in volunteering, shares her experiences working with organizations like Orange Sky and Tramby House. She emphasizes the importance of connection and friendship in providing support to those in need. Vicky discusses the collaborative nature of services and the impact of volunteering on both society and individuals. She highlights the satisfaction and value of giving back to the community.",
  "quotes": [
    "recu76zNk0SZAefiH",
    "recLe12PmK1HiKozP",
    "rec0Rx1JBH2ZiCvAr",
    "recNvuPsU7Y5HEfCs"
  ],
  "transcript": "I actually quite like this frame. I'm going to tell Nick, I'll be like, what? You've nailed it. It's going to be the best frame. All right, just tell us your name and spell it. It's awesome too. Just kick us off. Surname or just? First and surname. Okay. Oh, hi. Look, I'm Vicky Sorenson. Yeah, sorry. Say that again. Good. Go. Oh, hi. I'm Vicky Sorenson. Do I need to spell it? Yeah. Vicky, V-I-C-K-I, S-O-R-R-E-N-S-O-N. Sick. Tell us a tiny bit about yourself. Oh, look, I've recently retired 12 months. I'm from a pretty hectic role. And, you know, I've always been fairly community minded. Food bank. Started with food bank a long time ago. I've worked with Orange Sky. Now I'm happily supporting Tramby House with our food service. And, yeah, it's just fantastic. I love it. And it's the cold face. It's where it's happening. You know, that's get the basics right. Tummy, food in your tummy, your laundry done, you know, some conversation. You know, that's what I do. That's what I love. What was the first time you sort of heard about Orange Sky? Oh, look, I think I might have seen it on Facebook. And I thought it was a great story. The two guys that started it up. And then the massive Google sponsorship that they secured. So I followed it up. And, yeah, I worked with Orange Sky for about 12 months. Became a team leader driving the van around attached to Rua. It was fantastic. I loved it. Yeah. We were talking before. You were talking about that connection piece. Why do you think it's important not just to get the laundry done, but to connect properly? Well, really it's a twofold thing. You know, you hear, yes, the practical side of it is to do the laundry. But the other side is engaging with our service recipients. You know, that's what they're here for. So, you know, I'm not here to try and solve everyone's problems. But I can be a happy face and I can show some interest because I'm genuinely interested in people. I've got a story. Everyone's got a story. You know? So I think it's great. We need to share our stories. And that then becomes a bit more normalized. You know, we were all kind of doing our little bit for whatever we can. Orange Sky has recently finished its podcast. It's called The F Word. And The F Word is like they use as friends. Yep. I'm guessing we might get run over here in a sec. Is that going to happen? That might be it. That might be Orange Harvest kind of. Maybe. I'm not sure. We'll see where he goes. See where he goes. It might be interesting to see where he goes. Yeah. You going in there? It's great, isn't it? That should be a podcast itself. I don't think it should be. Yeah. So I'll just make sure you're a little crispy in the brain. You got that fuzzy lens on me? Yeah. What's that? I don't know what that is. I've got my hands. I should do that every time, but I forget. Okay. Yeah. Orange Sky's got this podcast. It's called The F Word. It's about friendship and friends. Yes. That's the terminology that's used for people who use Orange Sky. Yes. And I'm just struck by what is this power of friendship not just for people doing it tough, but for everyday people. Yeah. Like how do you find this idea of friendship and how do you find this idea of friendship? I think it's really important to be able to do that. I think it's really important to be able to do that. Yeah. I think it's really important to be able to do that. I think it's really important to be able to do that. Yeah. I think it's important to be able to do that. I think it's important to be able to do that. Friendship and friends being a really strong supportive area of life, I guess. Yeah. Well, you know, we all need to feel some sort of connection, don't we? And a friend can take on all sorts of things. It can be a close friend. It can just be an acquaintance. It doesn't have to be. You can be as involved or not as you like. So by reaching out, a smile, being friendly, I see my role with Trambie House as a hospitality side of it. So hospitality comes with a smile and being welcoming and inclusive. You know? That's all part of being a decent human, isn't it? And Trambi, tell us what it is. It's hectic in there. There's people everywhere, there's stuff. What's telling us a bit about Trambi? Yeah, am I allowed to be that? Sure, yeah, I don't know, are you? Yeah, well, Trambi House, I don't know, yeah. You could talk about Trambi as in what you see and feel, I guess. Oh, look, it's a wonderful, it's a destination where people can come together. We've got street vet, we've got street doctor, street law, streets, you know, so many services here. And the volunteers like myself, we put the food out and we keep, you know, just trying to keep people fed and engaged and, you know, we don't step outside of our scope of works. We've got beautiful support teams that do all of that. Lot of security, we're very safe here. You know, you're dealing with vulnerable people that have got all sorts of experiences. So, you know, I feel very privileged to be here. I feel very fortunate to be part of that and I really like it. What's this idea of like, for people doing it tough, having different services collaborate, I guess, and having services that are staying in the lane but supporting specific people? Yeah, there's gotta be a certain crossover, hasn't there? And I think we do that really well. Our teams here are super professional and they assess each, everyone is assessed on an individual basis and then the services are, you know, provided and then channelled into where they need to be. But there's certainly a lot of crossover. Great communication. There's a team meeting every morning where, you know, the pre-start before we open the doors, you know, the teams all come together and discuss, you know, really what's the plan for today, you know? What worked yesterday? What didn't go so well? What do we need, you know? What did we do well? What can we do better? That kind of stuff. So it's a great, beautiful people. I'm really lucky to be part of it. I love it. That's great. What you've done, you know, in terms of, you know, you've done a lot of work. You said that you just finished work. Yes. What's that feeling of transition like for you, I guess, like having something that is a huge part of your life that's finished, but then also having more time to do other things? Look, I think, you know, when you finally decide that you've had enough of work, it's not an instantaneous. It's probably a slow grind the last 12 months. I was, you know, kind of feeling that I needed to, you know, exit stage right from my working career and do something else. So, you know, I'm fortunate that I can afford to do that. So, you know, then it was quite very easy for me because this is a lovely part of, you know, my life now. And I couldn't imagine not ever doing it. So, you know, I like the onboarding of new volunteers. I get involved in that. I help with Buddy Up people, you know. We're about a consistent delivery of service. So we all need to be on the same page. And it was an easy transition for me. But I've got a strong... Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. I've got a strong social background anyway with aged care, food bank, that. So I've always had that. My daughter did a lot of work with the asylum seekers in Victoria, cooking. So we're grassroots kind of people, you know. Just, you know, keep it simple. Don't confuse it. But let's get the basics right. And then we can, you know, empower people to give them the confidence. You know, a beautiful story from Orange Sky that's always stayed with me. A gentleman said, you know, I finally felt that I could sit on a bus because my clothes were so tight. My clothes were clean and people weren't going to be offended by, you know. And it gave me that sense of, okay, I can move forward. It's, you know, not always going to be this way. It might be tough now. But, you know, gradually building your self-esteem and getting that back to where you want it to be. So... Last question. Volunteering. Why, like, I guess, the power of volunteers in Australian society? Like, what sort of power do you think that the society gets in general in terms of volunteering? In terms of impact, but also for the individual? Oh, look, it's hugely satisfactory, satisfying for me. But we can't rely on the government. We can't say it's everyone else's problem. We've actually got to get out there, boots on the ground, and say, okay, I'll do the dishes. I'll do some food prep. I'll serve. You know, it's not about anything glamorous. It's just about doing the basics. And it gives me a sense of that I'm actually doing something a bit worthwhile. And I'm nothing special. But, you know, I'm doing it. If we all do a little bit, it's like anything. If we all contribute a little bit, wow, we can, you know, we can achieve a lot. And that's what it is for me. That's amazing. That's cool. Is that okay? Oh, so good. I'm just going to take a piggy now. That's all right. It's going to be... I'm actually better at taking photos than a volunteer. I am.",
  "themes": [],
  "themeIds": [
    "recFkwSkHdzamfnvE",
    "rec97uLFYL3k0tClX",
    "recuiKxd2ItqhrVQ0",
    "recRCTGPhuCxLEtz5",
    "recWWeT6RD50CgHDt"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}