{
  "id": "recx4B6Vo3fTgo298",
  "name": "Catherine Plant",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Bundaburg",
  "videoDraftLink": "https://share.descript.com/view/36dJPs7eqUo",
  "summary": "Catherine Plant, a 64-year-old independent single woman, shares her experience with Orange Sky, a charity providing laundry facilities for the homeless. She first heard about Orange Sky while going through a divorce and separation, and decided to volunteer with them after witnessing homelessness in her area.",
  "quotes": [
    "rect6PeYLW50xXKrT",
    "recFHG2xuDVkFIQij",
    "recVT6AuEzAoNoSPB",
    "rech31kk8cjjy9UVt",
    "rec1WvLAVQfs3SY1P"
  ],
  "transcript": "# Catherine Plant\n\n[00:00:00] \n\nIt's good. It's my audio recorder. Good.\n\nGood light today. Good? Yeah. Very good. Okay. My answer. That's alright. Okay. Your full name and then spell it for me first up. Oh, okay. It is Catherine Plant, C-A-T-H-E-R-I-N-E-P-L-A-N-T. Awesome. Tell me, tell me about yourself first. A bit about me? Yeah. Okay. Well, I'm 64, um, very independent single. Having a lot of fun running amuck.\n\nWhat, um, where did you first hear about Orange Sky? What was the, what was it about it? I first found out about Orange Sky and Mackay about four, five years ago. [00:01:00] I moved into town from living outta town and I was going through a separation and a divorce and, you know, my nervous system was, so I'd go for early morning walks and on those early morning walks, I came across a lot of homeless people sleeping at rough.\n\nAnd they told me about orange sky when I, I used to bring them breakfast sometimes. And um, yeah, they told me that they had somewhere to do their laundry down at a church that was there with a pot out the front. Mm-hmm. And then when I moved to Bundaberg to look after my 90-year-old mother, I was looking for some volunteer work and I decided Orange Sky would be a good place to start because my early morning walks here, I discovered a lot of people sleeping rough too.\n\nMm-hmm. Um. Has it sort of lived up to what you thought? Is it different? Like since you've started, what have you felt in terms of why you started and where you are now? Well, I started because I wanted to help people who. Just have clean clothes. Mm. I have OCD and if I couldn't have clean clothes, I think I'd be [00:02:00] beside myself.\n\nMm. And yeah, I think, I think it's lovely. There's a lovely crew to work with. Uh, um, the friends that come along are usually really nice, and the ones that aren't, you just take a deep breath and handle them while they're there. Yeah. Cool. Um, what's the general vibe for yourself around the situation in. Um, do you feel the, um, people struggling around this region?\n\nIs it Oh yeah. It's bad. What's, yeah. Well, it's gotten a lot better. Um, one of the local polys has put a lot of them into temporary accommodation, but they still have a washing problem. Mm. 'cause the motels charge $5 a load for the laundry. They might not be sleeping in tents anymore, but they're in motels.\n\nAnd, and, um, caravan park and they still need their washing done. Mm. There's not as many people living at rough in the park, but I know there's a lot more in the bush hidden away so they won't get moved on. Mm. [00:03:00] Um, in terms of the different. Parts of Orange sky, like the washing and the connection and that conversation piece.\n\nHave you got a sense of what's more important than others, or is it the whole thing that's that best, or how do you feel about everything that's part of the experience? I think, I think it's wonderful that there's the facilities here where it's needed. That's what I think is the best part about it.\n\nThey've got somewhere to go to have a chat, get their clothes washed. Sometimes there's backpackers as well. Um, that used to bother me a little bit, but I mean, technically they're homeless too, while they're here. Daily. Yeah. Um, and in terms of like the whole Orange Sky organization as a whole, is there anything that stands out for you in terms of good, bad, ugly type?\n\nI think it's a wonderful organization. I really do. I do great work and the. The keenness of it. Like [00:04:00] they're all keen to do it and they're all keen to participate and they promote well too. That's good. That's good to hear. Yeah, they do. Um, and support for volunteers, you find that quite helpful. And yeah, that's, I've done a lot of volunteering in drug and alcohol rehabilitation units and mental health facilities, and this is a breeze.\n\nSo interesting. Yeah, we, we've done a little bit of work, um, with Smart Recovery. Yep. Um, and, um, yeah, we've got some friends doing some work with Salvation Army and stuff. What's, what's the biggest difference with the volunteering, do you think? Is it the type of volunteering or the way it's structured, or what's the biggest difference?\n\nWell, in the other volunteering gigs, I was teaching yoga and mindfulness meditation, helping them get through rough periods, especially in the drug and alcohol unit. Um, here it's more about holding the space and listening and letting them talk, but also [00:05:00] referring them onto services that can help them. Mm.\n\nOur original, um, head dude here, Andrew, was really thorough on making sure that we had all the resources to network people to help, that we couldn't provide for them here. Mm. That's interesting and it is a networking place. Mm. One of the new volunteers asked me, what's the, um, ask Izzy? Mm. And I said, well, that's a place where people can go online and look for accommodation for the night or food.\n\nAnd things like that. And I saw there's all different languages there and um, yeah, I know that something to do with the backpackers or different people or, I don't know. I didn't write that. Cool. Anything else stand out for you or things we didn't touch on that you're keen to make sure you said or? No.\n\nAll good. Just really happy working here. It's, it's a good gig. It's a good gig. So good. Alright, [00:06:00] take.\n",
  "themes": [],
  "themeIds": [
    "rectrmVvUcXInt47C",
    "recgfFfc1ia2xIQ4Y",
    "recF9yYWcXYedqnfd",
    "recUTOD127IIbvdtj"
  ],
  "shifts": [
    "rec7Rp0dprgIjD1sI"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}