{
  "id": "recyUKSVQDCtYL9ia",
  "name": "Ranbir Chanhan",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "A man shares his experience at Orange Sky Laundry where he appreciates the help with washing his clothes. He talks about his background in IT and experiences in different countries. He discusses his family history and connections to the Indian Royal family. The conversation covers various topics like travel, photography, and living in different parts of Australia. The man also mentions visiting Mount Isa and his hometown of Muswellbrook. The discussion shifts to real estate prices and city planning in New South Wales. The transcript ends with a friendly",
  "quotes": [
    "recrmpTTZJ170ZnIr",
    "recVXoVEdIOdpnHaW",
    "rec8CBndL7MqR8ys3",
    "recpFvwbdbpS0eqhG",
    "recqkhlMbppsJLWYw",
    "recVe0chP3zYIbGCX"
  ],
  "transcript": "Good morning and welcome to this Orange Sky Laundry Help. Laundry Help, I came last week to meet them and they said they can wash. So I live in an entrance of my own. So I got a few bed sheets and pillow covers which I can't normally wash. It takes a lot of struggle to wash it. So they are giving me a chance to wash my big clothes. How did you find out about it? Very good, very helpful and friendly nature. And they are quite good accommodating. Thank you very much. How did you find out about Orange Sky? Actually somebody, I came to this Anglican store and they give some time nice fresh bread. So I told they said I can go here. They run out sometimes. So they said just go across the road to the neighborhood center and they give free lunch. Okay. And they give free lunch as well on Thursday. So I came on Friday and they gave me the opportunity to wash. So I bring today my clothes to wash Orange Sky. What's your last little bit of life been like? Where have you been staying? I've been staying in the entrance and it's near the Round Board Community Center. They used to come washing vehicle. I don't remember the washing machine. They stopped due to the long, their own problems. They used to come from Newcastle or somewhere. So they used to go to Picnic Point. And now they're thinking to start the community washing. So I come here to find out. So I'm trying to pursue them. I'm trying to pursue them to go to the entrance and have a quick wash like Batu Bay or Picnic Point or any other way. And how long have you been in Australia for? I came in 1989. Basically I'm an IT expert, steel making. So I had no problem. In fact, I got the job without interview. After seeing the bio data because I had a very long experience in IT and a steel automation expert. So basically I was in inventory control system. So I got job as a system analyst. And there was some organization technology change. So they carved out the BHP IT. So and then there was some gap. And the company went on things, changed. So again then I got job in South Australia LPD. This is called Long Product Division. No one steel. So one steel was taken over by Liberty. So I was there then come back here then worked with few new software government department. But as you know that IT has major changes because it was mainframe. Then come the other technologies. PC and networking. Now you got the broadband technology coming wide. Wi-Fi, you know. The things changed a lot. So then I did some problem and medical problem, health problem. Because I had been sitting in air conditioning. So I had a heart surgery. The doctor said work in the open. So I just walk around open, you know. That's cool. It's going to be one second. I just got to do this one thing. So you are a professional photograph? Why do you think this service is good? What's it do for you? Because I don't have to. So you are a professional photographer? Yes. I just do it for the job. I wait, you know, is it coming right time, you know. Fixed day, fixed time to do the job. It save me all day planning. That's good. And what do you think about the volunteers? Oh, they are quite good, friendly, nice, chat, you know, accommodating. That's what I can say. Yeah. Yeah. What sort of stuff do you talk about with them? Just anything. Just general. What's happening in the life and with their life and my life, you know. Do you get to stay in contact with many people at the moment? Like family or friends or other people? Yeah, yeah, I do. I do get. But everybody is busy in their life, nine to five. And that's it. Yeah. People do get pretty busy, don't they? Yeah. What's this in here? This is, I bought the conventional cooker. Oh. From the, they put it today and I bought from the, what is that called, Salvation, what they store there. Salvation or what? Salvation Army? Yeah, I think. There are two, three, you know. Yeah. Salvation Army, British Army, they are one and the same thing. Yeah. They spy for the British Imperial family. Oh. Do you know that? No. No, I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. I don't know. Yeah. I come from Indian Royal family. Yeah. I got hundred of graves. They say visa, visa. I say what for visa? We give five villages and they educated my great grandfather, nephew in England, Saint Hurst. Oh. And he become friend with King Edward. So, he was in King's Eleven, playing horse ball. Playing horse ball, water ball, cycle ball, elephant ball. Well, you know, polo, polo. I haven't seen elephant polo. Polo, you have to, so many people play polo. It's a cool sport, yeah? Yeah, it's similar town. Yeah. The Dixie town. Do you ever get to go back home? They did the research, yeah. Do you ever get to go back home? Yeah, yeah. I go to double story house in Bajnath. They do the hang gliding. They do the double story house in Cairns. They do the double story house in Cairns. They do the double story house in Cairns. They do double story house in Cairns. And the same place, they just move. Yeah. The same place, they just move. They did the research. Did you ever get to go back home? Yeah, yeah. I got a double-story house in Vajnath. They do the hang gliding. You should go and do the photograph. So, recently so many accident happened. There is no safety and no means, no safety control and administration. People come there, a lot of Tiptian refugee, Karma Palawa lives there. People go for meditation. He has got a ten-story building. And this is a different world. And people jump from the 18,000 foot and rest in the ground. They hold the World Cup on hang gliding. World Trophy, Wills Trophy. The Wills Company arranged the first prize. That's cool. Yes. And you don't do it? No, I can't do it. Back surgery. In my time it was not there. I do only rafting, swimming. I play hockey. He's tired, right? Yeah, very good. His gene must be very hot for you. Oh, that's okay. I think it's very hot. I live in Brisbane. What part of Brisbane? Do you know Analeigh? No. I went to Serena Beach. It's a very small beach but very big name. I don't know where that is. There is a hay point. It's the biggest coal loading yard. The coal, coking coal, gas. It's a very big place. It's a very big place. The coking coal goes from there. Yeah, I know where the port is. Yeah. Not Port of Brisbane. Hay point. Hay point. It's a sugar cane belt. Oh, you're right. It's Humbus, Serena, Mackay. Mackay, yeah. Mackay. Oh, yeah. I was in Mackay the other day. Yeah. Lots of mines up there. Yeah. I lived in my childhood. Oh, really? But my mother could not pass the dictation test. Yeah. So we had to go back to home. Where far? North Punjab. Because her father was British Army captain. He was POW in World War I. He's a wrong story. Indians didn't give credit. British took all the credit themselves. Like in Australia, you know. Like with Scottish, Irish, you know. Yes. So what do you think about this? The situation is going to improve or going to worst? Where at? In this Syria, Syria, Lebanon, Israel. I don't know. I really like the area. Turkey. Yeah. I worked in Libya. Oh, yeah? You've got the limestones. Really? I was in WHO. I was not direct under state government. I was the, I had to play the inventory control. Oh, yeah. I had to play the inventory control system for the medicine movement. So when I came, I had 10,000 US dollar. And that time, 10,000 was very big amount. Yeah. You have traveled in Syria, Jordan, Lebanon, Egypt. I've seen Jordan. I've seen that Petra. Yeah. And I've been to Kuwait. Did you go to the desert? I've been to Thailand. Yeah, yeah. Very good. With the Bedouins? Yeah. See the house. The palm tree and some sand and some sheeps and goats. Yeah. It's beautiful there. Because the goat eat the grass. The sand, the grass grows. Its life is a very short period. So it has got different constituents. You give to the local newspaper? No, I work for Orange Sky. Orange Sky. What does the Orange Sky does? It's a local newspaper. Oh, okay. So you work for Orange Sky? Yeah. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Yeah. Orange Sky. Orange view. Orange Sky. Orange Sky. Orange Sky. Orange Sky. Orange Sky. ODALIKлин NARAYANI? Yeah.可是 Kiwo? A う afin kiwo? That's Jet jakiwo? Yeah. So there's almost no Mrs Wilあれ style at the moment. mujaiya y medio diar kneeг bag Rosie? Otherwise. I worked for them a long time ago. Is it a salaried job or just volunteer? Me? I used to be like a brand manager there and now I don't work there but I just help them with stories and videos and photos. So you get paid for this work? Yeah, yeah. Not very much. They pay hourly or daily? No, I just estimate because I go for like five days and then I just estimate how much it costs me for hotels. So you go countryside? Sometimes but I'm going to go to Mount Isa. Mount Isa? Yeah, North Queensland. Yeah. There's a mining area? Yeah. So how many people live there? 25,000. Quite a lot. Very good. So how do you go? By plane? Yeah, Qantas has a plane and Virgin and Bonsai. So how much is the land? Is it cheap there? Yeah. By house? Yeah, I think maybe average 300,000, 400,000 maybe. I'm actually going back to Muswellbrook today. That's where I was born. Muswellbrook? Yeah, that's near the Cessnock. Yeah. So what is there? It's my hometown. Yeah. I met one person, they're very coming. Maitland? Yeah. How far is from Maitland? One hour. One hour. Yeah. I go to Cessnock. Yeah, Cessnock's one hour. Yeah. But the price is going up. Ah, yeah. So when people going to Cessnock from Sydney. Yeah. Newcastle. Because they're trying to shift the city workload. So they're shifting this all governments to Maitland. Few days shifted. And then they're going back to Maitland. And then they're going back to Maitland. Yeah. So, there's a lot of people. Yeah. Yeah. So, you know, it's a lot of people. Yeah. Yeah. So, they're shifting. And few they are shifting. Only just the parliament in New South Wales. Yeah. And that's it. All the work will be done there in Cessnock. Yeah. Cessnock, Maitland. Yeah. My friend had Indian restaurant there in Maitland. Oh, really? So, they come back and this one. That's good. Good night. Good night. So, volunteer? Huh? This is a volunteer. Yeah. Yeah. So, you know, I'm a volunteer. Yeah. Yeah. So, you know, I'm a volunteer. Yeah. So, you know, I'm a volunteer. Yeah. So, you know, I'm a volunteer. Yeah. Yeah. So, yes, please. Yeah, you may. Yeah. Yeah. Yeah.",
  "themes": [],
  "themeIds": [
    "recveHyHHcfoQ3A0u",
    "recA7PSCrXXjjurFn",
    "recjTorQgJgsbndhq",
    "reck5SmnUZTL59C0o",
    "recMCKuiX4afEOBST"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}