{
  "id": "recygGg4T0Nt5ZsyD",
  "name": "Richard Calligan",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Mackay",
  "videoDraftLink": null,
  "summary": "Richard Calligan, the regional president of St. Vincent de Paul in Mackay, discusses his involvement with Orange Sky, highlighting the importance of providing laundry services and fostering connections through conversations. He emphasizes the synergy between St. Vincent de Paul and Orange Sky in serving the community's needs, particularly around times like Christmas and the start of the school year. Furthermore, he expresses a desire for the Mackay community to address housing issues and work together towards providing accommodation for those in need.",
  "quotes": [
    "rectVhcehkrJJqOrJ",
    "recd8SRbY33NPugJ7",
    "recdqDIkRbC6YefVB",
    "rec1S8ztOBshMyZdZ",
    "rec1lVTkeXupIuu7o"
  ],
  "transcript": "It does wear you out. Cool, a little mic test, I reckon we're good. Sweet. Alright, just tell me your name and spell it, it would be awesome to kick off. And you can just look at me and yeah, just normal chat. My name is Richard Calligan, that's R-I-C-H-A-R-D, Calligan, C-A-L-L-I-G-A-N. Cool. So tell us a little bit about what you do at MINIS. Currently I'm the regional president of St Vincent de Paul. St Vincent de Paul has groups of people called conferences and there's about eight conferences in Mackay. Special works, like the one I'm usually involved in, which is St Peter's Prisoner's Aid Conference. There's parish-based conferences and there's about eight of them. And my role as regional president is to bring those conferences together once a month to discuss how things are going. Look at issues and try and provide some practical resources to people in need in Mackay. Well good. How did you first hear about Orange Sky? I heard about, well, I suppose over years ago, there was some publicity around Orange Sky's first presentation in Mackay when they used a van sort of situation and so I was aware of that. And then when I became regional president, I was told that Orange Sky was going to be a good place to do that. I became much more aware of the previous regional president. He had provided an opportunity for Orange Sky to use our resources here in terms of a place so they could be a much more stable presence rather than working out the front through a van situation. That's cool. And what do you think is the most important part of Orange Sky, I guess, for the Mackay community? Like there's conversation and watching and connection. What do you feel at best is representative of the impact? From my experience, it's been the... It's hard to separate the washing from the conversation. It's the... Providing that opportunity for people to wash clothes. And there's a... What I've learned is that there's a range of reasons why people may need to wash clothes, including the breakdown of your own washing machine. It doesn't mean your destitute or anything like that. It just means that you need an alternative. And I think that's great that that's provided for Orange Sky and the opportunity to talk to people. And that's connection, which is a lot about what St Vincent de Paul does. Orange Sky... ..schedules their visits here on the same days we have our family support days, which are opportunities for people to reach out to St Vincent de Paul and interact with us, to get some support in terms of groceries, or some other financial support to meet their needs. That's cool. What's the joint kind of value, do you think, with St Vincent's and Orange Sky working together? Does that create more impact if you partner and work together? I think it makes sure that this site... ..this site is utilised much more often than St Vincent de Paul. So it's a benefit to us from that, and the facility and resources that are available. We can make it available to one little group who then is able to make that available to others in the community. Just a different... We don't do washing, but we do provide conversation and we do provide that outreach to people. It's very... I can't think of the word, but it's very... It's not serendipitous, but it's certainly very helpful. That's awesome. That's awesome. What's, like... How do you represent the Mackay community in terms of the need for this? Like, is there a lot of need for this, and do you think there's, like, it's a growing need, or how's the community in general in terms of its, like, stability and people's... I think the thing that stands out to us is, like, irrespective of whether Orange Sky is here or not, that there's still people in our community who, through one means or another, need support. And we find that that's particularly around Christmastime and the New Year time, around the start of schools. People just need additional support. Maybe some of the money they have can go into rent and other utilities, whereas we can provide relief in terms of giving them some groceries or some grocery vouchers so that they don't have to spend that money on food. They can spend it on... They can spend it on other things. And that certainly is a very big demand around those two times I've talked about, around December and January. But around the cooler months, not that it gets too cool in Mackay, but, again, there's that persistent need, and it's been growing. And certainly working... Our retail stores provide the resources that we're allowed... that allow us then to share that with local people. And how do you think service providers and other support in general helps Orange Sky to grow and create better impact, like, in terms of around the whole of Australia, I guess? Like, why should other people partner with Orange Sky to deliver services? I think... It's... I think it's a bit of a novel approach. And people are looking... I think most people in our community want to make sure our community thrives. And Orange Sky is a way... Orange Sky is a way... is a way for people to contribute to the community in a very practical way, and without putting much demands on them. And there's no meetings to attend, it seems. There are just opportunities to come in and work with people and build up relationships that would allow someone to... who's been in...find themselves in a difficult situation... I know the word I was looking for. It's synergy. There's a certain synergy between the work we do and what Orange Sky does. And it just allows pathways, different pathways for people. That's what... Some people may not like the opportunity to go and sit in an office and interview people. In Orange Sky, you're just sitting down with people having coffee while their washing's being done. So, maybe less confronting for some folk. And certainly very practical, I think. That's what people would really enjoy. Practical help. And what's your hopes and dreams, I guess, for Mackay as a community? And the people of Mackay? What would you like to see happen and grow in this community? I'd like to see that there's a great need for housing and accommodation. And I'd like to think that this community can provide that. Because we are a wealthy community and a generous community. We just need mechanisms and government and other groups within society to all push in the one direction. And be persistent. Because these things don't happen overnight. So I'd like to think Mackay can provide the accommodations. This site that we're sitting at now is going to be turned into six accommodation units. And do our work, some Mr DePaul work, and do the work of Orange Sky, provide Orange Sky another base to work from. That's awesome. I reckon that's it. Unless you have anything else that you would like to say on camera or things that you need to say on camera? I'd just say that St Vincent DePaul is grateful for the opportunity to work with Orange Sky and provide service to people in need. So good. And you do work at the Watch House, yeah? Yeah. Awesome. As I say, on a Sunday we go there and people fight. They might be, they might be in a fight.",
  "themes": [],
  "themeIds": [
    "rec19tUkQJFS6U3h2",
    "recCZOikK6STXq6Po",
    "recYmKskr1dQ3a3kj",
    "rec62o2qnJi9TjGD9",
    "rec5VJ52T8zytETi7"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}