{
  "id": "recyHOPWtVxDynAGg",
  "name": "Luke Napier",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Perth",
  "videoDraftLink": null,
  "summary": "Luke, a volunteer with Orange Sky, shares his journey of becoming a born-again Christian and finding purpose in volunteering. He emphasizes the importance of relationships and friendship, highlighting the impact of volunteering on the community. Luke encourages others to volunteer, stressing that every little bit counts and can make a significant difference. He believes in the power of giving time to help others and shares that volunteering at Orange Sky is rewarding and impactful.",
  "quotes": [
    "recPfbsxeC1RJgBhy",
    "recBz6hJsdnnfe1DW",
    "rec2sOQWUFYUDWXEx",
    "recIbPFhF5rC2LbW1",
    "recd0rayvFif4OLl7",
    "recozxNHUZxAYqce5",
    "rechVTyVcejXKZMlw"
  ],
  "transcript": "Anyway, bro, five years ago, up until five years ago, I was, yeah, the last person you would think. Oh, really? Oh, yeah. Cool. Yeah. So there's hope for everyone. A hundred percent. A hundred percent. Even for this guy down there with the, doing the tricks or whatever with the slingy. There's hope for him. Cool, man. Are you going to stand there, you reckon? Oh, yeah, yeah, sure. Yeah. Cool. I'll get you crispy in this frame. Maybe come one little step. Sure, man. And stop. That's great. Oh, that's just mine. I know. Sound rating. Sound rating or whatever. Yeah, right. Yeah. All right, man. Tell me your name and spell it would be awesome. Sure. And you can just look at me. Yeah. Okay. My name's Luke. L-U-K-E. Cool. And what's your last name? Napier. N-A-P-I-E-R. Wicked. Yes. Tell us a tiny little bit about yourself, Luke. I'm nearly 40 years old. I've been doing Orange Sky volunteering here for the past year. For the past five years, I've been a born again Christian. That is a major part of my life. Prior to that, I did not have a life. I'm self-employed. I work for myself. This is for me doing this type of thing is actually so it's much more than the laundry. It's making connections, actually hearing what people need. And yeah. How'd you hear about Orange Sky? So four years ago, I was a student at the University of New York. I was a student at the University of New York. I was working Ligturismo for basically two years. And I did my business there. I ran the business, and then I, I was at my business Klein City. fellowship plan three years ago at my church. We were going to do a laundry and shower truck service. survey stuff because I was like wanting to volunteer with SES and the whatever I had I'd said that I wanted to do as far as like you know my because it goes with the questionnaire of do you like to help people do you like to be hands-on this and that this and that and eventually it said oh we found something suitable for you laundry sir and laundry with this and I was like with my spiritual belief I was like wow lord you know you brought me back to the laundry and once upon a time I also worked in the laundry so seems laundry is part of where I'm meant to be and I do love the spiritual thing about it is that me with my faith Jesus washes us until we have salvation you know our faith is the belief is that people are kind of um how to say look not in any way of finger pointing at people but we we are dirty in in in ways of the world and not holy basically and Jesus washes us clean allows us to have a fresh start um a new start um that's the best thing about Jesus and and his hope is that you know he gives us a new start and I love that that's with the laundry is it's washing clothes it's you know you know washing our the garments for people to to be clean again it's very it's cool like that now like this isn't a hugely deep thing but I do like the little um the little kind of roundabout ways um you know things that like this always seem to happen for me yeah that's cool man that's cool um what keeps you coming back to Orange Sky what are the special things about it that can keep you excited about um about doing this stuff um so I do like uh I'll be out on the streets um doing ministry out on the streets as well so I do make connections with people um when they see me here as well they um it just helps really build the create uh build more of a relationship with people so they actually see more elements of helping them other than just being out on the streets um some a lot of homeless people I shouldn't say a lot some of the homeless people don't take street ministers too seriously they think that they're just coming out for one reason but then coming here they also see yes this guy is actually doing stuff helping us like this so it just gives me a little bit um better leverage so to speak um to as far as building relationships with them where they have trust um Orange Sky releases podcasts with the F word and the F word with friends yeah can you conceptualize that idea of friendship not just in what Orange Sky does but in your own life as well what's the power of friendship yeah um 100% for me the meaning of life is relationships with people we were not created to be alone um you know loving your loving one another helping one another um my belief with what the bible says is that um there's no greater love than to lay one's life down for his brother for his friend um so that's the power of friendship yeah but it's one of my biggest credences in life yeah yeah um what so tell us a little bit about like this is quite a unique Orange Sky service can you sort of explain how it works with Tranby and the Washington one sure um so Tranby is you know one of the um main homeless subs here in Perth um there's a few other you got More Street which has the mobile service Ruawah I don't know uh there's Ruawah over in Northbridge as well so this is a one of the primary services surprising us places for the guys to come to. Washing is incredibly important. There are people who you know are on the street just through bad circumstances sometimes and are trying their best to say get work and they need to have clean clothes for and showers for job interviews this type of stuff. It's an incredibly important service to help those people and just for people to have a little bit of self respect definitely. What would you say to people who are thinking about volunteering but not sure or like the elements that they're scared about or worried about? Don't worry. Absolutely don't worry. And don't feel that you can't volunteer enough. Whatever you can do time-wise even if it's once a year that makes a huge difference. If 50 people volunteered once a year that's 50 times more than you can do. 50 extra weeks you know 50 shifts covered so every little bit counts from everybody 100% can't stress that enough. You're always watched. You've got your communication with each other so that's always safe. You build up rapport with the friends as well so you gauge what's you know who you can be more relaxed around who to be mindful of but always be respectful and courteous and that kind of covers your butt. Don't stress but don't stress just volunteer. You know it's it's yeah. Very like so I've been trying to recruit for here and it's you know because we need we need volunteers. Yeah I hope that's why you're here is to help try and get volunteers. Yeah. I think story is one of the most powerful tools right. Yeah. To convey. Yeah. Messaging. Anything else you wanted to say. Yeah don't actually underestimate what we're doing here. There's a lot of things that we can do. The connections that we do make here like when I say don't underestimate I mean for the people whoever's going to read this or watch it whatever. It is definitely making a difference in a big way. You might not always see it immediately but down the track you will see it. You'll see the difference in people's lives and there's no great yeah really honestly this is time well worth well spent. Well worth doing. It's very easy to live for ourselves but it's much more rewarding to live for someone else and to help someone else giving your time. You know we touched on time today and time your time can't be given or taken. So when you give your time for somebody else that's one of the biggest things that you can do. Yeah. Right. Okay. Well done mate. Cool man.",
  "themes": [],
  "themeIds": [
    "recyNLuyreSXLU648",
    "recFqkc943JZE7kFL",
    "recfi9KleqYxWeM9L",
    "recjwcHTzTvuHvjfT",
    "recV8YEUencBJs3QN"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}