{
  "id": "recZ4VAKpuPyadhym",
  "name": "Wayne Tait",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Central Coast",
  "videoDraftLink": null,
  "summary": "Wayne Tate talks about his experience with homelessness and how Orange Sky services have helped him stay clean, have clean clothes, and maintain his self-confidence. He highlights the importance of human connection and non-judgmental interactions for those experiencing homelessness. Wayne also discusses the need for community support and understanding towards individuals in tough situations. He praises the volunteer-based model of Orange Sky and the satisfaction volunteers receive from helping others.",
  "quotes": [
    "recwGBD4AAlxCjtxn",
    "recy4rBTWZJAIuC4N",
    "rec7x81F9xwTCvvpD",
    "rec2A84TBsn9klZWW",
    "recnAIvggomIIaJYZ"
  ],
  "transcript": "I try and dress fresh, you know what I mean? I try and be clean. And I like the process of doing it, so that's why I like our own sky. I miss having a home, I miss doing that home procedure sort of thing. So I come here on a Tuesday, Catootlie neighbourhood on a Friday. Everyone's good, everyone's polite. Awesome. So what we're going to do, we're going to do your name, and then if you can spell it, that'd be awesome as well. Sure, my name's Wayne Tate. You just talk to me, it's fine. Yeah, W-A-Y-N-E T-A-T-E. Cool, man. You know, 47, born and bred here on the Central Coast. Actually went to Wollongong High School just down the road here. You know, it's sad to be in your own hometown and not have anything, and then to see the services pop up that make you feel comfortable in your own skin is awesome. I go to the truck stop out here at the freeway every day, shower. If it wasn't for the Orange Sky service, I wouldn't have the clean clothes to whack on every day. You know, I can walk amongst the supermarket, and not look like that homeless person if there's such a stigma, you know. Me, I'm a very self-cautious, confident sort of person, and I want that clean clothes. I want the services. The ladies are amazing. Everything. They let me fold, me washing. Everyone's told me that I fold it better than they do. I want to volunteer. I've got a volunteers check. When I find a home, I'd love to do some Orange Sky work. Everyone's polite. It's a shame that I've had the same van comes around. I reckon there should be a couple more vans that can go site to site, if they could probably put a few more out. Tell us a little bit about your story though. Like, who are you? What's your identity? Okay, I went to university, pharmaceutical manufacturer. I worked as a chemist here in Wyland Plaza for 15 years under the Hollingsworth. If you've been a local area, you'd know that. The Hollingsworth and the local family, the chemist here, owned a home, Norah Head, nice beach house. I was 30 year old before I had to sell that. I'm 47 now. So I've now since gone on my diploma in hospitality. Not having a base of a home and stuff like that. I'm not working, can't find work. So I was doing it hard, out of parks, linked to home, using the services to, to meet a gentleman and a kind gentleman that works as a train driver. Offered me his van, with no money up front, camper van, and to pay it off. So I get $700 a fortnight and I pay $500 a fortnight on my camper van. I have $200 to live. So once I throw $150 in a fuel tank of fuel to get to my showers, my orange skies and my services, which keep me alive, I'm left with $50 a week. I mean a fortnight. And that's basically deodorants. The things you need to keep clean and stuff like that. Without these kind of services, I don't, I dare say my depression would have taken over and I probably wouldn't even be here sitting and talking. You know? So I've been at both ends of the spectrum. Had a nasty divorce. My kids are all looked after, as in inheritance wise. So when I sold my half, my money went to the children. And then all that touch it to their 18. What else can I say? There's some nice people here. You know, like, you turn up, do the right thing. The ladies are so kind. They remember your name even on the second time coming. You know? Yeah. What's the reality for a lot of people in the Central Coast in terms of, are there a lot of people in your, in a similar position? There's people worse. There's a lot of people worse off. There's so much worse off in my position. I'm lucky to have that camper van. I've just had the clutch do. So I've got a $2,500 repair that the mechanic knows I'm homeless and just let me walk away with. Alright? I have to pay a little bit off, but he doesn't want me to pay it until this van's paid off and on my feet. So I've just had $2,500 worth of mechanic work done for nothing. So homelessness get helped. If you see the right people and you be honest about it. There's a lot of people who are just not paying it off. And I'm not saying that I'm not paying it off. I'm just saying that I'm not paying it off. I'm just saying that I'm not paying it off. There's a lot of people using the system as well. But there's a lot of people living in parks. Little humpy's tents here, tents there. I feel for them. So if I'm doing better than them, they come into my van, I'll let people charge things up. I'll help the situation. Putting the rent higher for people to struggle is not going to solve anything. The homelessness is getting worse and worse. What about like connection and conversation? And like all of those things. Do some people miss out on that? And is that a part of what services provide? That like human type stuff? Absolutely. I've got one friend I'm talking to now. And on my phone. The rest is all a pretentious Facebook message. The rest is all a pretentious Facebook message. People you haven't seen. So you do need that reality. You do need that... That rubbing shoulders with someone. Someone that doesn't judge. These people don't... These people that help you in these services, they don't seem to judge. I went to school with Kylie. In here. You know? They don't judge. Tukley Neighbourhood Centre, my first miss is this Aboriginal councillor and Samoan councillor there. There has been a conflict of interest they reckon. They'd rather me not go to Tukley to get my washing done and services. But they said it's okay for me to... If I need to. But... It is what it is. Um... If you see somebody that's homeless, you say hello. If you see someone that's in the same position, you make them feel like there's a conversation so you can have that vent or you can rub with the world and you still are worthy of something. Because it does take it away from you. It strips you bare. Um... What do you think... What do you think needs to happen from a community perspective to reduce... You were talking about stigma, right? What do you think people need to know or change in terms of the way in which they interact with people who are doing it a bit tough? You know what I mean? Like, are there things that people can do better? Well, people like myself that don't want to put themselves out there for a lot of help won't get help if you don't need it. So they could be maybe approaching these people and say, hey, you've got a bit more confidence in these guys. Obviously, there might be addictions that these people might have, but you're still rubbing shoulders with the same people. Maybe they can just take more interest in you. You're there for a reason. You know? So I can come to these places, do my washing, and then not one of these people, if you don't ask for it, will actually come forward to you. There's too many people wanting or needing the help. There's not so much want. So there could be a bit more but the ladies are all volunteering. The gentlemen all volunteer. You can't expect much more. You know? Everyone here has been great. Why do you think it's important, like, Orange Sky runs on donations? Like, there's not a lot of government support or that type of stuff. Why do you think it's important for, because it's a volunteer thing, right? They're not getting paid. Why do you think it's important to support that model and support Orange Sky to be able to do that through funding? Well, people get a great deal of satisfaction about volunteering. You can only get looked on any aspect. People volunteer across the board in so many different aspects. I actually thought they had that Orange Sky when I came with a major sponsor that was able to fund it. I wasn't quite sure that it works on donations alone. It would probably make it hard when there's a service down like there is today in the van. Things like that would make it difficult if the money's not sort of there. That's cool. Brad, I reckon that's it, brother. Yeah, good. I reckon, what would be awesome, like, I'm going to take a quick picture. If you want to just stand up for me. You've got to go out particularly on Friday to do this? Yeah, Friday. Yeah, they told me to go out to Orange Sky on Friday and I thought, no, I need Washington between now and then. Came in early. Alright, brother, just look out in there. Do you want to take one without glasses? Yeah. Alright, one sec. Oh, that's very bright. So you're a photographer or you're just running around? I dabble in lots of things. Photography's one of them. It's Marvel or whatever you want to do. Just come over here for a sec. I'm just going to get out of the sun. If you're there, this will be helpful. Yeah, because you're out of the light. Mate, you know what you're talking about, don't you? Alright, one sec. Alright. Cool. Maybe go out more, so you're like almost, you're, and... Yeah, awesome. What would be awesome to do is just get like a couple of random shots of maybe you and your van and you with your washing machine. Yeah, no. Do you want to wait until your washing comes or? Ah, let's go and check out your van. Yeah. Do you like it? Do you mind just parking in one parking spot? Yeah, I will.",
  "themes": [],
  "themeIds": [
    "recyA0eD7g2NWx3ju",
    "rec5fxKvj6RFGPOj8",
    "recl0uqjD1kC0sgXS",
    "recuxtIWKVnyng8Vd",
    "reczw5uYzaN2NprYj"
  ],
  "shifts": [],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}