{
  "id": "reczavUNQLV6Z9XZE",
  "name": "Paul Morris",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Rockhampton",
  "videoDraftLink": "https://share.descript.com/view/L5pk3Y1RKgu",
  "summary": "The transcript features an interview with Paul Morris, a Salvation Army officer who has worked in drug and alcohol rehabilitation. He discusses his background and journey to joining the Salvation Army.",
  "quotes": [
    "rec1o7W4MotSeQNoV",
    "recaZAHr8YcHvfD7G",
    "rece3GPu7NMZ4j7Y5",
    "recQrVKvHbi0avk8i"
  ],
  "transcript": "# Paul Morris\n\n[00:00:00] \n\nOn.\n\nAlright. Okay. First of all, just your full name and then spell it. You just have to talk to me. Good. Don't worry about the camera. Uh, Paul Morris, uh, P-A-U-L-M-O-R-R-I-C-E. Cool. Tell us about yourself first. Um, I was born and bed here in Rockhampton. Um, been an officer, now a Salvation Army officer now for 23 years.\n\nUm, so a lot of that time I've spent a fair bit of that time spent doing drug and alcohol work with, um, yeah. Managing, um, rehab centers that the Army has. Um, been back here in Rockham now only for five months. We started here at beginning of the year. Previously to that, um, we were in Emerald, and previously to that we were in Rome.[00:01:00] \n\nSo we've been around a bit the last couple of years, but, um, it's good to be back here and home, I guess. Yeah, that's a bit about us. Married. Cool. Amazing. What's, um, what drew you to Salvation Army? You work initially? Uh, I think as a, as a, as a Christian, I think we were. I guess we were drawn to the army, um, in Emerald back in the late nineties, um, when we first had contact with the SALs in Emerald.\n\nAnd then, um, yeah, just got, had a, had a fellow of God calling on our life to, to become officers. Um, yeah, so we did our, went to college in Sydney for two years full time and yeah, come out and then it's just the army appoints you where, where you need it. So it's just a matter of. Being obedient to that and doing the best you can with what you have wherever you are.\n\nSo, yeah. So that's all I [00:02:00] ask. What, um, what keeps you staying with Salvation Army? What are the things in which give you most to say pride? I think for me it's, I guess it always comes back to that calling of my life, you know, you know, God's called me to be an officer and, and, um, and that's what keeps us doing what we're doing.\n\nAnd it's the love, you know, the love Jesus. Us and that's, we are called to actually show that to others. That's sort of what keeps us going there. There have been times where we thought, maybe not for us, but we've always fallen back on that calling on our lives and stuck to it and yeah. Just, um, keep going.\n\nCool. Um, when, when, when did you first hear about Orange Sky? When we first heard about Orange Sky, um. Probably around, oh, maybe when we were, when we were back in Sydney, um, [00:03:00] probably about eight or one years ago, we, we heard of Orange Sky. Um, never, never really had a lot to do with, with them, um, at that point.\n\nBut obviously with the, with all the, um, I guess media and. And, and stuff like that around orange sky. We've become more familiar with it. And, um, and when we moved here, we'd, um, obviously, um, orange Sky had, you know, set up, set up a pod here on our, on our property here. And we ha obviously that happened before we got here, but we, you know, we're quite happy to.\n\nUh, continue that partnership, um, with Orange Belt. Great. What, what, what do you think it does in your own mind, in your own words? Like, I think it, I think it actually gives people, um, a bit of dignity that they can actually come somewhere without being judged and, um, and get some clean clothes. Come in basically, and on the chat and you know, um, and, and obviously [00:04:00] us being here on the site as well, if there's any other issues we can, um, we can help them with.\n\nUm, 'cause we do have a, um, money care worker, one of our money care workers based here on site and also our, our doorways case workers also, um, managed here on site as well. So, um, if there is, you know, any, any need in that area of space, they can, you know, the Sky TV. Just come up to the, come up to the building and, and let us know and we can have a chat with them.\n\nWant, I say, like I say, it gives them that dignity about, there's nothing like putting, you know, nice clean clothes on. You know, even if it is only once a week do you care, which. What you had. Um, what's this idea of partnership, do you think that supports? Um, like what's the benefit, I think of having partnerships rather than trying to do everything yourself.\n\nOh, I think it's just that, I think it's, we can't do, we can't do everything. We don't have the resources or. Um, the manpower, um, to [00:05:00] offer the every service that's needed. Um, obviously there are services that we do offer, um, you know, uh, uh, having, you know, quite here on site just enhances that partnership that we can't, I guess it's a gap that, you know, orange sky can fill and we we're happy to partner with them.\n\nSo, and like I say, too many years we've. And, um, it's never really got us anywhere. So I mean, to work together is, is, uh, it's the way forward. Collaboration is one of our values and, um, and that's what we try and do. What, um, do you think is next in terms of supporting the community more in Rockhampton? Do you think there needs to be more support?\n\nAnd what type of support do you think? Um, obviously, um, in most areas these days, it's the, it's the housing problem. Um. And we're actually actively working towards [00:06:00] hopefully filling a gap in that space as well. Um, we have a large block of block of land next door to us here, um, that we're hoping to source some funding, um, to put some housing on.\n\nUm, yeah, so that's probably the biggest, biggest, I guess it's not just for here in Rockton either. It's, it's all over housing an issue, affordable housing. Um. That. That's the biggest that we see. Yeah. Cool. Anything else we didn't get to, you think or No, mate. Amazing. Can I take a photo now? Smashed it.\n\nSmashed it? Yeah, that's good. Okay. Reckon you can stay there.\n",
  "themes": [],
  "themeIds": [
    "recNLE23zfE4CQKmI",
    "recDmZb9Y33JUpWuA",
    "recL5vx0tVVch8oqh",
    "recJY4KtatV9Uc4fF"
  ],
  "shifts": [
    "recCNOxNimkdXbQWq"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}