{
  "id": "recZeJyxFE4FNSfuO",
  "name": "James Dinsdale",
  "role": "Friend",
  "project": "Orange Sky",
  "location": "Melbourne",
  "videoDraftLink": "https://share.descript.com/view/1LEzz6t10N0",
  "summary": "James Dinsdale, a resident of Foothills, talks about his past travels and family history linked to the area. He mentions his melanoma diagnosis preventing further travels. His family name has roots in the local community dating back to the 18th century.",
  "quotes": [
    "recuEKbK1HOjygmiH",
    "recSSfYObuqjn7a16",
    "reclzxbK5CtT5iAOo",
    "recT7d6N6JwoaCT3s",
    "recogsOvpjNrynPg5"
  ],
  "transcript": "James Dinsdale - Friend - Foothills\n\n===\n\n[00:00:00]\n\nSpeaker 3: Don't worry about anything else. And then just say your name for me and spell it for me.\n\nSpeaker 4: James Dinsdale. J-A-M-E-S-T-I-N-S-D-A-L-E.\n\nSpeaker 3: Cool.\n\nSpeaker 4: Tell me hail from here.\n\nSpeaker 3: Tell me a little bit about yourself.\n\nSpeaker 4: Nothing much. 72. I live in Fuji, um, unemployed. Uh, own my second house. Got my car, which is good. Um, being to New Zealand, Tasmania, Hong Kong in Norfolk Island, loved them all.\n\nBut that was when I was, before I had my melanoma, which was about five years ago. So stopped me from traveling. So, um, yeah. Can't go overseas anymore. Too much luggage to take with me. If you know what I mean? Yeah. Um, yeah. [00:01:00] Um, and my family name, excuse me, has come from this area.\n\nSpeaker 3: Yeah. We stop. Stop it. Yeah.\n\nSpeaker 4: Yeah. My, ah, something like my family name, the gentleman. You recording or we start?\n\nSpeaker 3: Uh, no, we'll just wait for the lady. I think she wants to for a second. My\n\nSpeaker 4: gentleman that came out from England in the 18 hundreds. He came from England and he came here Gully. And I found out not so long ago that we were in that family line Dinsdale.\n\nSo we got a award and a street name went after us. So, you know, and um, have an orchard back in Baroni or somewhere, you know. So I think they did something to the cancel. I'm not too sure. So, you know, I believe they had a, [00:02:00] I think a timber yard down at, uh, the village down here. Mm-hmm. So corner of Victoria and Station Street.\n\nSo, and an old truck, a Chevy truck, which is down there. Ambleside homestead.\n\nSpeaker 3: Mm-hmm.\n\nSpeaker 4: Which I've got a picture of that one. And what's with me in it? What,\n\nSpeaker 3: what's your life like at the moment where you are? Uh,\n\nSpeaker 4: I like it because of the hills.\n\nSpeaker 3: Yeah.\n\nSpeaker 4: The hills. Sounds a bit weird, but the hills remind me of the Grampians, which I love, but it'd just be near the hills.\n\nThat's all.\n\nSpeaker 3: And why do you like coming down here to this service? Why do you like coming to this service and the food and the,\n\nSpeaker 4: just the company. It just, I just use community meals just for socializing. 'cause I live by myself, so, you know. Yeah. Meet people like that lady you just saw then, you know, so, and a few other people.\n\nSo yeah, just come. Because I live by myself. Yeah, sure. So that's about all. Make company, make friends or try you.\n\nSpeaker 3: What do you [00:03:00] like about the Orange Sky Service?\n\nSpeaker 4: Free service. Um, say me doing a bit of washing, but you know, they can clean it and dry it and fold and all you gotta do is just put it away when you get home.\n\nHmm. You know, so I only, I only use 'em once a week and that's about it. The rest of the time I do with washing at home. If the's sun's shining, then it dries 'em out in one day.\n\nSpeaker 3: What do you feel about the sense of community or connection here? What do you think about connecting with other people and the community here?\n\nUh,\n\nSpeaker 4: it's okay. Get on with people. Some people, you know, made a lot of friends. Um, I go to a lot of other meals and. Again, I said to just socializing, but a bit of traveling. Mm. That's the only problem, you know? So, um, we all missed the one on a Sunday going to Mitchum, but, you know, it was too crowded. [00:04:00] Uh, that's another thing I like about, sorry for saying this, not so much this meal, but other meals I went to, like last night at Dubon were open.\n\nYou've got room to move. So when you move your chair, you're not bumping into the chair behind you. You know? So again, it's company people, so you know. Yeah.\n\nSpeaker 3: What's, uh, getting out and\n\nSpeaker 4: about.\n\nSpeaker 3: What, what do you think about, um,\n\nthis idea of struggling? Is that something that you think about much or is it Yeah.\n\nSpeaker 4: Story for going on? Sorry. But, uh. I got solar. I've had solar for about 12 years. Started off with six panels, and during about 10 years of that 12, I was coping, but now I've got 12 panels and I was making money on 12 panels, and then all of a sudden that got squashed.\n\nYou only get 3 cents rib [00:05:00] kilowatt. You sh put back in the grid. Mm. You get nothing back. Can you turn the camera off? I've got something to tell you. I don't want to, I don't wanna say it wrong. Okay. Um,\n\nSpeaker 3: do you know, do you know much about the, the, the meal stuff here and what, how they do, do you know anything about like the, the, the hall here and the meals?\n\nDo you know how that happens?\n\nSpeaker 4: I've been coming here for quite a few years. I'm about one of the oldest people, people that have been coming here. So I've got to know people that have changed, different people that have changed, but still, you know, still the same people that are serving and all like that is again, it just a community meal free.\n\nAh, it's one of the meals that's closest. The other one, you know, close. 'cause I live in Ali, so this one's close. Yeah. But I don't care. Traveling, you know, it pinch go. 'cause the last place I went to was Linbrook, which is about over half an hour away. You know, that started at a reasonable [00:06:00] time, which was five o'clock.\n\nSo, you know.\n\nSpeaker 3: That's cool. And, and do you know much about the community here? What's the community like in, in like the broader community?\n\nSpeaker 4: Uh, I dunno, actually there's no, no big shops up here. It's just like a little country town, you know? So I don't mind it. Uh, I do hate going to Knox, but, you know, but, uh. I used to like going to Croydon, 'cause Croydon looked like a country village.\n\nUm, then now I'm living out here. It's like a country town. It's still suburbia, you know? So it's got what I want here anyway. Mm. Especially my bank. That'd be critical because I was only the Westpac. Westpac had a branch of Boronia and Mountain Gate. Now I've gotta go to Stud Park. [00:07:00] I had to talk to the lady yesterday.\n\nI said, oh, can you go back to Mountain? Go to a stud park? No, I meant, why? What'd you get rid of the two of them? Instead of just one of them? So I'm about to change banks, which my bank's just down here so easy to go to because Stud Park is so far, uh. Westfield is not that far, but trying to get out because of the parking.\n\nMm-hmm. Immediate, you know, gotta pay to get out, you know, so, but yeah, it's okay. The only other place I go to is Forest Hill, which is where I used to live because the three parking and everything's there. Another thing too, the post office at Knox disappeared at Christmas because the rent Westfield was too high.\n\nSo I've gotta go other, go to Boronia. But then again I go to Forest Hill 'cause everything's at Forest Hill. Oh. Um, stud Park. You go to the post office there and it's too [00:08:00] crowded, which is, you know, but then the one at Knox was big. Yeah. And it got rid of it.\n\nSpeaker 3: Anything else about Orange Sky that you, you wanted to talk about or notice or No.\n\nWhat do you think? Anyway,\n\nSpeaker 4: I got on with the people that run it and of course this is. I've used the Tuesday and I've used the Monday. So it's different people. So, you know, um, I believe there's other that run around everywhere else around me. I haven't been there yet, but I'm happy with what I'm doing here anyway.\n\nSo good to have something for nothing, but then I don't abuse it. I do me washing, own washing at home too, so it's only just, I said once a week. So, um. Mainly what I do here is I do my bed sheets 'cause my machine can't handle it. It's too big. So that's about all. But you know, so\n\nSpeaker 3: good. Cool. Well we're gonna take a little photo, if that's all right.[00:09:00]\n\nYou can tell me about my photo skills,\n\nSpeaker 4: David.",
  "themes": [],
  "themeIds": [
    "recnGLIxu3psrPnlk",
    "rec3FFuLKIRZ4BkFO",
    "recveo65xDioPieOz",
    "recCvwWNYHdwFC2LP"
  ],
  "shifts": [
    "recMnBRiSmrELgnVe"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [],
  "storyCount": 0
}