{
  "id": "reczc8EPrsTTXYhNq",
  "name": "Brigit Perry",
  "role": "Volunteer",
  "project": "Orange Sky",
  "location": "Canberra",
  "videoDraftLink": "https://share.descript.com/view/PYinI6C5pZ1",
  "summary": "Briget Perry grew up in Northern California, met her husband online in 2002, and moved to Canberra in 2011. She volunteers for Orange Sky, drawn to their innovative mobile laundry service. Raised by charitable parents, she has a passion for giving back to the community.",
  "quotes": [
    "rectg68nVpuUKyxrn",
    "recOdHkPtBakFjdD4",
    "rec4rABRjohleeqrE",
    "recuuwYDChoM66m18",
    "recQLvXTWPDNuPHCr",
    "rec2UEYebjWjce2zT"
  ],
  "transcript": "Briget_Perry\n===\n\n[00:00:00]\n\nBriget Perry: B-R-I-G-I-T. Yep. P-E-R-R-Y-R-Y. Cool. And would you like me to send this to you in email or telephone number or text? I think email would be good. Okay. What's your email? It's Bridget Perry, B-R-I-G-I-T-P-E-R-R-Y. go@outlook.com.\n\nAlright.\n\nI grew up in Northern California in Sonoma County wine country, and I lived there for most of my life. I met my now husband online in 2002 before it was cool. He likes to say, oh, cool. 2001 actually. And we got married in 2011 and I moved.\n\nHere to [00:01:00] Canberra. My husband grew up here in Canberra. I lived here his whole life. So I moved here and I've been here ever since. It's just a little bit about me. When did you first hear about Orange Sky? When Nick and Lucas won Young Australian of the Year. Wow. Yeah, I love watching Young Australian, or I love watching Australia the year.\n\nI love hearing everybody's stories. I always have had a big piece of my heart in charity work, and I love that people are creative in the ways that they can give to a community and the innovation that people do for things. And I thought, oh my gosh, a mobile laundry service. How? Totally brilliant. What a great, amazing idea.\n\nSo I was really impressed. And when they came to Canberra and they were looking for volunteers, I signed up immediately. I said, I want in on that.\n\nI think mostly it's just [00:02:00] because of the way that I was raised. I was raised by very giving generous parents, and I grew up in a church that was very loving and it was always about taking care of people in your community and people around you. And I also for a while, worked with kids in out-of-home care and one of my housemates she worked for.\n\nA women's shelter and it's just like a, an awareness that there are people in your community that need help.\n\nOrange sky has done such a good job of taking that stigma out of it and saying, this is a person and this person has a name, and this person has a story. And it's not just about out doing something, doing a service. It's also like talking to that person, making them feel like human and like they're someone worth talking [00:03:00] to.\n\nI have a lot of conversations with my kids about it. I have two kids. One is 10 and one is seven. And they know that I come on shift on Monday nights. I have to get out of the house on time. I wear my. Uniform. And when I get home they wanna know how did it go? Did you meet anyone new? Did you do a lot of laundry? Those kinds of things. And it's really nice to be able to share with them why I do it and why it's important to take care of people, even if they're people that you don't know.\n\nIt's no secret. I tell everyone that I volunteer and, i've made it known to a lot of people. I've done the Sudsy challenge a few times. I like having those conversations and telling people this, there's more to life than just doing what you do. It's about giving back to your community.\n\nIn the beginning it was really cool to be like, oh, a mobile laundry service.\n\nBut then to have seen things [00:04:00] evolve over time and then to say it's not just about laundry. It's about letting people. Be heard, and people who are homeless often go all day without talking to anyone. So to have a place for people to come and talk to people, that's huge. That's a huge connection point that people are missing.\n\nAnd to make that realization in the process of, oh, we're doing something great by washing people's clothes. Oh, but also there's an added benefit to it that might even be more important.\n\nA lot of conversation is waiting for your turn to talk. You say something, I think of something to say in response, but sometimes people just want to be listened to and you don't have to say anything in response.\n\nYou could just listen. And that makes it very validating for that person to just have somebody listening and go, oh, really? Oh, that's what's [00:05:00] going on for you? Oh, that must be hard, or That must be nice. Or whatever it is. Yeah. Yeah. The more I do this stuff, the more I realize, like stories are very broad.\n\nIn my in my Orange Sky world, I have been trying to push that. Volunteers in Canberra need alcohol and other drug harm reduction training. I think that's really important for volunteers here. Because of the decriminalization of personalized or drugs for personalized use. And I think that there are a lot of times that people on shift, especially at night encounter people who are using drugs or are on drugs at the time that they come to shift.\n\nAnd if there was an overdose, would volunteers know how to do something about that or. [00:06:00] If they notice somebody's on drugs, is there a way to feel more comfortable and not be just immediately scared and think, oh no, that's a scary drug addict. Like they're people too. They use drugs. Yes. But they need to be seen as people just like everybody else.\n\nSo I really like there to be some sort of harm reduction awareness training for volunteers in Canberra.\n\nHaving service providers to partner with is a really smart way of doing things because it's not just we park the van and that's it. Like we park the van and we have Vinny's come, or we're at. Red Cross Roadhouse or early morning Center where they're serving food or whatever it is.\n\nIt's not just the one thing, it's we've partnered with someone else and that's the business model and it's smart. So I think always expanding and [00:07:00] thinking of how you can expand the service that little bit farther is really smart.\n\nIt's just a matter of, trying to get HQ and the service volunteer here and all of that stuff. All the pieces put in the right places. I've been trying, I've been trying to do it.\n\nWhen I started, a volunteer that was on shift with me had said that somebody asked her, oh, that's great that you're volunteering your time, but like, why not just give them money? And she's you can give all the money in the world, but if there's nobody willing to. Do the time on the shift, then what's the point?\n\nYou have to have somebody doing the work. And that's what I like to tell my kids. Like it's not just about what you can give money to, 'cause that's important also, but it's about being there, being the hands, making it work. Otherwise it falls apart. Yeah. Yeah. Make us are very good at [00:08:00] trying to. Dumb down the impact of one part of the organization and being like, everyone lifts it, right?\n\nWhether it's a little kid giving five bucks to volunteer volunteers or yeah. Trying to work out how they can have that full understanding of what it takes to run this things.\n",
  "themes": [],
  "themeIds": [
    "recHieZerfPg8iqWD",
    "reccpniUkftUThinE",
    "recGbLuqeuLHuPFyN",
    "recgokWjjlc2lVsvU"
  ],
  "shifts": [
    "rec7aoqOpJ7eomAfm"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "recYMTb7IgVqCsmGU",
    "recflDdZnZu4D6CWg",
    "recjy3UzIQrIcy3an"
  ],
  "storyCount": 3
}