{
  "id": "reczKGffzeCWabbbe",
  "name": "Pam Ramsay",
  "role": "Service Provider",
  "project": "Orange Sky",
  "location": "Melbourne",
  "videoDraftLink": "https://share.descript.com/view/EDalmz13DhX",
  "summary": "Pamela Ramsey, a retiree from Melbourne, is involved in volunteering at a charity in Bali focusing on animal welfare. She had to find new ways to stay active after retirement plans were disrupted by Covid-19.",
  "quotes": [
    "recyaflDtGD50cb7P",
    "recUDTfQKDfu2mZiM",
    "recKmDKfyw8V5GRx8",
    "recE609FkCagqEUy6",
    "reciC3UXVRMra8g4Q"
  ],
  "transcript": "Pamela Ramsey - Vol - Foothills\n\n===\n\n[00:00:00]\n\nSpeaker 15: The main thing is that your cool. So all you have to do is tell me your name and first name and last name, and spell it. Okay. And you can talk straight to me. That's, that's just weird. Okay. I'm\n\nSpeaker 16: Pam, PAM, or Pamela Ramsey. R-A-M-S-A-Y from Melbourne, obviously. What else do you need to Oh, spell it? Uh, yeah.\n\nR-A-M-S-A-Y. Amazing. Yeah.\n\nSpeaker 15: Tell me a bit about yourself.\n\nSpeaker 16: Well, I am. I'm nearly 70 years old. Hmm. Don't like saying that out loud. Um, I'm retired. I've been retired for a few years now. I'm widowed. I, my husband died a long time ago. Uh, I've got two grown up daughters and four grandsons. Um, so when I retired, um, I'm actually, I'm involved in a charity in Bali.\n\nUh, where we run a, I'm a massive animal lover and we run a des sexing [00:01:00] program for dogs and cats. And when Covid hit. I couldn't travel to Bali. I couldn't do any fundraising here, so I looked, I'd just retired. So I looked around for basically something to fill my time because Covid destroyed my retirement plans.\n\nMm-hmm. Um, and I found these guys on the website. I think I Googled volunteering opportunities or. Something like that because I didn't want to work with food and I didn't want to work in an op shop. And I went, oh, that looks good. And here I am, not quite four years later, I do usually twice a week. Um, yeah.\n\nSo good to be able. I love it. I love it here. It's, um, it's friendly. I live quite close to here and I actually know. Some of the people that come here, I see, oh, I don't really know them, [00:02:00] but I run into them in the shops and we have a chat and um, it's, you know, it's nice. It's a very homey sort of community around here.\n\nA bit different to some of the other challenging places that I travel to. Some of them are a bit more challenging than here. Here is very easy, very friendly, as you can see. Mm-hmm. Yeah.\n\nSpeaker 15: Awesome spot.\n\nSpeaker 16: Yeah.\n\nSpeaker 15: What's, um. Um, is there something that's changed in you from starting to volunteer to now in terms of like maybe what help is or what homelessness is or anything around those types of things?\n\nUm,\n\nSpeaker 16: yeah, I think, I think, I think there, well we do, we do in here and we come across quite a few genuinely homeless. People, there's a lot of people living in their cars. Um, a lot of people live up in the mountains in the national park. Mm-hmm. You know, they'll [00:03:00] pitch a tent somewhere quiet up there. But most of the people that we deal with here, and also at Dandenong, where I go quite a lot, are not really homeless, but more disadvantaged and being able to help, you know, even if it's just your.\n\n10 or $15 a week to go to the laundromat to come here, I think makes a huge difference to their finances. Mm-hmm. Um, you know, I'm fortunate enough that I don't have to live on a tiny little pension, but, you know, it, it's a tough gig, um, especially for people who've gotta pay rent, doesn't leave them with very much.\n\nSo a lot of the people, they come here for a meal. They might come here for meals, they'll get their washing done, they go somewhere else tomorrow night for a meal. A lot of them travel to three or four different places through the week. Um, [00:04:00] which, you know, obviously helps out. Um, so yeah, I, I think let, there's, well, don't get me wrong, I, I'm not saying that there's not an issue with homelessness because there most certainly is, but, um.\n\nCertainly around here. Uh, it's not as much as I thought it would be, or they're just not coming here. There are, there are lots of, still lots of homeless people around here. There's a couple of guys that I see sitting outside the supermarkets and stuff that I never see come here. You know, I stop and have a chat to them and tell them about this place, but they don't want to come.\n\nA lot of them don't. They wanna be just left alone. Mm-hmm. Um, so yeah. Yeah. So I guess in that way it's, it's changed.\n\nSpeaker 15: What's, I'm really interested in this idea of like, what is a story and how do people tell them? What's the idea of stories around the van, I guess? And are those stories powerful for you, for the people that come?\n\nOh [00:05:00] look,\n\nSpeaker 16: what's that like? Well, I think, uh, a lot of the people that come here look on us as their counselors. Um, we get told lots of stuff that probably don't. Need to know. Um, and, but it, it's good. I love it that they're comfortable enough, people are comfortable enough to come and tell us their troubles.\n\nUm, yeah, I mean obviously I'm not gonna share the stories that they tell us 'cause it's their, their stories. But, um, yeah, we do, we do hear lots and I'm sure they'd be happy to tell you. Yeah.\n\nSpeaker 15: And what's, what's, where, where do you think that role of the volunteer is most, you know, more important? Like,\n\nSpeaker 16: well, it is definitely as a pseudo counselor, as well as, and, and a lot of the people that come here, uh, especially don't get their washing done, but they still come out and have a chat and, [00:06:00] you know, tell us their, they tell us their troubles.\n\nThey tell us the good stuff as well. Um, yeah, so. Uh, yeah, I think, um, certainly there's, there's certainly more to orange skies than doing people's washing. Um, and you know, we've become quite close to, to the point where if they're not here, I worry about them, which Steve in there always says, don't worry.\n\nThey, they come back. But I'll go home and worry about where, you know, somebody that I think is a bit vulnerable is if I don't see them the following week. Mm. Um, I've probably got better at that over the, over the four years. Yeah. Don't lay awake at night as much as I used to. Yeah.\n\nSpeaker 15: Wow.\n\nSpeaker 16: Yeah.\n\nSpeaker 15: Um, what's been part of growth or enjoyment or whatever for you for this?\n\nLike what, what, why do you keep coming back? Oh, personally,\n\nSpeaker 16: [00:07:00] uh, look, people volunteer for all sorts of different reasons and, um, you know. Some of the volunteers that I've met, some, some of them do it to get hours on a uni degree or on a course or something. Some do it. I, I grew up in a family. We volunteered.\n\nI was brought up to always give back. Um, my mother was a doer, you know, she was involved in, she was one of those ladies that did that, did the flowers, and polished the brass, and she was a girl guide leader and. It's just, I don't, I don't know. It's just a thing I've always, I've always done. And once I retired, I was able to do more of it.\n\nAnd as I said, covid, I probably wouldn't have done it without Covid 'cause I would've just continued doing my, um, barley gig. Um, but I had time on my hands and I'm not good at having time on my hands. I have to fill my [00:08:00] time. Sure. So, yeah. Yeah. It's just, you know, volunteering's just what. You know what people do, you, people either do, they're either a giver or a taker, I guess, but you know, and personally, you, you know, you, it makes you, it makes you feel good to help people, um, makes you feel good inside to know that you've helped somebody.\n\nYou are even, you know, just, and, and some people are so grateful to have their washing done. People who are genuinely homeless and you're able to give them. Especially in winter, you know, a nice basket of nice folded, clean, dry, nice smelling, washing makes them feel really good. So it makes me feel good.\n\nThat's really it. So\n\nSpeaker 15: awesome. Yeah. So good. Hey, I'm just gonna take a photo.\n\nSpeaker 16: Okay.\n\nSpeaker 15: I reckon I can do it like this.",
  "themes": [],
  "themeIds": [
    "recGhIsfFcMrizrUT",
    "recr2hTSvcgLCIWgR",
    "recChQdJ5kWyGqAe5",
    "recks5IMot5a2l3L4"
  ],
  "shifts": [
    "recMnBRiSmrELgnVe"
  ],
  "profileImage": null,
  "rawVideoPhotos": [],
  "storyIds": [
    "rec6h9d2uWEsp5Rpp"
  ],
  "storyCount": 1
}